Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: But if @code{fill-prefix-regexp} does have a value, Emacs evaluates the then-part of the @code{if} expression and binds @code{parsep} to a regular expression that includes the @code{fill-prefix-regexp} as part of the pattern.
es: Pero si @code{fill-prefix-regexp} tiene un valor, Emacs eval@'ua la parte then de la expresi@'on @code{if} y asocia @code{parsep} a una expresi@'on regular que incluye el @code{fill-prefix-regexp} como parte del patr@'on.

source: Specifically, @code{parsep} is set to the original value of the paragraph separate regular expression concatenated with an alternative expression that consists of the @code{fill-prefix-regexp} followed by optional whitespace to the end of the line. The whitespace is defined by @w{@code{"[ \t]*$"}}.) The @samp{\\|} defines this portion of the regexp as an alternative to @code{parsep}.
es: Espec@'{@dotless{i}}ficamente, @code{parsep} est@'a asignado al valor original del p@'arrafo que separa la expresi@'on regular concatenada con una expresi@'on alternativa que consiste del @code{fill-prefix-regexp} seguido por espacios en blanco opcionales para el fin de la l@'{@dotless{i}}nea. El espacio en blanco est@'a definido por @w{@code{"[ \t]*$"}}.) El @samp{\\|} define esta porci@'on del regexp como una alternativa a @code{parsep}.

source: According to a comment in the code, the next local variable, @code{sp-parstart}, is used for searching, and then the final two, @code{start} and @code{found-start}, are set to @code{nil}.
es: De acuerdo a un comentario en el c@'odigo, la siguiente variable local, @code{sp-parstart}, se usa para buscar, y entonces los dos finales, @code{start} y @code{found-start}, se asignan a @code{nil}.

source: Now we get into the body of the @code{let*}. The first part of the body of the @code{let*} deals with the case when the function is given a negative argument and is therefore moving backwards. We will skip this section.
es: Ahora tenemos dentro el cuerpo del @code{let*}. La primera parte del cuerpo del @code{let*} trata con el caso cuando la funci@'on es dada a un argumento negativo y consiguientemente movi@'endose hacia atr@'as. Nosotros saldremos de esta secci@'on yendo hacia atr@'as.

source: The forward motion @code{while} loop
es: El bucle @code{while} hacia adelante

source: The second part of the body of the @code{let*} deals with forward motion. It is a @code{while} loop that repeats itself so long as the value of @code{arg} is greater than zero. In the most common use of the function, the value of the argument is 1, so the body of the @code{while} loop is evaluated exactly once, and the cursor moves forward one paragraph.
es: La segunda parte del cuerpo del @code{let*} trata con el proceso hacia adelante. Eso es un bucle @code{while} que se repite si el valor de @code{arg} es mayor que cero. En el uso m@'as com@'un de la funci@'on el valor del argumento es 1, as@'{@dotless{i}} el cuerpo del bucle @code{while} se eval@'ua exactamente una vez, y el cursor se mueve hacia adelante un p@'arrafo.

source: This part handles three situations: when point is between paragraphs, when there is a fill prefix and when there is no fill prefix.
es: Esta parte maneja tres situaciones: cuando el punto est@'a entre p@'arrafos, cuando hay un prefijo de relleno y cuando no hay prefijo de relleno @emph{fill prefix}.

source: The @code{while} loop looks like this:
es: El bucle @code{while} se parece a esto:

source: ;; @r{going forwards and not at the end of the buffer} (while (and (> arg 0) (not (eobp)))
es: ;; @r{yendo hacia adelante y no al fin del b@'uffer} (while (and (> arg 0) (not (eobp)))

source: ;; @r{between paragraphs} ;; Move forward over separator lines... (while (and (not (eobp)) (progn (move-to-left-margin) (not (eobp))) (looking-at parsep)) (forward-line 1)) ;; @r{This decrements the loop} (unless (eobp) (setq arg (1- arg))) ;; ... and one more line. (forward-line 1)
es: ;; @r{entre p@'arrafos} ;; Mueve hacia adelante a trav@'es de l@'{@dotless{i}}neas de ;; separaci@'on... (while (and (not (eobp)) (progn (move-to-left-margin) (not (eobp))) (looking-at parsep)) (forward-line 1)) ;; @r{Esto decremento el bucle} (unless (eobp) (setq arg (1- arg))) ;; ... y una l@'{@dotless{i}}nea m@'as (forward-line 1)

source: (if fill-prefix-regexp ;; There is a fill prefix; it overrides parstart; ;; we go forward line by line (while (and (not (eobp)) (progn (move-to-left-margin) (not (eobp))) (not (looking-at parsep)) (looking-at fill-prefix-regexp)) (forward-line 1))
es: (if fill-prefix-regexp ;; Hay un prefijo lleno; que sobreescribe parstart; ;; vamos adelante l@'{@dotless{i}}nea por l@'{@dotless{i}}nea (while (and (not (eobp)) (progn (move-to-left-margin) (not (eobp))) (not (looking-at parsep)) (looking-at fill-prefix-regexp)) (forward-line 1))

source: ;; There is no fill prefix; ;; we go forward character by character (while (and (re-search-forward sp-parstart nil 1) (progn (setq start (match-beginning 0)) (goto-char start) (not (eobp))) (progn (move-to-left-margin) (not (looking-at parsep))) (or (not (looking-at parstart)) (and use-hard-newlines (not (get-text-property (1- start) 'hard))))) (forward-char 1))
es: ;; No hay prefijo; ;; vamos hacia adelante caracter por caracter (while (and (re-search-forward sp-parstart nil 1) (progn (setq start (match-beginning 0)) (goto-char start) (not (eobp))) (progn (move-to-left-margin) (not (looking-at parsep))) (or (not (looking-at parstart)) (and use-hard-newlines (not (get-text-property (1- start) 'hard))))) (forward-char 1))

source: ;; and if there is no fill prefix and if we are not at the end, ;; go to whatever was found in the regular expression search ;; for sp-parstart (if (< (point) (point-max)) (goto-char start))))
es: ;; y si no hay prefijo y si no estamos al final ;; ir a lo que fu@'e encontrado en la b@'usqueda de expresiones regulares ;; para sp-parstart (if (< (point) (point-max)) (goto-char start))))

source: We can see that this is a decrementing counter @code{while} loop, using the expression @code{(setq arg (1- arg))} as the decrementer. That expression is not far from the @code{while}, but is hidden in another Lisp macro, an @code{unless} macro. Unless we are at the end of the buffer---that is what the @code{eobp} function determines; it is an abbreviation of @samp{End Of Buffer P}---we decrease the value of @code{arg} by one.
es: Se puede ver que esto es un contador de decremento @code{while}, usando la expresi@'on @code{(setq arg (1- arg))} como lo que se decrementa. Esta expresi@'on no est@'a lejos desde el @code{while}, pero est@'a oculta en otra macro Lisp, una macro @code{unless}. A menos que estemos al final del b@'uffer --- esto es lo que la funci@'on @code{eobp} determina; eso es una abreviaci@'on de @samp{Fin del Buffer P} --- nosotros decrementamos el valor de @code{arg} por uno.

source: (If we are at the end of the buffer, we cannot go forward any more and the next loop of the @code{while} expression will test false since the test is an @code{and} with @code{(not (eobp))}. The @code{not} function means exactly as you expect; it is another name for @code{null}, a function that returns true when its argument is false.)
es: (Si estamos al fin del b@'uffer, no podemos ir m@'as hacia adelante y el siguiente bucle de la expresi@'on @code{while} chequear@'a falso desde que el test es un @code{and} con @code{(not (eobp))}. La funci@'on @code{not} significa exactamente como se esperaba; eso es otro nombre de @code{null}, una funci@'on que devuelve cierto cuando su argumento es falso.)

source: Interestingly, the loop count is not decremented until we leave the space between paragraphs, unless we come to the end of buffer or stop seeing the local value of the paragraph separator.
es: De manera interesante, el bucle cuenta que no se decrementa hasta que deje el espacio entre p@'arrafos, a menos que vuelva al fin del b@'uffer o pare viendo el valor local del separador del p@'arrafo.

source: That second @code{while} also has a @code{(move-to-left-margin)} expression. The function is self-explanatory. It is inside a @code{progn} expression and not the last element of its body, so it is only invoked for its side effect, which is to move point to the left margin of the current line.
es: El segundo @code{while} tambi@'en tiene una expresi@'on @code{(move-to-left-margin)}. La funci@'on es autoexplicativa. Eso est@'a dentro de una expresi@'on @code{progn} y no el @'ultimo elemento de su cuerpo, as@'{@dotless{i}} es solo invocado para su efecto lateral, que es mover el punto al margen izquierdo de la l@'{@dotless{i}}nea actual.

source: The @code{looking-at} function is also self-explanatory; it returns true if the text after point matches the regular expression given as its argument.
es: La funci@'on @code{looking-at} es tambi@'en auto-explicativa; eso devuelve cierto si el texto despu@'es del punto asocia la expresi@'on regular dada como su argumento.

source: The rest of the body of the loop looks difficult at first, but makes sense as you come to understand it.
es: El resto del cuerpo del bucle se ve compleja al principio, pero tiene sentido cuando se comprende.

source: First consider what happens if there is a fill prefix:
es: Primero considera que ocurre si hay un prefijo de relleno @emph{fill prefix}:

source: This expression moves point forward line by line so long as four conditions are true:
es: Esta expresi@'on mueve el punto hacia adelante l@'{@dotless{i}}nea por l@'{@dotless{i}}nea tan lejos como que las cuatro condiciones son ciertas:

source: Point is not at the end of the buffer.
es: Punto no est@'a al final del b@'uffer.

source: We can move to the left margin of the text and are not at the end of the buffer.
es: Podemos mover al margen izquierdo del texto y no estar al fin del b@'uffer.

source: The text following point does not separate paragraphs.
es: El siguiente punto no separa p@'arrafos.

source: The pattern following point is the fill prefix regular expression.
es: El patr@'on que sigue el punto es la expresi@'on regular prefija rellena.

source: The last condition may be puzzling, until you remember that point was moved to the beginning of the line early in the @code{forward-paragraph} function. This means that if the text has a fill prefix, the @code{looking-at} function will see it.
es: La @'ultima condici@'on puede ser un puzzle, hasta que se recuerde qu@'e punto fu@'e movido al principio de la l@'{@dotless{i}}nea temprana en la funci@'on @code{forward-paragraph}. Esto significa que si el texto tiene el prefijo relleno, la funci@'on @code{looking-at} se ver@'a.

source: Consider what happens when there is no fill prefix.
es: Considera qu@'e ocurre cuando no hay un prefijo lleno.

source: This @code{while} loop has us searching forward for @code{sp-parstart}, which is the combination of possible whitespace with a the local value of the start of a paragraph or of a paragraph separator. (The latter two are within an expression starting @code{\(?:} so that they are not referenced by the @code{match-beginning} function.)
es: El bucle @code{while} nos tiene buscando hacia adelante para @code{sp-parstart}, que es la combinaci@'on de posibles espacios en blanco con un valor local del comienzo de un p@'arrafo o de un p@'arrafo separador. (Las @'ultimas dos son con una expresi@'on empezando con @code{(?:)} as@'{@dotless{i}} que no est@'an referenciadas por la funci@'on @code{match-beginning}.)

source: The two expressions,
es: Las dos expresiones,

source: mean go to the start of the text matched by the regular expression search.
es: significa ir al comienzo del siguiente texto localizado por la expresi@'on regular.

source: The @code{(match-beginning 0)} expression is new. It returns a number specifying the location of the start of the text that was matched by the last search.
es: La expresi@'on @code{(match-beginning 0)} es nueva. Eso devuelve un n@'umero especificando la posici@'on del comienzo del texto fuese asociado a la @'ultima b@'usqueda.

source: The @code{match-beginning} function is used here because of a characteristic of a forward search: a successful forward search, regardless of whether it is a plain search or a regular expression search, moves point to the end of the text that is found. In this case, a successful search moves point to the end of the pattern for @code{sp-parstart}.
es: La funci@'on @code{match-beginning} es usado aqu@'{@dotless{i}} porque una caracter@'{@dotless{i}}stica de una b@'usqueda hacia adelante: una b@'usqueda hacia adelante, sin dignidad si eso es una b@'usqueda plana o una expresi@'on regular, mueve el punto al fin del texto que es encontrado. En este caso, una b@'usqueda exitosa mueve el punto al fin del patr@'on para @code{sp-parstart}.

source: However, we want to put point at the end of the current paragraph, not somewhere else. Indeed, since the search possibly includes the paragraph separator, point may end up at the beginning of the next one unless we use an expression that includes @code{match-beginning}.
es: Sin embargo, se quiere poner el punto al fin del actual p@'arrafo, no en alg@'un lugar m@'as. En vez de eso, desde que la b@'usqueda posiblemente incluye el separador del p@'arrafo, el punto puede finalizar al principio de lo siguiente a menos que se use una expresi@'on que incluya @code{match-beginning}.

source: When given an argument of 0, @code{match-beginning} returns the position that is the start of the text matched by the most recent search. In this case, the most recent search looks for @code{sp-parstart}. The @code{(match-beginning 0)} expression returns the beginning position of that pattern, rather than the end position of that pattern.
es: Cuando un argumento de 0, @code{match-beginning} devuelve la posici@'on que es el comienzo del texto asociado por la b@'usqueda m@'as reciente. En este caso, la b@'usqueda m@'as reciente parece @code{sp-parstart}. La expresi@'on @code{(match-beginning 0)} devuelve la posici@'on del comienzo de este patr@'on, en vez de la posici@'on final de este patr@'on.

source: (Incidentally, when passed a positive number as an argument, the @code{match-beginning} function returns the location of point at that parenthesized expression in the last search unless that parenthesized expression begins with @code{\(?:}. I don't know why @code{\(?:} appears here since the argument is 0.)
es: (Incidentalmente, cuando se pasa un n@'umero positivo como un argumento, la funci@'on @code{match-beginning} devuelve la localizaci@'on de punto en el que la expresi@'on con par@'entesis en la @'ultima b@'usqueda a menos que la expresi@'on con par@'entesis empiece con @code{\(?:}. No s@'e porque @code{\(?:} aparece aqu@'{@dotless{i}} desde que el argumento es 0.)

source: The last expression when there is no fill prefix is
es: La @'ultima expresi@'on cuando no hay prefijos es

source: This says that if there is no fill prefix and if we are not at the end, point should move to the beginning of whatever was found by the regular expression search for @code{sp-parstart}.
es: Esto dice que si no hay prefijo lleno y no estamos al punto final que se mover@'{@dotless{i}}a al principio de lo que fu@'e encontrado por la b@'usqueda de la expresi@'on regular para @code{sp-parstart}.

source: The full definition for the @code{forward-paragraph} function not only includes code for going forwards, but also code for going backwards.
es: La definici@'on completa para la funci@'on @code{forward-paragraph} no solo incluye c@'odigo para avanzar, tambi@'en c@'odigo para retroceder.

source: If you are reading this inside of GNU Emacs and you want to see the whole function, you can type @kbd{C-h f} (@code{describe-function}) and the name of the function. This gives you the function documentation and the name of the library containing the function's source. Place point over the name of the library and press the RET key; you will be taken directly to the source. (Be sure to install your sources! Without them, you are like a person who tries to drive a car with his eyes shut!)
es: Si est@'a leyendo esto dentro de GNU Emacs y quieres ver la funci@'on completa, se puede escribir @kbd{C-h f} (@code{describe-function}) y el nombre de la funci@'on. Esto da la documentaci@'on de funci@'on y el nombre de la librer@'{@dotless{i}}a conteniendo las fuentes de la funci@'on. Posiciona el punto a trav@'es del nombre de la librer@'{@dotless{i}}a y presionar la tecla RET; ser@'a tomado directamente a las fuentes. (@exclamdown{}Aseg@'urate de instalar las fuentes! @exclamdown{}Sin eso, estar@'as como una persona que intenta conducir un coche con los ojos cerrados!)

source: Create Your Own @file{TAGS} File
es: Crea tu propio fichero @file{TAGS}

source: @file{TAGS} file, create own
es: fichero de @file{TAGS}, crea el propio

source: Besides @kbd{C-h f} (@code{describe-function}), another way to see the source of a function is to type @kbd{M-.} (@code{find-tag}) and the name of the function when prompted for it. This is a good habit to get into. The @kbd{M-.} (@code{find-tag}) command takes you directly to the source for a function, variable, or node. The function depends on tags tables to tell it where to go.
es: Bajo @kbd{C-h f} (@code{describe-function}), otro camino para ver la fuente de una funci@'on es escribir @kbd{M-.} (@code{find-tag}) y el nombre de la funci@'on se asigna para eso. Esto es un buen h@'abito para obtenerlo. El comando @kbd{M-.} (@code{find-tag}) toma directamente a las fuentes de una funci@'on, variable, o nodo. La funci@'on depende de tablas de etiquetas para saber donde ir.

source: If the @code{find-tag} function first asks you for the name of a @file{TAGS} table, give it the name of a @file{TAGS} file such as @file{/usr/local/src/emacs/src/TAGS}. (The exact path to your @file{TAGS} file depends on how your copy of Emacs was installed. I just told you the location that provides both my C and my Emacs Lisp sources.)
es: Si la funci@'on @code{find-tag} pregunta primero por el nombre de una tabla @file{TAGS}, dado el nombre de un fichero @file{TAGS} tal como @file{/usr/local/src/emacs/src/TAGS}. (La ruta exacta a tu fichero @file{TAGS} depende de c@'omo tu copia de Emacs fu@'e instalada. Yo te cuento la localizaci@'on que provee tanto mi C y mis fuentes de Emacs Lisp.)

source: You can also create your own @file{TAGS} file for directories that lack one.
es: Se puede tambi@'en crear tu propio fichero @file{TAGS} para los directorios que faltan.

source: You often need to build and install tags tables yourself. They are not built automatically. A tags table is called a @file{TAGS} file; the name is in upper case letters.
es: Con frecuencia se necesita construir e instalar etiquetas de tablas por uno mismo. Esas no son construidas autom@'aticamente. Una tabla de etiquetas llama a un fichero @file{TAGS}; el nombre es letras may@'usculas.

source: You can create a @file{TAGS} file by calling the @code{etags} program that comes as a part of the Emacs distribution. Usually, @code{etags} is compiled and installed when Emacs is built. (@code{etags} is not an Emacs Lisp function or a part of Emacs; it is a C program.)
es: Se puede crear un fichero @file{TAGS} llamando el programa @code{etags} que viene como parte de la distribuci@'on Emacs. Normalmente, @code{etags} est@'a compilado e instalado cuando Emacs se construye. (@code{etags} no es una funci@'on Lisp o una parte de Emacs; eso es un programa C.)

source: To create a @file{TAGS} file, first switch to the directory in which you want to create the file. In Emacs you can do this with the @kbd{M-x cd} command, or by visiting a file in the directory, or by listing the directory with @kbd{C-x d} (@code{dired}). Then run the compile command, with @w{@code{etags *.el}} as the command to execute
es: Para crear el fichero @file{TAGS}, primero cambia el directorio en el que se quiere crear el fichero. En Emacs se puede hacer esto con el comando @kbd{M-x cd}, o visitando un fichero en el directorio, o listando el directorio @w{@code{etags *.el}} como el comando a ejecutar

source: to create a @file{TAGS} file for Emacs Lisp.
es: crear un fichero de @file{TAGS} para Emacs Lisp.

source: For example, if you have a large number of files in your @file{~/emacs} directory, as I do---I have 137 @file{.el} files in it, of which I load 12---you can create a @file{TAGS} file for the Emacs Lisp files in that directory.
es: Por ejemplo, si se tiene un gran n@'umero de ficheros en el directorio @file{~/emacs}, como se hace --- Yo tengo 137 @file{.el} dentro, de que se carguen 12 --- se puede crear un fichero @file{TAGS} para los ficheros Emacs Lisp en este directorio.

source: The @code{etags} program takes all the usual shell `wildcards'. For example, if you have two directories for which you want a single @file{TAGS} file, type @w{@code{etags *.el ../elisp/*.el}}, where @file{../elisp/} is the second directory:
es: El programa @code{etags} toma en toda la consola usual `comodines'. Por ejemplo, si tienes dos directorios para el que quieres un fichero @file{TAGS} simple, escribe @w{@code{etags *.el ../elisp/*.el}}, donde @file{../elisp/} es el segundo directorio:

source: Type
es: Tipo

source: to see a list of the options accepted by @code{etags} as well as a list of supported languages.
es: para ver una lista de las opciones aceptadas por @code{etags} tan bien como una lista de lenguajes soportados.

source: The @code{etags} program handles more than 20 languages, including Emacs Lisp, Common Lisp, Scheme, C, C++, Ada, Fortran, HTML, Java, LaTeX, Pascal, Perl, PostScript, Python, TeX, Texinfo, makefiles, and most assemblers. The program has no switches for specifying the language; it recognizes the language in an input file according to its file name and contents.
es: El programa @code{etags} maneja m@'as de 20 lenguajes, incluyendo Emacs Lisp, Common Lisp, Scheme, C, C++, Ada, Fortran, HTML, Java, LaTeX, Pascal, Perl, Postscript, Python, TeX, Texinfo, makefiles, y la mayor@'{@dotless{i}}a de ensambladores. El programa no cambia para especificar el lenguaje; eso reconoce el lenguaje como una entrada de fichero de acuerdo a su nombre de fichero y contenidos.

source: @file{etags} is very helpful when you are writing code yourself and want to refer back to functions you have already written. Just run @code{etags} again at intervals as you write new functions, so they become part of the @file{TAGS} file.
es: @file{etags} es muy @'util cuando se escribe c@'odigo por t@'{@dotless{i}} mismo y quiere referirse a funciones que ya se han escrito. Ahora ejecuta @code{etags} de nuevo en intervalos como se escriben nuevas funciones, as@'{@dotless{i}} llegan a ser parte del fichero @file{TAGS}.

source: If you think an appropriate @file{TAGS} file already exists for what you want, but do not know where it is, you can use the @code{locate} program to attempt to find it.
es: Si piensa que un fichero @file{TAGS} apropiado que ya existe para lo que quieres, pero no conoces donde est@'a, se puede usar el programa @code{locate} para intentar encontrarlo.

source: Type @w{@kbd{M-x locate @key{RET} TAGS @key{RET}}} and Emacs will list for you the full path names of all your @file{TAGS} files. On my system, this command lists 34 @file{TAGS} files. On the other hand, a `plain vanilla' system I recently installed did not contain any @file{TAGS} files.
es: Escribe @w{@kbd{M-x locate @key{RET} TAGS @key{RET}}} y Emacs listar@'a para ti las rutas nombres completas de todos tus ficheros @file{TAGS}. En mi sistema, este comando lista 34 fichero @file{TAGS}. Por otro lado, un sistema `vanilla plano' que recientemente no conten@'{@dotless{i}}a fichero @file{TAGS}.
