Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The @code{get-buffer} function returns a buffer with the name provided. You will note that the function is @emph{not} called @code{get-buffer-create}; it does not create a buffer if one does not already exist. The buffer returned by @code{get-buffer}, an existing buffer, is passed to @code{insert-buffer-substring}, which inserts the whole of the buffer (since you did not specify anything else).
es: La funci@'on @code{get-buffer} devuelve un b@'uffer con el nombre proporcionado. Se tomar@'a nota de que la funci@'on @emph{no} se llama @code{get-buffer-create}; eso no crea un b@'uffer si uno no existe ya. El b@'uffer devuelto por @code{get-buffer}, un b@'uffer existente, es pasado a @code{insert-buffer-substring}, que inserta el total del b@'uffer (desde que no se especific@'on ninguna cosa m@'as).

source: The location into which the buffer is inserted is recorded by @code{push-mark}. Then the function returns @code{nil}, the value of its last command. Put another way, the @code{insert-buffer} function exists only to produce a side effect, inserting another buffer, not to return any value.
es: La posici@'on dentro del buffer es insertado es grabado por @code{push-mark}. Entonces la funci@'on devuelve @code{nil}, el valor de su @'ultimo comando. Pon otro camino, la funci@'on @code{insert-buffer} existe solo para producir un efecto lateral, insertando otro buffer, no para devolver cualquier valor.

source: The basic structure of the @code{beginning-of-buffer} function has already been discussed. (@xref{simplified-beginning-of-buffer, , A Simplified @code{beginning-of-buffer} Definition}.) This section describes the complex part of the definition.
es: La estructura b@'asica de la funci@'on @code{beginning-of-buffer} ya ha sido discutida. (@xref{simplified-beginning-of-buffer, , Una Definici@'on Simplificada @code{beginning-of-buffer}}). Esta secci@'on describe la parte compleja de la definici@'on.

source: As previously described, when invoked without an argument, @code{beginning-of-buffer} moves the cursor to the beginning of the buffer (in truth, the beginning of the accessible portion of the buffer), leaving the mark at the previous position. However, when the command is invoked with a number between one and ten, the function considers that number to be a fraction of the length of the buffer, measured in tenths, and Emacs moves the cursor that fraction of the way from the beginning of the buffer. Thus, you can either call this function with the key command @kbd{M-<}, which will move the cursor to the beginning of the buffer, or with a key command such as @kbd{C-u 7 M-<} which will move the cursor to a point 70% of the way through the buffer. If a number bigger than ten is used for the argument, it moves to the end of the buffer.
es: Como se describe previamente, cuando se invoca sin un argumento, @code{beginning-of-buffer} mueve el cursor al principio del b@'uffer (en realidad, al principio de la porci@'on accesible del b@'uffer), dejando la marca en la posici@'on previa. Sin embargo, cuando el comando es invocado con un n@'umero entre uno y diez, la funci@'on considera que n@'umero ser@'a una fracci@'on del tama@~no del b@'uffer, medido en decenas, y Emacs mueve el cursor en esta fracci@'on del camino desde el principio del b@'uffer. De este modo, se puede o bien llamar a esta funci@'on con la tecla comando @kbd{M-<}, que mover@'a el cursor al principio del b@'uffer, o con una tecla tal como @kbd{C-u 7 M-<} que mover@'a el cursor a un punto 70% del camino a trav@'es del b@'uffer. Si un n@'umero m@'as grande de diez es usado para el argumento que se mueve al final del b@'uffer.

source: The @code{beginning-of-buffer} function can be called with or without an argument. The use of the argument is optional.
es: La funci@'on @code{beginning-of-buffer} puede ser llamada con o sin argumentos. El uso del argumento es opcional.

source: Optional Arguments
es: Argumentos opcionales

source: Unless told otherwise, Lisp expects that a function with an argument in its function definition will be called with a value for that argument. If that does not happen, you get an error and a message that says @samp{Wrong number of arguments}.
es: A menos que se cuente de otro modo, Lisp espera que una funci@'on con un argumento en su definici@'on de funci@'on se llame con un valor para este argumento. Si esto no ocurre, se obtiene un error y un mensaje que dice @samp{N@'umero de argumentos err@'oneo}.

source: Optional arguments
es: Argumentos Opcionales

source: Keyword
es: Palabra Clave

source: optional
es: opcional

source: However, optional arguments are a feature of Lisp: a particular @dfn{keyword} is used to tell the Lisp interpreter that an argument is optional. The keyword is @code{&optional}. (The @samp{&} in front of @samp{optional} is part of the keyword.) In a function definition, if an argument follows the keyword @code{&optional}, no value need be passed to that argument when the function is called.
es: Sin embargo, los argumentos opcionales son una funcionalidad de Lisp: una @dfn{palabra clave} particular es usada para contar al int@'erprete Lisp que un argumento es opcional. La palabra clave es @code{&optional}. (El @samp{&} en frente de @samp{opcional} es parte de la palabra clave.) En una definici@'on de funci@'on, si un argumento sigue a la palabra clave @code{&optional}, ning@'un valor necesita ser pasado a este argumento cuando la funci@'on se llama.

source: The first line of the function definition of @code{beginning-of-buffer} therefore looks like this:
es: La primera l@'{@dotless{i}}nea de la definici@'on de funci@'on de @code{beginning-of-buffer} tiene lo siguiente:

source: In outline, the whole function looks like this:
es: En el "outline" (esquema), la funci@'on completa se parece a esto:

source: The function is similar to the @code{simplified-beginning-of-buffer} function except that the @code{interactive} expression has @code{"P"} as an argument and the @code{goto-char} function is followed by an if-then-else expression that figures out where to put the cursor if there is an argument that is not a cons cell.
es: La funci@'on es similar a la funci@'on @code{simplified-beginning-of-buffer} excepto que la expresi@'on @code{interactive} tiene @code{"P"} como un argumento y la funci@'on @code{goto-char} es seguida por una expresi@'on if-then-else que figura donde poner el cursor si hay un argumento que no es un cons cell.

source: (Since I do not explain a cons cell for many more chapters, please consider ignoring the function @code{consp}. @xref{List Implementation, , How Lists are Implemented}, and @ref{Cons Cell Type, , Cons Cell and List Types, elisp, The GNU Emacs Lisp Reference Manual}.)
es: (Puesto que no se explica un cons cell en muchos cap@'{@dotless{i}}tulos, por favor, considere ignorar la funci@'on @code{consp}. @ref{Implementaci@'on de listas, , C@'omo las Listas son Implementadas}, y @ref{Tipo de Cons Cell, , Cons Cell y Tipos de Listas, elisp, El Manual de Referencia GNU Emacs Lisp}).

source: The @code{"P"} in the @code{interactive} expression tells Emacs to pass a prefix argument, if there is one, to the function in raw form. A prefix argument is made by typing the @key{META} key followed by a number, or by typing @kbd{C-u} and then a number. (If you don't type a number, @kbd{C-u} defaults to a cons cell with a 4. A lowercase @code{"p"} in the @code{interactive} expression causes the function to convert a prefix arg to a number.)
es: El @code{"P"} en la expresi@'on @code{interactive} cuenta a Emacs c@'omo pasar un argumento prefijo, si hay uno, a la funci@'on en forma plana. Un argumento prefijo se crea escribiendo la tecla @key{META} seguida por un n@'umero, o escribiendo @kbd{C-u} y entonces un n@'umero. (Si no escribes un n@'umero, @kbd{C-u} por defecto a un cons cell con un 4. Una min@'uscula @code{"p"} en la expresi@'on @code{interactive} causa a la funci@'on convertir un argumento prefijo a un n@'umero.)

source: The true-or-false-test of the @code{if} expression looks complex, but it is not: it checks whether @code{arg} has a value that is not @code{nil} and whether it is a cons cell. (That is what @code{consp} does; it checks whether its argument is a cons cell.) If @code{arg} has a value that is not @code{nil} (and is not a cons cell), which will be the case if @code{beginning-of-buffer} is called with a numeric argument, then this true-or-false-test will return true and the then-part of the @code{if} expression will be evaluated. On the other hand, if @code{beginning-of-buffer} is not called with an argument, the value of @code{arg} will be @code{nil} and the else-part of the @code{if} expression will be evaluated. The else-part is simply @code{point-min}, and when this is the outcome, the whole @code{goto-char} expression is @code{(goto-char (point-min))}, which is how we saw the @code{beginning-of-buffer} function in its simplified form.
es: El true-or-false-test de la expresi@'on @code{if} se ve compleja, pero no lo es: se chequea si @code{arg} tiene un valor que no es @code{nil} y si es un cons cell. (Esto es lo que @code{consp} hace; chequea si su argumento es un cons cell.) Si @code{arg} tiene un valor que no es @code{nil} (y no es un cons cell.), que ser@'a el caso si @code{beginning-of-buffer} se llama con un argumento, entonces este true-or-false-test devolver@'a cierto y la then-part de la expresi@'on @code{if} falsa. Por otro lado, si @code{beginning-of-bufer} no se llama con un argumento, el valor de @code{arg} ser@'a @code{nil} y la else-part de la expresi@'on @code{if} se evaluar@'a. La else-part es simple @code{point-min}, y esto es lo de fuera, la expresi@'on @code{goto-char} es @code{(goto-char (point-min))}, que es c@'omo se vi@'o la funci@'on @code{beginning-of-buffer} en su forma simplificada.

source: When @code{beginning-of-buffer} is called with an argument, an expression is evaluated which calculates what value to pass to @code{goto-char}. This expression is rather complicated at first sight. It includes an inner @code{if} expression and much arithmetic. It looks like this:
es: Cuando @code{beginning-of-buffer} se llama con un argumento, una expresi@'on es evaluada que calcula que valor pasa a @code{goto-char}. Esto es incluso complicado a primera vista. Eso incluye una expresi@'on @code{if} propia y mucha aritm@'etica. Se ve as@'{@dotless{i}}:

source: (if (> (buffer-size) 10000) ;; @r{Avoid overflow for large buffer sizes!} (* (prefix-numeric-value arg) (/ size 10)) (/ (+ 10 (* size (prefix-numeric-value arg))) 10)))
es: (if (> (buffer-size) 10000) ;; @r{@exclamdown{}Evitar sobrecarga para grandes tama@~nos de b@'uffer!} (* (prefix-numeric-value arg) (/ size 10)) (/ (+ 10 (* size (prefix-numeric-value arg))) 10)))

source: Disentangle beginning-of-buffer
es: Desenmara@~nar beginning-of-buffer

source: Disentangle @code{beginning-of-buffer}
es: Desenmara@~nar @code{beginning-of-buffer}

source: Like other complex-looking expressions, the conditional expression within @code{beginning-of-buffer} can be disentangled by looking at it as parts of a template, in this case, the template for an if-then-else expression. In skeletal form, the expression looks like this:
es: Como otras expresiones que se ven complejas, la expresi@'on condicional con @code{beginning-of-buffer} puede ser desenredada mir@'andola por partes de una plantilla, en este caso, la plantilla par una expresi@'on if-then-else. En forma esquel@'etica, la expresi@'on se ve as@'{@dotless{i}}:

source: The true-or-false-test of this inner @code{if} expression checks the size of the buffer. The reason for this is that the old version 18 Emacs used numbers that are no bigger than eight million or so and in the computation that followed, the programmer feared that Emacs might try to use over-large numbers if the buffer were large. The term `overflow', mentioned in the comment, means numbers that are over large. More recent versions of Emacs use larger numbers, but this code has not been touched, if only because people now look at buffers that are far, far larger than ever before.
es: El true-or-fase-test de esta expresi@'on @code{if} propia chequea el tama@~no del buffer. La raz@'on para esto es que la versi@'on vieja de Emacs 18 usaba n@'umeros que no son m@'as grandes que 8 millones o as@'{@dotless{i}} y en la computaci@'on que segu@'{@dotless{i}}a, el programador tem@'{@dotless{i}}a que Emacs podr@'{@dotless{i}}a intentar usar a trav@'es de largos n@'umeros si el b@'uffer fuera largo. El t@'ermino `sobrecarga', que se mencion@'o en el comentario, significa que los n@'umeros son grandes. Las versiones m@'as recientes de Emacs usan n@'umeros largos, pero este c@'odigo no ha sido tocado, solo porque la gente ahora mira en b@'uffers que est@'an lejos, tan lejos como antes.

source: There are two cases: if the buffer is large and if it is not.
es: Hay dos casos: si el b@'uffer es largo, o si no.

source: Large buffer case
es: El caso del buffer largo

source: What happens in a large buffer
es: Qu@'e ocurre en un b@'uffer largo

source: In @code{beginning-of-buffer}, the inner @code{if} expression tests whether the size of the buffer is greater than 10,000 characters. To do this, it uses the @code{>} function and the computation of @code{size} that comes from the let expression.
es: En @code{beginning-of-buffer}, la expresi@'on propia @code{if} chequea si el tama@~no del b@'uffer es mayor que 10000 caracteres. Para hacer esto, se usa la funci@'on @code{>} y la computaci@'on de @code{size} que viene desde la expresi@'on let.

source: In the old days, the function @code{buffer-size} was used. Not only was that function called several times, it gave the size of the whole buffer, not the accessible part. The computation makes much more sense when it handles just the accessible part. (@xref{Narrowing & Widening, , Narrowing and Widening}, for more information on focusing attention to an `accessible' part.)
es: Hace tiempo, se usaba la funci@'on @code{buffer-size}. No solo esta funci@'on era llamada varias veces, eso daba el tama@~no del b@'uffer completo, no la parte accesible. La computaci@'on tiene mucho m@'as sentido cuando se maneja solo la parte accesible. (@xref{Encogiendo y extendiendo, , Encogiendo y extendiendo}, para m@'as informaci@'on en focalizar la atenci@'on para una parte `accesible'.)

source: The line looks like this:
es: La l@'{@dotless{i}}nea se parece a esto:

source: When the buffer is large, the then-part of the @code{if} expression is evaluated. It reads like this (after formatting for easy reading):
es: Cuando el b@'uffer es largo, el then-part de la expresi@'on @code{if} se eval@'ua. Eso se lee as@'{@dotless{i}} (despu@'es de ser formateado para una f@'acil lectura):

source: This expression is a multiplication, with two arguments to the function @code{*}.
es: Esta expresi@'on es una multiplicaci@'on, con dos argumentos para la funci@'on @code{*}.

source: The first argument is @code{(prefix-numeric-value arg)}. When @code{"P"} is used as the argument for @code{interactive}, the value passed to the function as its argument is passed a ``raw prefix argument'', and not a number. (It is a number in a list.) To perform the arithmetic, a conversion is necessary, and @code{prefix-numeric-value} does the job.
es: El primer argumento es @code{(prefix-numeric-value arg)}. Cuando @code{"P"} se usa como argumento para @code{interactive}, el valor pasado para la funci@'on como argumento es un ``argumento prefijo crudo'', y no un n@'umero. (Es un n@'umero en una lista). Para desarrollar la aritm@'etica, una conversi@'on es necesaria, y @code{prefix-numeric-value} hace el trabajo.

source: The second argument is @code{(/ size 10)}. This expression divides the numeric value by ten---the numeric value of the size of the accessible portion of the buffer. This produces a number that tells how many characters make up one tenth of the buffer size. (In Lisp, @code{/} is used for division, just as @code{*} is used for multiplication.)
es: El segundo argumento es @code{(/ size 10)}. Esta expresi@'on divide el valor num@'erico por diez --- el valor num@'erico del tama@~no de la porci@'on accesible del b@'uffer. Esto produce un n@'umero que cuenta cu@'antos caracteres crean una decena del tama@~no del b@'uffer. (En Lisp, @code{/} es usado para divisi@'on, solo como @code{*} es usado para multiplicaci@'on.)

source: In the multiplication expression as a whole, this amount is multiplied by the value of the prefix argument---the multiplication looks like this:
es: En la expresi@'on de la multiplicaci@'on como un todo, esta cantidad se multiplica por el valor del argumento prefijo --- la multiplicaci@'on se parece a:

source: If, for example, the prefix argument is @samp{7}, the one-tenth value will be multiplied by 7 to give a position 70% of the way through.
es: Si, por ejemplo, el argumento prefijo es @samp{7}, el valor one-tenth ser@'a multiplicado por 7 para dar una posici@'on del 70% del camino.

source: The result of all this is that if the accessible portion of the buffer is large, the @code{goto-char} expression reads like this:
es: El resultado de todo esto es que si la porci@'on accesible del b@'uffer es largo, la expresi@'on @code{goto-char} se lee esto:

source: This puts the cursor where we want it.
es: Esto pone el cursor donde se quiere.

source: What happens in a small buffer
es: Qu@'e ocurre en un b@'uffer peque@~no

source: If the buffer contains fewer than 10,000 characters, a slightly different computation is performed. You might think this is not necessary, since the first computation could do the job. However, in a small buffer, the first method may not put the cursor on exactly the desired line; the second method does a better job.
es: Si el b@'uffer contiene poco m@'as de 10000 caracteres, una computaci@'on ligeramente diferente es medida. Se podr@'{@dotless{i}}a pensar que esto no es necesario, desde que la primera computaci@'on podr@'{@dotless{i}}a hacer el trabajo. Sin embargo, en un b@'uffer peque@~no, el primer m@'etodo puede no poner el cursor en la l@'{@dotless{i}}nea exactamente deseada; el segundo m@'etodo hace un trabajo mejor.

source: The code looks like this:
es: El c@'odigo se parece a esto:

source: This is code in which you figure out what happens by discovering how the functions are embedded in parentheses. It is easier to read if you reformat it with each expression indented more deeply than its enclosing expression:
es: Este es el c@'odigo en el que se ve qu@'e ocurre descubriendo como las funciones se embeben entre par@'entesis. Eso es f@'acil de leer si se reformatea con cada expresi@'on indentada m@'as profundamente que la expresi@'on que encierra:

source: Looking at parentheses, we see that the innermost operation is @code{(prefix-numeric-value arg)}, which converts the raw argument to a number. In the following expression, this number is multiplied by the size of the accessible portion of the buffer:
es: Mirando los par@'entesis, se ve que la operaci@'on propia es @code{(prefix-numeric-value arg)}, que convierte el argumento plano para un n@'umero. En la siguiente expresi@'on, este n@'umero es multiplicado por el tama@~no de la porci@'on accesible del b@'uffer:

source: This multiplication creates a number that may be larger than the size of the buffer---seven times larger if the argument is 7, for example. Ten is then added to this number and finally the large number is divided by ten to provide a value that is one character larger than the percentage position in the buffer.
es: Esta multiplicaci@'on crea un n@'umero que puede ser m@'as largo que el tama@~no del buffer --- siete veces m@'as larga si el argumento es 7, por ejemplo. Diez se a@~anade a @'este n@~umero y finalmente el n@'umero es dividido por 10 para proporcionar un valor que es un car@'acter m@'as largo que la posici@'on de porcentaje en el b@'uffer.

source: The number that results from all this is passed to @code{goto-char} and the cursor is moved to that point.
es: El n@'umero que resulta de todo esto se pasa a @code{goto-char} y el cursor se mueve a este punto.

source: The Complete @code{beginning-of-buffer}
es: El @code{beginning-of-buffer} completo

source: Here is the complete text of the @code{beginning-of-buffer} function:
es: Aqu@'{@dotless{i}} est@'a el texto completo de la funci@'on @code{beginning-of-buffer}:

source: (defun beginning-of-buffer (&optional arg) "Move point to the beginning of the buffer; leave mark at previous position. With \\[universal-argument] prefix, do not set mark at previous position. With numeric arg N, put point N/10 of the way from the beginning.
es: (defun beginning-of-buffer (&optional arg) "Mueve el punto al principio del buffer; deja marca en la posici@'on previa. Con prefijo \\[universal-argument], no se asigna una marca en la posici@'on previa. Con el argumento num@'erico N, pon el punto N/10 del camino desde el principio.

source: If the buffer is narrowed, this command uses the beginning and size of the accessible part of the buffer.
es: Si el b@'uffer est@'a encogido este comando usa el principio y tama@~no de la parte accesible del b@'uffer.

source: Don't use this command in Lisp programs! \(goto-char (point-min)) is faster and avoids clobbering the mark." (interactive "P") (or (consp arg) (and transient-mark-mode mark-active) (push-mark))
es: @exclamdown{}No use este comando en programas Lisp! \(goto-char (point-min)) es r@'apido y evita poseer la marca." (interactive "P") (or (consp arg) (and transient-mark-mode mark-active) (push-mark))

source: (let ((size (- (point-max) (point-min)))) (goto-char (if (and arg (not (consp arg))) (+ (point-min) (if (> size 10000) ;; Avoid overflow for large buffer sizes! (* (prefix-numeric-value arg) (/ size 10)) (/ (+ 10 (* size (prefix-numeric-value arg))) 10))) (point-min)))) (if arg (forward-line 1)))
es: (let ((size (- (point-max) (point-min)))) (goto-char (if (and arg (not (consp arg))) (+ (point-min) (if (> size 10000) ;; @exclamdown{}Evita sobrecarga para grandes tama@~nos de b@'uffer! (* (prefix-numeric-value arg) (/ size 10)) (/ (+ 10 (* size (prefix-numeric-value arg))) 10))) (point-min)))) (if arg (forward-line 1)))

source: (defun beginning-of-buffer (&optional arg) "Move point to the beginning of the buffer; leave mark at previous position. With arg N, put point N/10 of the way from the true beginning.
es: (defun beginning-of-buffer (&optional arg) "Mueve el punto al principio del buffer; deja la marca a la posici@'on previa. Con el arg N, pon el punto N/10 del camino desde el comienzo real.

source: Don't use this in Lisp programs! \(goto-char (point-min)) is faster and does not set the mark." (interactive "P") (push-mark)
es: @exclamdown{}No usar esto en programas Lisp! \(goto-char (point-min)) es r@'apido y no asigna la marca." (interactive "P") (push-mark)

source: (goto-char (if arg (if (> (buffer-size) 10000) ;; @r{Avoid overflow for large buffer sizes!} (* (prefix-numeric-value arg) (/ (buffer-size) 10))
es: (goto-char (if arg (if (> (buffer-size) 10000) ;; @r{@exclamdown{}Evita overflow para tama@~nos de b@'uffer grandes!} (* (prefix-numeric-value arg) (/ (buffer-size) 10))

source: Except for two small points, the previous discussion shows how this function works. The first point deals with a detail in the documentation string, and the second point concerns the last line of the function.
es: Excepto por dos peque@~nos puntos, la discusi@'on previa muestra c@'omo esta funci@'on trabaja. El primer punto trata un detalle en la cadena de documentaci@'on, y el segundo concierne la @'ultima l@'{@dotless{i}}nea de la funci@'on.

source: In the documentation string, there is reference to an expression:
es: En la cadena de documentaci@'on, hay referencia a una expresi@'on:
