Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The next line is @code{(goto-char (point-min))}. This expression jumps the cursor to the minimum point in the buffer, that is, to the beginning of the buffer (or to the beginning of the accessible portion of the buffer if it is narrowed. @xref{Narrowing & Widening, , Narrowing and Widening}.)
es: La siguiente l@'{@dotless{i}}nea es @code{(goto-char (point-min))}. Esta expresi@'on salta el cursor al punto m@'{@dotless{i}}nimo en el b@'uffer, esto es, para el comienzo del b@'uffer (o al principio de la porci@'on accesible del b@'uffer si eso est@'a encogido. @xref{Encogiendo y extendiendo, , Encogiendo y extendiendo}.)

source: The @code{push-mark} command sets a mark at the place where the cursor was located before it was moved to the beginning of the buffer by the @code{(goto-char (point-min))} expression. Consequently, you can, if you wish, go back to where you were originally by typing @kbd{C-x C-x}.
es: El comando @code{push-mark} estable una marca en el lugar donde el cursor fu@'e localizado antes que fuera movido al principio del b@'uffer por la expresi@'on @code{(goto-char (point-min))}. Consiguientemente, puedes, si lo deseas, volver donde estabas originalmente escribiendo @kbd{C-x C-x}.

source: That is all there is to the function definition!
es: @exclamdown{}Esto es todo lo que hay para la definici@'on de funci@'on!

source: When you are reading code such as this and come upon an unfamiliar function, such as @code{goto-char}, you can find out what it does by using the @code{describe-function} command. To use this command, type @kbd{C-h f} and then type in the name of the function and press @key{RET}. The @code{describe-function} command will print the function's documentation string in a @file{*Help*} window. For example, the documentation for @code{goto-char} is:
es: Cuando se lee c@'odigo como este y vuelve a una funci@'on no familiar, tal como @code{goto-char}, se puede encontrar que se hace usando el comando @code{describe-function}. Para usar este comando, escribe @kbd{C-h f} y entonces escribe en el nombre de la funci@'on y presiona @key{RET}. El comando @code{describe-function} imprimir@'a la documentaci@'n de la cadena de la funci@'on en una ventana @file{*Help*}. Por ejemplo, la documentaci@'on para @code{goto-char} es:

source: Set point to POSITION, a number or marker. Beginning of buffer is position (point-min), end is (point-max).
es: Asignar punto a POSITION, un n@'umero o marca Empezando el buffer es la posici@'on (point-min), y el final es (point-max).

source: The function's one argument is the desired position.
es: La funci@'on es un argumento es la posici@'on deseada.

source: (The prompt for @code{describe-function} will offer you the symbol under or preceding the cursor, so you can save typing by positioning the cursor right over or after the function and then typing @kbd{C-h f @key{RET}}.)
es: (La consola para @code{describe-function} te ofrecer@'a el s@'{@dotless{i}}mbolo abajo o precediendo al cursor, as@'{@dotless{i}} se puede guardar escribiendo al posicionar el cursor a la derecha o despu@'es de la funci@'on y entonces escribir @kbd{C-h f @key{RET}}.)

source: The @code{end-of-buffer} function definition is written in the same way as the @code{beginning-of-buffer} definition except that the body of the function contains the expression @code{(goto-char (point-max))} in place of @code{(goto-char (point-min))}.
es: La definici@'on de funci@'on @code{end-of-buffer} est@'a escrito en el mismo modo que la definici@'on @code{beginnig-of-buffer} excepto que el cuerpo de la funci@'on contenga la expresi@'on @code{(goto-char (point-max))} en lugar de @code{(goto-char (point-min))}

source: The @code{mark-whole-buffer} function is no harder to understand than the @code{simplified-beginning-of-buffer} function. In this case, however, we will look at the complete function, not a shortened version.
es: La funci@'on @code{mark-whole-buffer} no es tan dif@'{@dotless{i}}cil de comprender que la funci@'on @code{simplified-beginning-of-buffer}. En este caso, sin embargo, se ver@'a la funci@'on completa, no una versi@'on ordenada.

source: The @code{mark-whole-buffer} function is not as commonly used as the @code{beginning-of-buffer} function, but is useful nonetheless: it marks a whole buffer as a region by putting point at the beginning and a mark at the end of the buffer. It is generally bound to @kbd{C-x h}.
es: La funci@'on @code{mark-whole-buffer} no est@'a com@'unmente usada como la funci@'on @code{beginning-of-buffer}, pero eso no es @'util: eso marca un b@'uffer completo como una regi@'on poniendo el punto al principio y una marca al fin del b@'uffer. Eso est@'a generalmente asociado a @kbd{C-x h}.

source: mark-whole-buffer overview
es: resumen de mark-whole-buffer

source: An overview of @code{mark-whole-buffer}
es: Un resumen de @code{mark-whole-buffer}

source: In GNU Emacs 22, the code for the complete function looks like this:
es: En GNU Emacs 22, el c@'odigo para la funci@'on completa se parece a:

source: (defun mark-whole-buffer () "Put point at beginning and mark at end of buffer. You probably should not use this function in Lisp programs; it is usually a mistake for a Lisp function to use any subroutine that uses or sets the mark." (interactive) (push-mark (point)) (push-mark (point-max) nil t) (goto-char (point-min)))
es: (defun mark-whole-buffer () "Pon el punto al principio y marca el fin del b@'uffer. Probablemante no deber@'{@dotless{i}}as usar esta funci@'on en programas Lisp; normalmente un error para una funci@'on Lisp usa cualquier subrrutina que usa o asigna la marca." (interactive) (push-mark (point)) (push-mark (point-max) nil t) (goto-char (point-min)))

source: Like all other functions, the @code{mark-whole-buffer} function fits into the template for a function definition. The template looks like this:
es: Como todas las otras funciones, la funci@'on @code{mark-whole-buffer} se ajusta dentro de la plantilla para una definici@'on. La plantilla se parece a esta:

source: Here is how the function works: the name of the function is @code{mark-whole-buffer}; it is followed by an empty argument list, @samp{()}, which means that the function does not require arguments. The documentation comes next.
es: Aqu@'{@dotless{i}} est@'a c@'omo la funci@'on trabaja: el nombre de la funci@'on es @code{mark-whole-buffer}; eso es seguida por un argumento de lista vac@'{@dotless{i}}a, @samp{()}, que significa que la funci@'on no requiere argumentos. La documentaci@'on viene la siguiente.

source: The next line is an @code{(interactive)} expression that tells Emacs that the function will be used interactively. These details are similar to the @code{simplified-beginning-of-buffer} function described in the previous section.
es: La siguiente l@'{@dotless{i}}nea es una expresi@'on @code{(interactive)} que cuenta a Emacs que la funci@'on ser@'a usada interactivamente. Estos detalles son similares a la funci@'on @code{simplified-beginning-of-buffer} descrita en la secci@'on previa

source: Body of @code{mark-whole-buffer}
es: Cuerpo de @code{mark-whole-buffer}

source: The body of the @code{mark-whole-buffer} function consists of three lines of code:
es: El cuerpo de la funci@'on @code{mark-whole-buffer} consiste en tres l@'{@dotless{i}}neas de c@'odigo:

source: The first of these lines is the expression, @code{(push-mark (point))}.
es: El primero de estas l@'{@dotless{i}}neas es la expresi@'on, @code{(push-mark (point))}.

source: This line does exactly the same job as the first line of the body of the @code{simplified-beginning-of-buffer} function, which is written @code{(push-mark)}. In both cases, the Lisp interpreter sets a mark at the current position of the cursor.
es: Esta l@'{@dotless{i}}nea hace exactamente el mismo trabajo que la primera l@'{@dotless{i}}nea del cuerpo de la funci@'on @code{simplified-beginning-of-buffer}, que est@'a escrita @code{(push-mark)}. En ambos casos, el int@'erprete Lisp asigna una marca en la posici@'on actual del cursor.

source: I don't know why the expression in @code{mark-whole-buffer} is written @code{(push-mark (point))} and the expression in @code{beginning-of-buffer} is written @code{(push-mark)}. Perhaps whoever wrote the code did not know that the arguments for @code{push-mark} are optional and that if @code{push-mark} is not passed an argument, the function automatically sets mark at the location of point by default. Or perhaps the expression was written so as to parallel the structure of the next line. In any case, the line causes Emacs to determine the position of point and set a mark there.
es: No s@'e por qu@'e en la expresi@'on @code{mark-whole-buffer} est@'a escrito @code{(push-mark (point))} y en la expresi@'on @code{beginning-of-buffer} est@'a escrito @code{(push-mark)}. Quiz@'as quien escribi@'o el c@'odigo no sab@'{@dotless{i}}a que los argumentos para @code{push-mark} son opcionales y que si @code{push-mark} no se pasa como argumento, la funci@'on autom@'aticamente asigna la marca en la localizaci@'on del punto por defecto. O quiz@'as la expresi@'on fu@'e escrita as@'{@dotless{i}} como para parelizar la estructura de la siguiente l@'{@dotless{i}}nea. En cualquier caso, la l@'{@dotless{i}}nea causa que Emacs determine la posici@'on del punto y asigne una marca all@'{@dotless{i}}.

source: In earlier versions of GNU Emacs, the next line of @code{mark-whole-buffer} was @code{(push-mark (point-max))}. This expression sets a mark at the point in the buffer that has the highest number. This will be the end of the buffer (or, if the buffer is narrowed, the end of the accessible portion of the buffer. @xref{Narrowing & Widening, , Narrowing and Widening}, for more about narrowing.) After this mark has been set, the previous mark, the one set at point, is no longer set, but Emacs remembers its position, just as all other recent marks are always remembered. This means that you can, if you wish, go back to that position by typing @kbd{C-u C-@key{SPC}} twice.
es: En las primeras versiones de GNU Emacs, la siguiente l@'{@dotless{i}}nea de @code{mark-whole-buffer} fu@'e @code{(push-mark (point-max))}. Esta expresi@'on asigna una marca en el punto en el b@'uffer que tiene el n@'umero m@'as alto. Esto ser@'a el fin del b@'uffer (o, si el b@'uffer es encogida, el fin de la porci@'on accesible del b@'uffer. @xref{Encogiendo y extendiendo, , Encogiendo y extendiendo}, para m@'as acerca de encoger). Despu@'es esta marca ha sido asignada, la marca previa, uno asigna un punto, pero no se asigna largo, pero Emacs recuerda su posici@'on, solo como todas las otras marcas recientes son siempre recordadas. Esto significa que se puede, si lo deseas, vuelve a esta posici@'on escribiendo @kbd{C-u C-@key{SPC}} dos veces.

source: In GNU Emacs 22, the @code{(point-max)} is slightly more complicated. The line reads
es: En GNU Emacs 22, el @code{(point-max)} es ligeramente m@'as complicado. La l@'{@dotless{i}}nea lee

source: The expression works nearly the same as before. It sets a mark at the highest numbered place in the buffer that it can. However, in this version, @code{push-mark} has two additional arguments. The second argument to @code{push-mark} is @code{nil}. This tells the function it @emph{should} display a message that says `Mark set' when it pushes the mark. The third argument is @code{t}. This tells @code{push-mark} to activate the mark when Transient Mark mode is turned on. Transient Mark mode highlights the currently active region. It is often turned off.
es: La expresi@'on funciona cerca de lo mismo que antes. Eso asigna una marca en el lugar numerado m@'as alto que se puede en el b@'uffer. Sin embargo, en esta versi@'on, @code{push-mark} tiene dos argumentos adicionales. El segundo argumento para @code{push-mark} es @code{nil}. Esto cuenta la funci@'on que @emph{mostrar@'{@dotless{i}}a} un mensaje que dice `Marca asignada' cuando eso empuja la marca. El tercer argumento es @code{t}. Esto cuenta @code{push-mark} para activar la marca cuando el modo Transient Mark est@'a activado. Transient Mark mode ilumina la regi@'on de marca activa. Con frecuencia desactivada

source: Finally, the last line of the function is @code{(goto-char (point-min)))}. This is written exactly the same way as it is written in @code{beginning-of-buffer}. The expression moves the cursor to the minimum point in the buffer, that is, to the beginning of the buffer (or to the beginning of the accessible portion of the buffer). As a result of this, point is placed at the beginning of the buffer and mark is set at the end of the buffer. The whole buffer is, therefore, the region.
es: Finalmente, la @'ultima l@'{@dotless{i}}nea de la funci@'on es @code{(goto-char (point-min))}. Esto es escrito exactamente el mismo camino camino como est@'a escrito @code{beginning-of-buffer}. La expresi@'on mueve el cursor al m@'{@dotless{i}}nimo punto en el b@'uffer, que es, al principio del b@'ufferr (o para el principio de la porci@'on accesible del b@'uffer). Como un resultado de esto, punto est@'a emplazado al principio del b@'uffer y la marca est@'a asignada al fin del b@'uffer. El b@'uffer completo es, m@'as all@'a, la regi@'on.

source: The @code{append-to-buffer} command is more complex than the @code{mark-whole-buffer} command. What it does is copy the region (that is, the part of the buffer between point and mark) from the current buffer to a specified buffer.
es: El comando @code{append-to-buffer} es m@'as complejo que el comando @code{mark-whole-buffer}. Lo que hace es copiar la regi@'on (que es, la parte del b@'uffer entre punto y marca) desde el buffer actual a un b@'uffer espec@'{@dotless{i}}fico.

source: append-to-buffer overview
es: resumen de append-to-buffer

source: An Overview of @code{append-to-buffer}
es: Un resumen de @code{append-to-buffer}

source: The @code{append-to-buffer} command uses the @code{insert-buffer-substring} function to copy the region. @code{insert-buffer-substring} is described by its name: it takes a string of characters from part of a buffer, a ``substring'', and inserts them into another buffer.
es: El comando @code{append-to-buffer} usa la funci@'on @code{insert-buffer-substring} para copiar la regi@'on. @code{insert-buffer-substring} es descrita por su nombre: eso toma una cadena de caracteres desde parte de un b@'uffer, una ``subcadena'', y las inserta dentro de otro b@'uffer.

source: Most of @code{append-to-buffer} is concerned with setting up the conditions for @code{insert-buffer-substring} to work: the code must specify both the buffer to which the text will go, the window it comes from and goes to, and the region that will be copied.
es: La mayor@'{@dotless{i}}a de @code{append-to-buffer} se refiere con la configuraci@'on de las condiciones para @code{insert-buffer-substring} para trabajar: el c@'odigo debe especificar ambos el b@'uffer para el que el texto ir@'a, la ventana viene y va, y la regi@'on que ser@'a copiada.

source: Here is the complete text of the function:
es: Aqu@'{@dotless{i}} est@'a el texto completo de la funci@'on:

source: (defun append-to-buffer (buffer start end) "Append to specified buffer the text of the region. It is inserted into that buffer before its point.
es: (defun append-to-buffer (buffer start end) "Introduce al b@'uffer espec@'{@dotless{i}}fico el texto de la regi@'on. Esto es insertado de este b@'uffer antes de su punto.

source: When calling from a program, give three arguments: BUFFER (or buffer name), START and END. START and END specify the portion of the current buffer to be copied." (interactive (list (read-buffer "Append to buffer: " (other-buffer (current-buffer) t)) (region-beginning) (region-end)))
es: Cuando se llama desde un programa, se dan tres argumentos: BUFFER (o nombre del b@'uffer), START y END. START y END especifica la porci@'on del b@'uffer actual para ser copiado." (interactive (list (read-buffer "Append to buffer: " (other-buffer (current-buffer) t)) (region-beginning) (region-end)))

source: The function can be understood by looking at it as a series of filled-in templates.
es: La funci@'on puede ser comprendida buscando como series de plantillas rellenas

source: The outermost template is for the function definition. In this function, it looks like this (with several slots filled in):
es: La plantilla de fuera es para la definici@'on de la funci@'on. En esta funci@'on, se ve como esto (con varios slots rellenos):

source: (defun append-to-buffer (buffer start end) "@var{documentation}@dots{}" (interactive @dots{}) @var{body}@dots{})
es: (defun append-to-buffer (buffer start end) "@var{documentacion}@dots{}" (interactive @dots{}) @var{cuerpo}@dots{})

source: The first line of the function includes its name and three arguments. The arguments are the @code{buffer} to which the text will be copied, and the @code{start} and @code{end} of the region in the current buffer that will be copied.
es: La primera l@'{@dotless{i}}nea de la funci@'on incluye su nombre y los tres argumentos. Los argumentos son el @code{b@'uffer} que el texto ser@'a copiado, y el @code{start} y @code{end} de la regi@'on en el buffer actual que ser@'a copiado.

source: The next part of the function is the documentation, which is clear and complete. As is conventional, the three arguments are written in upper case so you will notice them easily. Even better, they are described in the same order as in the argument list.
es: La siguiente parte de la funci@'on es la documentaci@'on, que es claro y completo. Como es convencional, los tres argumentos son escritos en may@'usculas as@'{@dotless{i}} se notificar@'an f@'acilmente. Incluso mejor, son descritas en el mismo orden como en la lista de argumentos.

source: Note that the documentation distinguishes between a buffer and its name. (The function can handle either.)
es: N@'otese que la documentaci@'on distingue entre un b@'uffer y su nombre. (La funci@'on puede manejar otro.)

source: The @code{append-to-buffer} Interactive Expression
es: La expresi@'on interactiva @code{append-to-buffer}

source: Since the @code{append-to-buffer} function will be used interactively, the function must have an @code{interactive} expression. (For a review of @code{interactive}, see @ref{Interactive, , Making a Function Interactive}.) The expression reads as follows:
es: Desde que la funci@'on @code{append-to-buffer} ser@'a usada interactivamente, la funci@'on debe tener una expresi@'on @code{interactive}. (Para una revisi@'on de @code{interactive}, ver @ref{Interactive, , Creando una Funci@'on Interactive}.) La expresi@'on se lee de la siguiente manera:

source: (interactive (list (read-buffer "Append to buffer: " (other-buffer (current-buffer) t)) (region-beginning) (region-end)))
es: (interactive (list (read-buffer "Agrega al buffer: " (other-buffer (current-buffer) t)) (region-beginning) (region-end)))

source: This expression is not one with letters standing for parts, as described earlier. Instead, it starts a list with these parts:
es: Esta expresi@'on no es una con letras separadas por partes, como se describe antes. En vez de eso, empieza una lista con estas partes:

source: The first part of the list is an expression to read the name of a buffer and return it as a string. That is @code{read-buffer}. The function requires a prompt as its first argument, @samp{"Append to buffer: "}. Its second argument tells the command what value to provide if you don't specify anything.
es: La primera parte de la lista es una expresi@'on para leer el nombre de un b@'uffer y lo devuelve como una cadena. Esto es @code{read-buffer}. La funci@'on requiere una consola como su primer argumento, @samp{"Asocia al buffer: "}. Su segundo argumento cuenta el comando que valora para proporciona si no especifica cualquier cosa.

source: In this case that second argument is an expression containing the function @code{other-buffer}, an exception, and a @samp{t}, standing for true.
es: En este caso este segundo argumento es una expresi@'on conteniendo la funci@'on @code{other-buffer}, una excepci@'on, y una @samp{t}, para verdad.

source: The first argument to @code{other-buffer}, the exception, is yet another function, @code{current-buffer}. That is not going to be returned. The second argument is the symbol for true, @code{t}. that tells @code{other-buffer} that it may show visible buffers (except in this case, it will not show the current buffer, which makes sense).
es: El primer argumento para @code{other-buffer}, la excepci@'on, es todav@'{@dotless{i}}a otra funci@'on, @code{other-buffer}. Esto es no yendo a ser devuelto. El segundo argumento es el s@'{@dotless{i}}mbolo para verdad, @code{t}. Esto cuenta @code{other-buffer} que puede mostrar b@'uffers visibles (excepto en este caso, eso no mostrar@'a el b@'uffer actual, que tiene sentido).

source: The expression looks like this:
es: La expresi@'on se ve como:

source: The second and third arguments to the @code{list} expression are @code{(region-beginning)} and @code{(region-end)}. These two functions specify the beginning and end of the text to be appended.
es: El segundo y tercer argumento de la expresi@'on @code{list} son @code{(region-beginning)} y @code{(region-end)}. Estas dos funciones especifican el principio el y el final del texto que se adjunta.

source: Originally, the command used the letters @samp{B} and @samp{r}. The whole @code{interactive} expression looked like this:
es: Originalmente, el comando usaba las letras @samp{B} y @samp{r}. La expresi@'on completa @code{interactive} es as@'{@dotless{i}}:

source: (interactive "BAppend to buffer:@: \nr")
es: (interactive "BAsociar al buffer:@: \nr")

source: But when that was done, the default value of the buffer switched to was invisible. That was not wanted.
es: Pero cuando esto fu@'e hecho, el valor por defecto del b@'uffer cambi@'o a ser invisible. Esto no se quer@'{@dotless{i}}a.

source: (The prompt was separated from the second argument with a newline, @samp{\n}. It was followed by an @samp{r} that told Emacs to bind the two arguments that follow the symbol @code{buffer} in the function's argument list (that is, @code{start} and @code{end}) to the values of point and mark. That argument worked fine.)
es: (La consola estaba separada del segundo argumento con una nueva l@'{@dotless{i}}nea, @samp{\n}. Estaba seguido por un @samp{r} que contaba a Emacs emparejar los dos argumentos que siguen el s@'{@dotless{i}}mbolo @code{buffer} en la lista de argumentos de la funci@'on (que es, @code{start} y @code{end}) para los valores de punto y marca. Este argumento trabaj@'o bien.)

source: The Body of @code{append-to-buffer}
es: El cuerpo de @code{append-to-buffer}

source: The body of the @code{append-to-buffer} function begins with @code{let}.
es: El cuerpo de la funci@'on @code{append-to-buffer} empieza con @code{let}.

source: As we have seen before (@pxref{let, , @code{let}}), the purpose of a @code{let} expression is to create and give initial values to one or more variables that will only be used within the body of the @code{let}. This means that such a variable will not be confused with any variable of the same name outside the @code{let} expression.
es: Como se ha visto antes (@pxref{let, , @code{let}}), el prop@'osito de una expresi@'on @code{let} es crear y dar valores iniciales a una o m@'as variable que solo ser@'an usada con el cuerpo del @code{let}. Esto significa que tal variable no ser@'a confuso con cualquier variable del mismo nombre fuera de la expresi@'on @code{let}.
