Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: A @samp{\\} is used before the first square bracket of this expression. This @samp{\\} tells the Lisp interpreter to substitute whatever key is currently bound to the @samp{[@dots{}]}. In the case of @code{universal-argument}, that is usually @kbd{C-u}, but it might be different. (@xref{Documentation Tips, , Tips for Documentation Strings, elisp, The GNU Emacs Lisp Reference Manual}, for more information.)
es: Un @samp{\\} es usado antes de la primera llave de esta expresi@'on. Este @samp{\\} le cuenta al int@'erprete Lisp sustituir qu@'e clave est@'a actualmente emparejada a los @samp{[@dots{}]}. En el caso de @code{universal-argument}, que es normalmente @kbd{C-u}, pero eso podr@'{@dotless{i}}a ser diferente. (@xref{Consejos de Documentaci@'on, , Consejos para Cadenas de Documentaci@'on, elisp, El Manual de Referencia de GNU Emacs Lisp}, para m@'as informaci@'on.)

source: Finally, the last line of the @code{beginning-of-buffer} command says to move point to the beginning of the next line if the command is invoked with an argument:
es: Finalmente, la @'ultima l@'{@dotless{i}}nea del comando @code{beginning-of-buffer} dice mover el punto al principio de la siguiente l@'{@dotless{i}}nea si el comando es invocado con un argumento:

source: This puts the cursor at the beginning of the first line after the appropriate tenths position in the buffer. This is a flourish that means that the cursor is always located @emph{at least} the requested tenths of the way through the buffer, which is a nicety that is, perhaps, not necessary, but which, if it did not occur, would be sure to draw complaints.
es: Esto pone el cursor al principio de la primera l@'{@dotless{i}}nea despu@'es de las apropiadas decenas de posiciones en el b@'uffer. Esto significa que el cursor est@'a siempre localizado @emph{al menos} las decenas solicitadas del camino a trav@'es del b@'uffer, que es un bien que es, quiz@'as, no necesario, pero que, si no ocurri@'o, estar@'{@dotless{i}}a seguro de dibujar rumores.

source: On the other hand, it also means that if you specify the command with a @kbd{C-u}, but without a number, that is to say, if the `raw prefix argument' is simply a cons cell, then the command puts you at the beginning of the second line @dots{} I don't know whether this is intended or whether no one has dealt with the code to avoid this happening.
es: Por otro lado, eso significa que si se especifica el comando con un @kbd{C-u}, sin un n@'umero, que es decir, si el `prefijo de argumento plano' es simplemente un cons cell, entonces el comando te pone al principio de la segunda l@'{@dotless{i}}nea @dots{} no s@'e si este se pretende ning@'un trato con el c@'odigo para evitar que esto ocurre.

source: Second Buffer Related Review
es: Revisar el segundo b@'uffer relacionado

source: Here is a brief summary of some of the topics covered in this chapter.
es: Aqu@'{@dotless{i}} hay un breve resumen de los asuntos cubierto en este cap@'{@dotless{i}}tulo.

source: Evaluate each argument in sequence, and return the value of the first argument that is not @code{nil}; if none return a value that is not @code{nil}, return @code{nil}. In brief, return the first true value of the arguments; return a true value if one @emph{or} any of the others are true.
es: Eval@'ua cada argumento en secuencia, y devuelve el valor del primer argumento que no es @code{nil}, si ninguno devuelve un valor que no es @code{nil}, devuelve @code{nil}. En breve, devuelve el primer valor de verdad de los argumento; devuelve un valor cierto si un @emph{or} cualquier de los otros son verdad.

source: Evaluate each argument in sequence, and if any are @code{nil}, return @code{nil}; if none are @code{nil}, return the value of the last argument. In brief, return a true value only if all the arguments are true; return a true value if one @emph{and} each of the others is true.
es: Eval@'ua cada argumento en secuencia, y si cualquiera es @code{nil}, devuelve @code{nil}; si ninguno es @code{nil}, devuelve el valor del @'ultimo argumento. En breve, devuelve un valor cierto solo si todos los argumentos cierto; devuelve un valor cierto si un @emph{and} cada uno de los otros son ciertos.

source: A keyword used to indicate that an argument to a function definition is optional; this means that the function can be evaluated without the argument, if desired.
es: Una palabra clave usaba para indicar que un argumento a una definici@'on de funci@'on es opcional; esto significa que la funci@'on puede ser evaluado sin el argumento, si se desea.

source: Convert the `raw prefix argument' produced by @code{(interactive "P")} to a numeric value.
es: Convierte el `argumento prefijo plano' producido por @code{(interactive "P")} a un valor num@'erico.

source: Move point forward to the beginning of the next line, or if the argument is greater than one, forward that many lines. If it can't move as far forward as it is supposed to, @code{forward-line} goes forward as far as it can and then returns a count of the number of additional lines it was supposed to move but couldn't.
es: Mueve el punto hacia delante al principio de la siguiente l@'{@dotless{i}}nea, o si el argumento es m@'as de uno, hacia delante varias l@'{@dotless{i}}neas. Si eso no se puede mover tan lejos hacia delante como se puede, @code{forward-line} va hacia delante tan lejos como se puede y entonces devuelve un contaje del n@'umero de l@'{@dotless{i}}neas adicionales que no pudo moverse.

source: Delete the entire contents of the current buffer.
es: Borra todos los contenidos del b@'uffer actual.

source: Return @code{t} if its argument is a buffer; otherwise return @code{nil}.
es: Devuelve @code{t} si su argumento es un b@'uffer; de otro modo devuelve @code{nil}.

source: @code{optional} Argument Exercise
es: Ejercicio de argumento @code{opcional}

source: Write an interactive function with an optional argument that tests whether its argument, a number, is greater than or equal to, or else, less than the value of @code{fill-column}, and tells you which, in a message. However, if you do not pass an argument to the function, use 56 as a default value.
es: Escribe una funci@'on interactiva con un argumento opcional que chequee si su argumento, un n@'umero, es mayor o igual, o al menos, menos que el valor de @code{fill-column}, y lo escribe, en un mensaje. Sin embargo, si no se pasa un argumento a la funci@'on, usa 56 como un valor por defecto.

source: Focusing attention (narrowing)
es: Focalizando atenci@'on (encogiendo)

source: Narrowing
es: Encogiendo

source: Widening
es: Ampliando

source: Narrowing is a feature of Emacs that makes it possible for you to focus on a specific part of a buffer, and work without accidentally changing other parts. Narrowing is normally disabled since it can confuse novices.
es: Encoger es una funcionalidad de Emacs que hace posible focalizar en una parte espec@'{@dotless{i}}fica de un b@'uffer, y funcionar sin cambiar accidentalmente otras partes. Encoger normalmente se deshabilita puesto que puede confundir a novatos.

source: The Advantages of Narrowing
es: Las ventajas de encoger

source: With narrowing, the rest of a buffer is made invisible, as if it weren't there. This is an advantage if, for example, you want to replace a word in one part of a buffer but not in another: you narrow to the part you want and the replacement is carried out only in that section, not in the rest of the buffer. Searches will only work within a narrowed region, not outside of one, so if you are fixing a part of a document, you can keep yourself from accidentally finding parts you do not need to fix by narrowing just to the region you want. (The key binding for @code{narrow-to-region} is @kbd{C-x n n}.)
es: Con encoger, el resto del b@'uffer se hace invisible, como si no estuviera. Esto es una ventaja si, por ejemplo, se quiere reemplazar una palabra en una parte del b@'uffer pero no otro: se encoge la parte que se quiere y el reemplazo se trae solo en esta secci@'on, no en el resto del b@'uffer. Las b@'usquedas solo funcionar@'an con una regi@'on encogida, no fuera de una, as@'{@dotless{i}} si tu est@'as arreglando una parte de un documento, se puede guardar en s@'{@dotless{i}} desde encontrar partes accidentalmente que no necesitas arreglar encongiendo solo la regi@'on que quieres. (La tecla asociada a @code{narrow-to-region} es @kbd{C-x n n}.)

source: However, narrowing does make the rest of the buffer invisible, which can scare people who inadvertently invoke narrowing and think they have deleted a part of their file. Moreover, the @code{undo} command (which is usually bound to @kbd{C-x u}) does not turn off narrowing (nor should it), so people can become quite desperate if they do not know that they can return the rest of a buffer to visibility with the @code{widen} command. (The key binding for @code{widen} is @kbd{C-x n w}.)
es: Sin embargo, encoger hace que el resto del b@'uffer sea invisible, esto puede asustar a gente quien inadvertidamente invoca a encoger y pensar que se ha borrado una parte de su fichero. M@'as all@'a, el comando @code{undo} (que es normalmente emparejado a @kbd{C-x u}) no se deja encoger, as@'{@dotless{i}} las personas pueden llegar a estar bastante desesperadas si no conocen que ellas pueden volver al resto de un b@'uffer para visibilizarlo con el comando @code{widen}. (El emparejamiento de la tecla para @code{widen} es @kbd{C-x n w}.)

source: Narrowing is just as useful to the Lisp interpreter as to a human. Often, an Emacs Lisp function is designed to work on just part of a buffer; or conversely, an Emacs Lisp function needs to work on all of a buffer that has been narrowed. The @code{what-line} function, for example, removes the narrowing from a buffer, if it has any narrowing and when it has finished its job, restores the narrowing to what it was. On the other hand, the @code{count-lines} function uses narrowing to restrict itself to just that portion of the buffer in which it is interested and then restores the previous situation.
es: Encoger es tan @'util al int@'erprete Lisp como para las personas. Con frecuencia, una funci@'on Emacs Lisp est@'a dise@~nada para trabajar en solo parte de un b@'uffer; o de manera conversa, una funci@'on Emacs Lisp necesita trabajar en todo un b@'uffer que ha sido encogido. La funci@'on @code{what-line}, por ejemplo, borra el encogimiento desde un b@'uffer, si eso tiene cualquier encogimiento y cuando eso ha finalizado su trabajo, restaura el encogimiento que haya. Por otro lado, la funci@'on @code{count-lines}, que es llamada por @code{what-line}, usa el encogimiento para restringirse a s@'{@dotless{i}} misma solo a la porci@'on del b@'uffer en el que se est@'a interesado y entonces restaura la situaci@'on previa.

source: The @code{save-restriction} Special Form
es: La forma especial @code{save-restriction}

source: In Emacs Lisp, you can use the @code{save-restriction} special form to keep track of whatever narrowing is in effect, if any. When the Lisp interpreter meets with @code{save-restriction}, it executes the code in the body of the @code{save-restriction} expression, and then undoes any changes to narrowing that the code caused. If, for example, the buffer is narrowed and the code that follows @code{save-restriction} gets rid of the narrowing, @code{save-restriction} returns the buffer to its narrowed region afterwards. In the @code{what-line} command, any narrowing the buffer may have is undone by the @code{widen} command that immediately follows the @code{save-restriction} command. Any original narrowing is restored just before the completion of the function.
es: En Emacs Lisp, se puede usar la forma especial @code{save-restriction} para guardar la traza siempre que el encogimiento est@'e en efecto. Cuando el int@'erprete Lisp se encuentra con @code{save-restriction}, eso ejecuta el c@'odigo en el cuerpo de la expresi@'on @code{save-restriction}, y entonces deshace cualquier cambio para encoger lo que el c@'odigo caus@'o. Si, por ejemplo, el b@'uffer est@'a encogido y el c@'odigo que sigue al comando @code{save-restriction} devuelve el b@'uffer para su regi@'on encogida. En el comando @code{what-line}, cualquier encogimiento del b@'uffer que se puede tener se deshace por el comando @code{widen} que inmediatamente sigue el comando @code{save-restriction}. Cualquier encogimiento original es restaurado solo antes de la compleci@'on de la funci@'on.

source: The template for a @code{save-restriction} expression is simple:
es: La plantilla para una expresi@'on @code{save-restriction} es simple:

source: The body of the @code{save-restriction} is one or more expressions that will be evaluated in sequence by the Lisp interpreter.
es: El cuerpo del @code{save-restriction} es una o m@'as expresiones que ser@'an evaluadas en secuencia por el int@'erprete Lisp.

source: Finally, a point to note: when you use both @code{save-excursion} and @code{save-restriction}, one right after the other, you should use @code{save-excursion} outermost. If you write them in reverse order, you may fail to record narrowing in the buffer to which Emacs switches after calling @code{save-excursion}. Thus, when written together, @code{save-excursion} and @code{save-restriction} should be written like this:
es: Finalmente, un punto a anotar: cuando se usa tanto @code{save-excursion} y @code{save-restriction}, uno correcto despu@'es del otro, deber@'{@dotless{i}}as usar @code{save-excursion} fuera. Si se escribe en el orden inverso, se podr@'{@dotless{i}}a fallar para grabar el encogimiento en el b@'uffer para el que Emacs cambia despu@'es de llamar a @code{save-excursion}. De este modo, cuando se escribe junto a @code{save-excursion} y @code{save-restriction} ser@'{@dotless{i}}a escrito as@'{@dotless{i}}:

source: In other circumstances, when not written together, the @code{save-excursion} and @code{save-restriction} special forms must be written in the order appropriate to the function.
es: En otras circunstancias, cuando no se escribe junto, las formas especiales @code{save-excursion} y @code{save-restriction} deben ser escritas en el orden apropiado para la funci@'on.

source: Widening, example of
es: Extendiendo, ejemplo de

source: The @code{what-line} command tells you the number of the line in which the cursor is located. The function illustrates the use of the @code{save-restriction} and @code{save-excursion} commands. Here is the original text of the function:
es: El comando @code{what-line} cuenta el n@'umero de la l@'{@dotless{i}}nea en la que el cursor se ha localizado. La funci@'on ilustra el uso de los comandos @code{save-restriction} y @code{save-excursion}. Aqu@'{@dotless{i}} est@'a el texto original de la funci@'on:

source: (defun what-line () "Print the current line number (in the buffer) of point." (interactive) (save-restriction (widen) (save-excursion (beginning-of-line) (message "Line %d" (1+ (count-lines 1 (point)))))))
es: (defun what-line () "Imprime el n@'umero de l@'{@dotless{i}}nea actual (en el b@'uffer) del punto." (interactive) (save-restriction (widen) (save-excursion (beginning-of-line) (message "L@'{@dotless{i}}nea %d" (1+ (count-lines 1 (point)))))))

source: (In recent versions of GNU Emacs, the @code{what-line} function has been expanded to tell you your line number in a narrowed buffer as well as your line number in a widened buffer. The recent version is more complex than the version shown here. If you feel adventurous, you might want to look at it after figuring out how this version works. You will probably need to use @kbd{C-h f} (@code{describe-function}). The newer version uses a conditional to determine whether the buffer has been narrowed.
es: (En versiones recientes de GNU Emacs, la funci@'on @code{what-line} se ha expandido para contar el n@'umero de l@'{@dotless{i}}neas en un b@'uffer encogido tan bien como el n@'umero de l@'{@dotless{i}}neas en un b@'uffer ampliado. La versi@'on reciente es m@'as compleja que la versi@'on que se muestra. Alguien sinti@'endose venturoso, podr@'{@dotless{i}}a querer mirarla despu@'es de entender como esta versi@'on funciona. Probablemente se necesitar@'a usar @kbd{C-h f} (@code{describe-function}). La versi@'on nueva usa un condicional para determinar si el b@'uffer se ha encogido.

source: (Also, it uses @code{line-number-at-pos}, which among other simple expressions, such as @code{(goto-char (point-min))}, moves point to the beginning of the current line with @code{(forward-line 0)} rather than @code{beginning-of-line}.)
es: (Tambi@'en, eso usa @code{line-number-at-pos}, que otras expresiones simples, tales como @code{(goto-char (point-min))}, mueve el punto al principio de la l@'{@dotless{i}}nea actual con @code{(forward-line 0)} en vez de @code{beginning-of-line}.)

source: The @code{what-line} function as shown here has a documentation line and is interactive, as you would expect. The next two lines use the functions @code{save-restriction} and @code{widen}.
es: La funci@'on @code{what-line} como se muestra aqu@'{@dotless{i}} tiene una l@'{@dotless{i}}nea de documentaci@'on y es interactiva, como se esperar@'{@dotless{i}}a. Las dos l@'{@dotless{i}}neas siguientes usan las funciones @code{save-restriction} y @code{widen}.

source: The @code{save-restriction} special form notes whatever narrowing is in effect, if any, in the current buffer and restores that narrowing after the code in the body of the @code{save-restriction} has been evaluated.
es: La forma especial @code{save-restriction} nota que encogiendo es en efecto, si cualquiera, en el buffer actual y restaura que encogiendo despu@'es del c@'odigo en el cuerpo del @code{save-restriction} ha sido evaluada.

source: The @code{save-restriction} special form is followed by @code{widen}. This function undoes any narrowing the current buffer may have had when @code{what-line} was called. (The narrowing that was there is the narrowing that @code{save-restriction} remembers.) This widening makes it possible for the line counting commands to count from the beginning of the buffer. Otherwise, they would have been limited to counting within the accessible region. Any original narrowing is restored just before the completion of the function by the @code{save-restriction} special form.
es: La forma especial @code{save-restriction} es seguida por @code{widen}. Esta funci@'on deshace cualquier distancia del actual b@'uffer que puede haber tenido cuando @code{what-line} se llame. (La distancia que hab@'{@dotless{i}}a es la distancia que @code{save-restriction} recuerda.) Esta ampliaci@'on se hace posible para la l@'{@dotless{i}}nea contando comandos a contar desde el principio del b@'uffer. De otro modo, se habr@'{@dotless{i}}a limitado para contar con la regi@'on accesible. Cualquier distancia original se restaura solo antes de la compleci@'on de la funci@'on por la forma especial @code{save-restriction}.

source: The call to @code{widen} is followed by @code{save-excursion}, which saves the location of the cursor (i.e., of point) and of the mark, and restores them after the code in the body of the @code{save-excursion} uses the @code{beginning-of-line} function to move point.
es: La llamada a @code{widen} es seguida por @code{save-excursion}, que guarda la posici@'on del cursor (por ej., el punto) y de la marca, y la restaura despu@'es el c@'odigo en el cuerpo del @code{save-excursion} usa la funci@'on @code{beginning-of-line} para mover el punto.

source: (Note that the @code{(widen)} expression comes between the @code{save-restriction} and @code{save-excursion} special forms. When you write the two @code{save- @dots{}} expressions in sequence, write @code{save-excursion} outermost.)
es: (N@'otese que la expresi@'on @code{(widen)} viene entre las formas especiales @code{save-restriction} y @code{save-excursion}. Cuando se escribe las dos expresiones @code{save- @dots{}} en secuencia, escribe @code{save-excursion} finalmente.)

source: The last two lines of the @code{what-line} function are functions to count the number of lines in the buffer and then print the number in the echo area.
es: Las @'ultimas dos l@'{@dotless{i}}neas de la funci@'on @code{what-line} son funciones para contar el n@'umero de l@'{@dotless{i}}neas en el b@'uffer y entonces imprimir el n@'umero en el @'area echo.

source: The @code{message} function prints a one-line message at the bottom of the Emacs screen. The first argument is inside of quotation marks and is printed as a string of characters. However, it may contain a @samp{%d} expression to print a following argument. @samp{%d} prints the argument as a decimal, so the message will say something such as @samp{Line 243}.
es: La funci@'on @code{message} imprime un mensaje de una l@'{@dotless{i}}nea abajo de la pantalla Emacs. El primer argumento est@'a dentro de marcas de cita y est@'a impreso como una cadena de caracteres. Sin embargo, se puede contener una expresi@'on @samp{%d} para imprimir un argumento siguiente. @samp{%d} imprime el argumento como un decimal, as@'{@dotless{i}} el mensaje dir@'a alguna cosa tal como @samp{L@'{@dotless{i}}nea 243}.

source: The number that is printed in place of the @samp{%d} is computed by the last line of the function:
es: El n@'umero que est@'a impreso en lugar de @samp{%d} est@'a computada por la @'ultima l@'{@dotless{i}}nea de la funci@'on:

source: What this does is count the lines from the first position of the buffer, indicated by the @code{1}, up to @code{(point)}, and then add one to that number. (The @code{1+} function adds one to its argument.) We add one to it because line 2 has only one line before it, and @code{count-lines} counts only the lines @emph{before} the current line.
es: Lo que esto hace es contar las l@'{@dotless{i}}neas entre la primera posici@'on del b@'uffer indicada por el @code{1}, y el @code{(point)}, y entonces se a@~nade uno a este n@'umero. (La funci@'on @code{1+} a@~nade uno a su argumento.) Se a@~nade a eso porque la l@'{@dotless{i}}nea 2 tiene solo una l@'{@dotless{i}}nea antes, y @code{count-lines} cuenta solo las l@'{@dotless{i}}neas @emph{antes} de la l@'{@dotless{i}}nea actual.

source: After @code{count-lines} has done its job, and the message has been printed in the echo area, the @code{save-excursion} restores point and mark to their original positions; and @code{save-restriction} restores the original narrowing, if any.
es: Despu@'es de que @code{count-lines} ha hecho su trabajo, y el mensaje ha sido impreso en el @'area echo, la funci@'on @code{save-excursion} restaura punto y marca a sus posiciones originales; y @code{save-restriction} restaura la contracci@'on original, si la hay.

source: Exercise with Narrowing
es: Ejercicio de encoger

source: Write a function that will display the first 60 characters of the current buffer, even if you have narrowed the buffer to its latter half so that the first line is inaccessible. Restore point, mark, and narrowing. For this exercise, you need to use a whole potpourri of functions, including @code{save-restriction}, @code{widen}, @code{goto-char}, @code{point-min}, @code{message}, and @code{buffer-substring}.
es: Escribe una funci@'on que mostrar@'a los primeros 60 caracteres del b@'uffer actual, incluso si se ha encogido el b@'uffer a su mitad as@'{@dotless{i}} que la primera l@'{@dotless{i}}nea es inaccesible. Restaura punto, marca y encogimiento. Para este ejercicio, se necesita usa un popurri entero de funciones, incluyendo @code{save-restriction}, @code{widen}, @code{goto-char}, @code{point-min}, @code{message}, y @code{buffer-substring}.

source: Properties, mention of @code{buffer-substring-no-properties}
es: Propiedades, menci@'on de @code{buffer-substring-no-properties}
