Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: When this command inserts killed text into the buffer, it honors `yank-excluded-properties' and `yank-handler' as described in the doc string for `insert-for-yank-1', which see.
es: Cuando este comando inserta texto cortado dentro del b@'uffer, eso honra a `yank-excluded-properties' y `yank-handler' como se describe la cadena de documentaci@'on para `insert-for-yank-1', que se ve.

source: See also the command \\[yank-pop]."
es: Ver tambi@'en el comando \\[yank-pop]."

source: (interactive "*P") (setq yank-window-start (window-start)) ;; If we don't get all the way thru, make last-command indicate that ;; for the following command. (setq this-command t) (push-mark (point))
es: (interactive "*P") (setq yank-window-start (window-start)) ;; Si no tenemos todo el camino a trav@'es, crea last-command que ;; indique esto para el siguiente comando. (setq this-command t) (push-mark (point))

source: (insert-for-yank (current-kill (cond ((listp arg) 0) ((eq arg '-) -2) (t (1- arg))))) (if (consp arg) ;; This is like exchange-point-and-mark, ;; but doesn't activate the mark. ;; It is cleaner to avoid activation, even though the command ;; loop would deactivate the mark because we inserted text. (goto-char (prog1 (mark t) (set-marker (mark-marker) (point) (current-buffer)))))
es: (insert-for-yank (current-kill (cond ((listp arg) 0) ((eq arg '-) -2) (t (1- arg))))) (if (consp arg) ;; Esto es como like exchange-point-and-mark, ;; pero no activa la marca. ;; Es limpio evitar la activaci@'on, incluso aunque el comando ;; loop would desactivar@'{@dotless{i}}a la marca porque se ;; insertara el texto. (goto-char (prog1 (mark t) (set-marker (mark-marker) (point) (current-buffer)))))

source: ;; If we do get all the way thru, make this-command indicate that. (if (eq this-command t) (setq this-command 'yank)) nil)
es: ;; Si tenemos todo el camino, haz que this-command lo indique. (if (eq this-command t) (setq this-command 'yank)) nil)

source: The key expression is @code{insert-for-yank}, which inserts the string returned by @code{current-kill}, but removes some text properties from it.
es: La expresi@'on clave es @code{insert-for-yank}, que inserta la cadena devuelta por @code{current-kill}, pero elimina algo de propiedades de texto desde eso.

source: However, before getting to that expression, the function sets the value of @code{yank-window-start} to the position returned by the @code{(window-start)} expression, the position at which the display currently starts. The @code{yank} function also sets @code{this-command} and pushes the mark.
es: Sin embargo, antes de tener esta expresi@'on, la funci@'on asigna el valor de @code{yank-window-start} a la posici@'on devuelta por la expresi@'on @code{(window-start)}, la posici@'on que muestra lo que actualmente empieza. La funci@'on @code{yank} tambi@'en asigna @code{this-command} y empuja la marca.

source: After it yanks the appropriate element, if the optional argument is a @sc{cons} rather than a number or nothing, it puts point at beginning of the yanked text and mark at its end.
es: Despu@'es de pegar el elemento apropiado, si el argumento opcional es un @sc{cons} en vez de un n@'umero o nada, se pone el punto al principio del texto pegado y se marca al final.

source: (The @code{prog1} function is like @code{progn} but returns the value of its first argument rather than the value of its last argument. Its first argument is forced to return the buffer's mark as an integer. You can see the documentation for these functions by placing point over them in this buffer and then typing @kbd{C-h f} (@code{describe-function}) followed by a @kbd{RET}; the default is the function.)
es: (La funci@'on @code{prog1} es como @code{progn} pero devuelve el valor de su primer argumento en vez del valor de su @'ultimo argumento. Su primer argumento fuerza devolver la marca del b@'uffer como un entero. Se puede ver la documentaci@'on para estas funciones emplazando el punto a trav@'es de ellas en este b@'uffer y entonces escribiendo @kbd{C-h f} (@code{describe-function}) seguido por un @kbd{RET}; por defecto es la funci@'on.)

source: The last part of the function tells what to do when it succeeds.
es: La @'ultima parte de la funci@'on cuenta que hacer cuando eso sucede.

source: After understanding @code{yank} and @code{current-kill}, you know how to approach the @code{yank-pop} function. Leaving out the documentation to save space, it looks like this:
es: Despu@'es de comprender @code{yank} y @code{current-kill}, se conoce como enfocar la funci@'on @code{yank-pop}. Dejando fuera la documentaci@'on para guardar el espacio, se parece a esto:

source: (defun yank-pop (&optional arg) "@dots{}" (interactive "*p") (if (not (eq last-command 'yank)) (error "Previous command was not a yank"))
es: (defun yank-pop (&optional arg) "@dots{}" (interactive "*p") (if (not (eq last-command 'yank)) (error "El comando previo no fu@'e un corte"))

source: (set-marker (mark-marker) (point) (current-buffer)) (insert-for-yank (current-kill arg)) ;; Set the window start back where it was in the yank command, ;; if possible. (set-window-start (selected-window) yank-window-start t)
es: (set-marker (mark-marker) (point) (current-buffer)) (insert-for-yank (current-kill arg)) ;; Asigna la ventana a volver donde estaba el comando yank, ;; si es posible (set-window-start (selected-window) yank-window-start t)

source: (if before ;; This is like exchange-point-and-mark, ;; but doesn't activate the mark. ;; It is cleaner to avoid activation, even though the command ;; loop would deactivate the mark because we inserted text. (goto-char (prog1 (mark t) (set-marker (mark-marker) (point) (current-buffer)))))) nil)
es: (if before ;; Esto es como exchange-point-and-mark, ;; pero no activa la marca. ;; Es limpio evitar la activaci@'on, incluso aunque el comando ;; desactivase la marca porque se insertara el texto. (goto-char (prog1 (mark t) (set-marker (mark-marker) (point) (current-buffer)))))) nil)

source: The function is interactive with a small @samp{p} so the prefix argument is processed and passed to the function. The command can only be used after a previous yank; otherwise an error message is sent. This check uses the variable @code{last-command} which is set by @code{yank} and is discussed elsewhere. (@xref{copy-region-as-kill}.)
es: La funci@'on es interactive con una peque@~na @samp{p} as@'{@dotless{i}} el argumento prefijo es procesado y pasado a la funci@'on. El comando puede solo ser usado despu@'es del yank previo; de otro modo un mensaje de error se env@'{@dotless{i}}a. Este chequeo usa la variable @code{last-command} que se asigna por @code{yank} y discutida de alg@'un modo. (@xref{copy-region-as-kill}.)

source: The @code{let} clause sets the variable @code{before} to true or false depending whether point is before or after mark and then the region between point and mark is deleted. This is the region that was just inserted by the previous yank and it is this text that will be replaced.
es: La cl@'ausula @code{let} asigna la variable @code{before} a cierto o falso dependiendo de si el punto est@'a antes o despu@'es de la marca y entonce la regi@'on entre punto y marca se borra. Esta es la regi@'on que fu@'e insertada por el yank previo y eso es este texto que ser@'a reemplazado.

source: @code{funcall} calls its first argument as a function, passing remaining arguments to it. The first argument is whatever the @code{or} expression returns. The two remaining arguments are the positions of point and mark set by the preceding @code{yank} command.
es: @code{funcall} llama a su primer argumento como una funci@'on, pasando los argumentos que permanecen. El primer argumento es el que la expresi@'on @code{or} devuelve. Los dos argumentos que permanecen son las posiciones de punto y marca asignadas por el comando @code{yank} precedente.

source: There is more, but that is the hardest part.
es: Hay m@'as, pero esta es la parte m@'as dura.

source: The @file{ring.el} File
es: El fichero @file{ring.el}

source: @file{ring.el} file
es: fichero @file{ring.el}

source: Interestingly, GNU Emacs posses a file called @file{ring.el} that provides many of the features we just discussed. But functions such as @code{kill-ring-yank-pointer} do not use this library, possibly because they were written earlier.
es: De manera interesante, GNU Emacs posee un fichero llamado @file{ring.el} que provee muchas de las funcionalidades que ahora se discuten. Pero las funciones tales como @code{kill-ring-yank-pointer} no usan esta librer@'{@dotless{i}}a, posiblemente porque fueron escritas pronto.

source: Printed axes help you understand a graph. They convey scale. In an earlier chapter (@pxref{Readying a Graph, , Readying a Graph}), we wrote the code to print the body of a graph. Here we write the code for printing and labeling vertical and horizontal axes, along with the body itself.
es: Los ejes impresos ayudan a comprender un grafo. Para crear escalas. En un cap@'{@dotless{i}}tulo anterior (@pxref{Leyendo un grafo, , Leyendo un grafo}), se escribi@'o el c@'odigo para imprimir el cuerpo de un grafo. Aqu@'{@dotless{i}} se escribe el c@'odigo para imprimir y etiquetar ejes horizontales y verticales, a lo largo del cuerpo en s@'{@dotless{i}}.

source: Labeled Example
es: Ejemplo etiquetado

source: Labeled Example Graph
es: Grafo de ejemplo etiquetado

source: Since insertions fill a buffer to the right and below point, the new graph printing function should first print the Y or vertical axis, then the body of the graph, and finally the X or horizontal axis. This sequence lays out for us the contents of the function:
es: Puesto que las inserciones rellenan un b@'uffer a la derecha y debajo del punto, el nuevo grafo imprime la funci@'on que primero imprimir@'{@dotless{i}}a el eje vertical Y, despu@'es el cuerpo del grafo, y finalmente el eje horizontal X. Esta secuencia nos da los contenidos de la funci@'on:

source: Set up code.
es: Configura c@'odigo.

source: Print Y axis.
es: Imprime el eje Y.

source: Print body of graph.
es: Imprime el cuerpo del grafo.

source: Print X axis.
es: Imprime el eje X.

source: Here is an example of how a finished graph should look:
es: Aqu@'{@dotless{i}} hay un ejemplo de como se ve un grafo finalizado:

source: In this graph, both the vertical and the horizontal axes are labeled with numbers. However, in some graphs, the horizontal axis is time and would be better labeled with months, like this:
es: En este grafo, en ambos ejes vertical y horizontal se etiquetan con n@'umeros. Sin embargo, en algunos grafos, el eje horizontal es tiempo y estar@'{@dotless{i}}a mejor etiquetarlo con meses, as@'{@dotless{i}}:

source: 5 - * * ** * ******* ********** ** 1 - ************** | ^ | Jan June Jan
es: 5 - * * ** * ******* ********** ** 1 - ************** | ^ | Enero Junio Enero

source: Indeed, with a little thought, we can easily come up with a variety of vertical and horizontal labeling schemes. Our task could become complicated. But complications breed confusion. Rather than permit this, it is better choose a simple labeling scheme for our first effort, and to modify or replace it later.
es: Dentro, con un peque@~no pensamiento, se puede f@'acilmente venir con una variedad de esquemas de etiquetado verticales y horizontales. Nuestra tarea podr@'{@dotless{i}}a llegar a ser complicada. Pero las complicaciones generan confusi@'on. En vez de permitir esto, es mejor elegir un simple esquema de etiquetado para nuestro primer esfuerzo, y modificarlo o reemplazarlo despu@'es.

source: These considerations suggest the following outline for the @code{print-graph} function:
es: Estas consideraciones sugieren el siguiente outline para la funci@'on @code{print-graph}:

source: We can work on each part of the @code{print-graph} function definition in turn.
es: Nosotros podemos trabajar en cada parte de la definici@'on de funci@'on @code{print-graph}.

source: The @code{print-graph} Varlist
es: La varlist @code{print-graph}

source: In writing the @code{print-graph} function, the first task is to write the varlist in the @code{let} expression. (We will leave aside for the moment any thoughts about making the function interactive or about the contents of its documentation string.)
es: Para escribir la funci@'on @code{print-graph}, la primera tarea es escribir la varlist en la expresi@'on @code{let}. (Nosotros dejaremos por ahora cualquier pensamiento acerca de hacer la funci@'on interactive o acerca de los contenidos de su cadena de documentaci@'on.)

source: The varlist should set several values. Clearly, the top of the label for the vertical axis must be at least the height of the graph, which means that we must obtain this information here. Note that the @code{print-graph-body} function also requires this information. There is no reason to calculate the height of the graph in two different places, so we should change @code{print-graph-body} from the way we defined it earlier to take advantage of the calculation.
es: La varlist asignar@'{@dotless{i}}a varios valores. Claramente, la etiqueta superior del eje vertical debe ser al menos la altura del grafo, que significa que debe obtener esta informaci@'on aqu@'{@dotless{i}}. Note que la funci@'on @code{print-graph-body} tambi@'en requiere esta informaci@'on. No hay raz@'on para calcular la altura del grafo en dos lugares diferentes, as@'{@dotless{i}} cambiar@'{@dotless{i}}a @code{print-graph-body} desde el camino que definimos pronto para tomar ventaja del c@'alculo.

source: Similarly, both the function for printing the X axis labels and the @code{print-graph-body} function need to learn the value of the width of each symbol. We can perform the calculation here and change the definition for @code{print-graph-body} from the way we defined it in the previous chapter.
es: De manera similar, tanto la funci@'on para imprimir la etiqueta del eje X y la funci@'on @code{print-graph-body} se necesita aprender el valor del ancho de cada s@'{@dotless{i}}mbolo. Se puede desarrollar el c@'alculo aqu@'{@dotless{i}} y cambiar la definici@'on para @code{print-graph-body} desde el camino que se defini@'o en el cap@'{@dotless{i}}tulo previo.

source: The length of the label for the horizontal axis must be at least as long as the graph. However, this information is used only in the function that prints the horizontal axis, so it does not need to be calculated here.
es: El tama@~no de la etiqueta para el eje horizontal debe ser al menos tan largo como el grafo. Sin embargo, esta informaci@'on es usada solo en la funci@'on que imprime el eje horizontal, as@'{@dotless{i}} no necesita calcularse aqu@'{@dotless{i}}.

source: These thoughts lead us directly to the following form for the varlist in the @code{let} for @code{print-graph}:
es: Estos pensamientos nos llevan directamente a la siguiente forma para la varlist en el @code{let} para @code{print-graph}:

source: (let ((height (apply 'max numbers-list)) ; @r{First version.} (symbol-width (length graph-blank)))
es: (let ((height (apply 'max numbers-list)) ; @r{Primera versi@'on.} (symbol-width (length graph-blank)))

source: As we shall see, this expression is not quite right.
es: Como se ver@'a, esta expresi@'on no es bastante correcta.

source: Axis, print vertical
es: Ejes, imprimir vertical

source: Y axis printing
es: imprimiendo eje Y

source: Vertical axis printing
es: Imprimiendo Ejes Verticales

source: Print vertical axis
es: Imprimir eje vertical

source: The job of the @code{print-Y-axis} function is to print a label for the vertical axis that looks like this:
es: El trabajo de la funci@'on @code{print-Y-axis} es imprimir una etiqueta para el eje vertical que se parece a esto:

source: The function should be passed the height of the graph, and then should construct and insert the appropriate numbers and marks.
es: La funci@'on se pasar@'{@dotless{i}}a a lo alto del grafo, y as@'{@dotless{i}} construyen e insertan los n@'umeros y marcas apropiados.

source: print-Y-axis in Detail
es: print-Y-axis en Detalle

source: The @code{print-Y-axis} Function in Detail
es: La funci@'on @code{print-Y-axis} en detalle

source: It is easy enough to see in the figure what the Y axis label should look like; but to say in words, and then to write a function definition to do the job is another matter. It is not quite true to say that we want a number and a tic every five lines: there are only three lines between the @samp{1} and the @samp{5} (lines 2, 3, and 4), but four lines between the @samp{5} and the @samp{10} (lines 6, 7, 8, and 9). It is better to say that we want a number and a tic mark on the base line (number 1) and then that we want a number and a tic on the fifth line from the bottom and on every line that is a multiple of five.
es: Es suficientemente f@'acil ver en la figura que la etiqueta del eje Y pero se puede decir en palabras, y entonces escribir una definici@'on de funci@'on para hacer el trabajo es otra materia. No es bastante verdad decir que se quiere un n@'umero y un tic cada cinco l@'{@dotless{i}}neas: solo hay tres l@'{@dotless{i}}neas entre el @samp{1} y el @samp{5} (l@'{@dotless{i}}neas 2, 3 y 4), pero cuatro l@'{@dotless{i}}neas entre el @samp{5} y el @samp{10} (l@'{@dotless{i}}neas 6, 7, 8 y 9). Es mejor decir que se quiere un n@'umero y un tic en la quinta l@'{@dotless{i}}nea desde abajo a cada l@'{@dotless{i}}nea que es un m@'ultiplo de cinco.

source: What height should the label be?
es: @questiondown{}A qu@'e altura se deber@'{@dotless{i}}a etiquetar?

source: The next issue is what height the label should be? Suppose the maximum height of tallest column of the graph is seven. Should the highest label on the Y axis be @samp{5 -}, and should the graph stick up above the label? Or should the highest label be @samp{7 -}, and mark the peak of the graph? Or should the highest label be @code{10 -}, which is a multiple of five, and be higher than the topmost value of the graph?
es: La siguiente cuesti@'on es a que altura se etiquetar@'{@dotless{i}}a. Sup@'on que la m@'axima altura de la columna mayor del grafo es siete. La etiqueta superior en el eje Y ser@'{@dotless{i}}a @samp{5 -}, ¿y el grafo se pegar@'{@dotless{i}}a debajo de la etiqueta?, ¿o la etiqueta superior ser@'{@dotless{i}}a @samp{7 -}, y marcar la vertical del grafo? ¿o ser@'{@dotless{i}}a la etiqueta superior @code{10 -}, que es m@'ultiplo de cinco, y es superior al valor m@'as alto del grafo?

source: The latter form is preferred. Most graphs are drawn within rectangles whose sides are an integral number of steps long---5, 10, 15, and so on for a step distance of five. But as soon as we decide to use a step height for the vertical axis, we discover that the simple expression in the varlist for computing the height is wrong. The expression is @code{(apply 'max numbers-list)}. This returns the precise height, not the maximum height plus whatever is necessary to round up to the nearest multiple of five. A more complex expression is required.
es: La @'ultima forma es preferida. La mayor@'{@dotless{i}}a de los grafos son rect@'angulos cuyos lados son un n@'umero integral de pasos a lo largo --- 5, 10, 15, y as@'{@dotless{i}} para un paso a distancia de cinco. Pero tan pronto se decide usar un paso alto para el eje vertical, se descubre que la expresi@'on simple en la varlist para la altura de la computaci@'on es err@'onea. La expresi@'on es @code{(apply 'max numbers-list)}. Esto devuelve la altura precisa, no la altura m@'axima m@'as de lo que es necesario para redondear el m@'ultiplo de cinco. Una expresi@'on m@'as compleja es requerida.

source: As usual in cases like this, a complex problem becomes simpler if it is divided into several smaller problems.
es: Como es normal en casos como este, un problema complejo llega a ser simple si est@'a dividido en varios problemas peque@~nos.

source: First, consider the case when the highest value of the graph is an integral multiple of five---when it is 5, 10, 15, or some higher multiple of five. We can use this value as the Y axis height.
es: Primero, considere el caso cuando el valor superior del grafo es un m@'ultiplo integral de cinco --- cuando eso es 5, 10, 15, o alg@'un m@'ultiplo de cinco. Se puede usar este valor como la altura del eje Y.

source: A fairly simply way to determine whether a number is a multiple of five is to divide it by five and see if the division results in a remainder. If there is no remainder, the number is a multiple of five. Thus, seven divided by five has a remainder of two, and seven is not an integral multiple of five. Put in slightly different language, more reminiscent of the classroom, five goes into seven once, with a remainder of two. However, five goes into ten twice, with no remainder: ten is an integral multiple of five.
es: Un camino simple y limpio para determinar si un n@'umero es m@'ultiplo de cinco se divide por cinco y mira si la divisi@'on devuelve resto. Si no hay resto, el n@'umero es un m@'ultiplo de cinco. De este modo, siete dividido tiene un resto de dos, y siete no es un entero m@'ultiplo de cinco. Dicho de otra manera, recordando la escuela, cinco entre siete es uno y me llevo dos. Sin embargo, diez entre dos, no tiene resto: diez es un m@'ultiplo entero de cinco.

source: Side Trip: Compute a Remainder
es: Viaje lateral: Calcula un resto

source: % @r{(remainder function)}
es: % @r{(funci@'on resto)}

source: Remainder function, @code{%}
es: Funci@'on resto, @code{%}

source: In Lisp, the function for computing a remainder is @code{%}. The function returns the remainder of its first argument divided by its second argument. As it happens, @code{%} is a function in Emacs Lisp that you cannot discover using @code{apropos}: you find nothing if you type @kbd{M-x apropos @key{RET} remainder @key{RET}}. The only way to learn of the existence of @code{%} is to read about it in a book such as this or in the Emacs Lisp sources.
es: En Lisp, la funci@'on para calcular un resto es @code{%}. La funci@'on devuelve el resto de su primer argumento dividido por su segundo argumento. Como ocurre, @code{%} es una funci@'on en Emacs Lisp que no se puede implementar usando @code{apropos}: no se puede encontrar nada si se escribe @kbd{M-x apropos @key{RET} resto @key{RET}}. El @'unico camino para aprender la existencia de @code{%} es leer acerca de eso en un libro tal como este o en las fuentes de Emacs Lisp.

source: You can try the @code{%} function by evaluating the following two expressions:
es: Se puede probar la funci@'on @code{%} evaluando las siguientes dos expresiones:

source: The first expression returns 2 and the second expression returns 0.
es: La primera expresi@'on devuelve 2 y la segunda expresi@'on devuelve 0.

source: To test whether the returned value is zero or some other number, we can use the @code{zerop} function. This function returns @code{t} if its argument, which must be a number, is zero.
es: Para chequear si el valor devuelto es cero o alg@'un otro n@'umero, se puede usar la funci@'on @code{zerop}. Esta funci@'on devuelve @code{t} si su argumento debe ser un n@'umero, es cero.

source: Thus, the following expression will return @code{t} if the height of the graph is evenly divisible by five:
es: De este modo, la siguiente expresi@'on devolver@'a @code{t} si la altura del grafo es divisible por cinco:

source: (The value of @code{height}, of course, can be found from @code{(apply 'max numbers-list)}.)
es: (El valor de @code{height}, de acuerdo, puede ser encontrado desde @code{(apply 'max numbers-list)}.)
