Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Programming in Emacs Lisp
es: Programaci@'on en Emacs Lisp

source: Emacs Lisp Intro: (eintr)
es: Introducci@'on a Emacs Lisp: (eintr)

source: A simple introduction to Emacs Lisp programming.
es: Una introducci@'on simple a la programaci@'on a Emacs Lisp

source: This is an @cite{Introduction to Programming in Emacs Lisp}, for people who are not programmers.
es: Esto es una @cite{Introducci@'on a la Programaci@'on en Emacs Lisp}, para personas que no son programadoras.

source: Edition @value{edition-number}, @value{update-date}
es: Traducido desde la edici@'on @value{edition-number}.

source: Copyright @copyright{} 1990--1995, 1997, 2001--2013 Free Software Foundation, Inc.
es: Copyright @copyright{} 2015 Libremanuals.

source: Published by the:@*
es: Publicado por:@*

source: GNU Press, @hfill @uref{http://www.fsf.org/campaigns/gnu-press/}@* a division of the @hfill email: @email{sales@@fsf.org}@* Free Software Foundation, Inc. @hfill Tel: +1 (617) 542-5942@* 51 Franklin Street, Fifth Floor @hfill Fax: +1 (617) 542-2652@* Boston, MA 02110-1301 USA
es: Libremanuals, @hfill @uref{http://www.libremanuals.net/}@*

source: Published by the:
es: Publicado por el:

source: GNU Press, http://www.fsf.org/campaigns/gnu-press/ a division of the email: sales@@fsf.org Free Software Foundation, Inc. Tel: +1 (617) 542-5942 51 Franklin Street, Fifth Floor Fax: +1 (617) 542-2652 Boston, MA 02110-1301 USA
es: Libremanuals, @hfill @uref{http://www.libremanuals.net/}@*

source: {\begingroup% \hbox{}\vskip 1.5in \chaprm \centerline{An Introduction to}% \endgroup}% {\begingroup\hbox{}\vskip 0.25in \chaprm% \centerline{Programming in Emacs Lisp}% \endgroup\page\hbox{}\page}
es: {\begingroup% \hbox{}\vskip 1.5in \chaprm \centerline{Una Introducci@'on}% \endgroup}% {\begingroup\hbox{}\vskip 0.25in \chaprm% \centerline{a la Programaci@'on en Emacs Lisp}% \endgroup\page\hbox{}\page}

source: An Introduction to
es: Una Introducci@'on a la

source: Revised Third Edition
es: Revisada la tercera edici@'on

source: by Robert J. Chassell
es: Escrito por Robert J. Chassell. Traducido por David Arroyo Men@'endez.

source: An Introduction to Programming in Emacs Lisp
es: Una Introducci@'on a la Programaci@'on en Emacs Lisp

source: This master menu first lists each chapter and index; then it lists every node in every chapter.
es: Este men@'u maestro primero lista cada cap@'{@dotless{i}}tulo e indexa; entonces lista cada nodo en cada cap@'{@dotless{i}}tulo.

source: Preface
es: Prefacio

source: What to look for.
es: Qu@'e buscas

source: List Processing
es: Procesamiento de listas

source: What is Lisp?
es: @questiondown{}Qu@'e es Lisp?

source: Practicing Evaluation
es: Practicando evaluaci@'on

source: Running several programs.
es: Ejecutando varios programas.

source: Writing Defuns
es: Escribiendo funciones

source: How to write function definitions.
es: C@'omo escribir definiciones de funciones.

source: Buffer Walk Through
es: Un paseo a trav@'es de los b@'uffers

source: Exploring a few buffer-related functions.
es: Explorando unas pocas funciones relacionadas con los b@'uffers.

source: More Complex
es: M@'as complejidad

source: A few, even more complex functions.
es: Unas pocas, incluso m@'as complejas funciones.

source: Narrowing & Widening
es: Encogiendo y extendiendo

source: Restricting your and Emacs attention to a region.
es: Restringi@'endote a t@'i y a Emacs a una regi@'on.

source: car cdr & cons
es: Car cdr y cons

source: Fundamental functions in Lisp.
es: Funciones fundamentales en Lisp.

source: Cutting & Storing Text
es: Cortando y almacenando texto

source: Removing text and saving it.
es: Eliminando texto y guard@'andolo.

source: List Implementation
es: Implementaci@'on de listas

source: How lists are implemented in the computer.
es: C@'omo las listas se implementan en el ordenador

source: Yanking
es: Pegando

source: Pasting stored text.
es: Pegando texto almacenado.

source: Loops & Recursion
es: Bucles y recursi@'on

source: How to repeat a process.
es: C@'omo repetir un proceso.

source: Regexp Search
es: Buscar regexp

source: Regular expression searches.
es: B@'usquedas de expresiones regulares.

source: Counting Words
es: Contando palabras

source: A review of repetition and regexps.
es: Una revisi@'on de repetici@'on y regexps.

source: Words in a defun
es: Palabras en una funci@'on

source: Counting words in a @code{defun}.
es: Contando palabras en una @code{defun}.

source: Readying a Graph
es: Leyendo un grafo

source: A prototype graph printing function.
es: Un grafo prototipo imprimiendo una funci@'on.

source: Emacs Initialization
es: Inicializaci@'on de Emacs

source: How to write a @file{.emacs} file.
es: C@'omo escribir un fichero @file{.emacs}.

source: Debugging
es: Depurando

source: How to run the Emacs Lisp debuggers.
es: C@'omo ejecutar los depuradores de Emacs Lisp.

source: Now you have the basics.
es: Ahora tienes las bases.

source: An appendix: how to find reduplicated words.
es: Un ap@'endice: c@'omo encontrar palabras reduplicadas.

source: An appendix: how the kill ring works.
es: Un ap@'endice: c@'omo el kill ring funciona.

source: Full Graph
es: Grafo completo

source: How to create a graph with labeled axes.
es: C@'omo crear un grafo con ejes etiquetados.

source: Free Software and Free Manuals::
es: Software Libre y Manuales Libres::

source: Index::
es: @'Indice::

source: About the Author
es: Acerca del Autor

source: --- The Detailed Node Listing ---
es: --- El Listado Detallado de Nodos ---

source: Why
es: Por qu@'e

source: Why learn Emacs Lisp?
es: @questiondown{}Por qu@'e aprender Emacs Lisp?

source: On Reading this Text
es: Leyendo este texto

source: Read, gain familiarity, pick up habits....
es: Leer, ganar familiaridad, coger h@'abitos...

source: Who You Are
es: Quien eres

source: For whom this is written.
es: Para quien es este escrito.

source: Lisp History::
es: Historia de Lisp::

source: Note for Novices
es: Nota para principiantes

source: You can read this as a novice.
es: Tu puedes leer esto como un novato

source: Thank You
es: Se agradece

source: Lisp Lists
es: Listas Lisp

source: What are lists?
es: @questiondown{}Qu@'e son listas?

source: Run a Program
es: Ejecutar un programa

source: Any list in Lisp is a program ready to run.
es: Cualquier lista en Lisp es un programa listo para ejecutarse.

source: Making Errors
es: Creando errores

source: Generating an error message.
es: Generando un mensaje de error.

source: Names & Definitions
es: Nombres y definiciones

source: Names of symbols and function definitions.
es: Nombres de s@'{@dotless{i}}mbolos y definiciones de funci@'on.

source: Lisp Interpreter
es: Interpr@'ete Lisp

source: What the Lisp interpreter does.
es: Qu@'e hace el int@'erprete Lisp.

source: Evaluation
es: Evaluaci@'on

source: Running a program.
es: Ejecutando un programa.

source: Returning a value from a variable.
es: Devolviendo un valor desde una variable.

source: Arguments
es: Argumentos

source: Passing information to a function.
es: Pasando informaci@'on a una funci@'on.

source: set & setq
es: set y setq

source: Setting the value of a variable.
es: Configurando el valor de una variable.

source: Summary
es: Resumen

source: The major points.
es: Los mayores puntos.

source: Error Message Exercises
es: Ejercicios de mensajes de error

source: Numbers Lists
es: Listas de n@'umeros

source: List have numbers, other lists, in them.
es: Lista tener n@'umeros, otras listas, en ellas.

source: Lisp Atoms
es: @'Atomos Lisp

source: Elemental entities.
es: Entidades Elementales.

source: Whitespace in Lists
es: Espacios en blanco en listas

source: Formatting lists to be readable.
es: Formatenado listas para ser legibles.

source: Typing Lists
es: Escribiendo listas

source: How GNU Emacs helps you type lists.
es: C@'omo GNU Emacs te ayuda a escribir listas.

source: The Lisp Interpreter
es: El int@'erprete Lisp

source: Complications
es: Complicaciones

source: Variables, Special forms, Lists within.
es: Variables, formas especiales, Listas.

source: Byte Compiling
es: Compilaci@'on de bytes

source: Specially processing code for speed.
es: Especialmente procesando c@'odigo por la velocidad.

source: How the Interpreter Acts
es: C@'omo el int@'erprete act@'ua

source: Returns and Side Effects...
es: Devolver y Efectos Colaterales...

source: Evaluating Inner Lists
es: Evaluando listas propias

source: Lists within lists...
es: Listas con listas...

source: fill-column Example::
es: Ejemplo de rellenar columna::

source: Void Function
es: Funci@'on vac@'{@dotless{i}}a

source: The error message for a symbol without a function.
es: El mensaje de error para un s@'{@dotless{i}}mbolo sin una funci@'on.

source: Void Variable
es: Variable vac@'{@dotless{i}}a

source: The error message for a symbol without a value.
es: El mensaje de error para un s@'{@dotless{i}}mbolo sin un valor.

source: Data types
es: Tipos de datos

source: Types of data passed to a function.
es: Tipos de datos pasados a una funci@'on.

source: Args as Variable or List
es: Argumentos como variables o listas

source: An argument can be the value of a variable or list.
es: Un argumento puede ser el valor de una variable o lista.

source: Variable Number of Arguments
es: N@'umero de variables de argumentos

source: Some functions may take a variable number of arguments.
es: Algunas funciones pueden tomar un n@'umero variable de argumentos.

source: Wrong Type of Argument
es: Tipo incorrecto de argumento

source: Passing an argument of the wrong type to a function.
es: Pasando un argumento del tipo incorrecto a una funci@'on.

source: A useful function for sending messages.
es: Una funci@'on @'util para enviar mensajes.

source: Setting the Value of a Variable
es: Configurando el valor de una variable

source: Using set
es: Usando set

source: Setting values.
es: Configurando valores.

source: Using setq
es: Usando setq

source: Setting a quoted value.
es: Configurando un valor citado.

source: Counting
es: Contando

source: Using @code{setq} to count.
es: Usando @code{setq} para contar.

source: How to Evaluate
es: C@'omo evaluar

source: Typing editing commands or @kbd{C-x C-e} causes evaluation.
es: Escribiendo comandos de edici@'on o con @kbd{C-x C-e}.

source: Buffer Names
es: Nombres de b@'uffer

source: Buffers and files are different.
es: Buffers y ficheros son diferentes.

source: Getting Buffers
es: Obteniendo b@'uffers

source: Getting a buffer itself, not merely its name.
es: Obteniendo un buffer por s@'{@dotless{i}} mismo, no solamente su nombre.

source: Switching Buffers
es: Cambiando b@'uffers

source: How to change to another buffer.
es: C@'omo cambiar a otro buffer.

source: Buffer Size & Locations
es: Tama@~no de b@'uffer y localizaciones

source: Where point is located and the size of the buffer.
es: D@'onde el punto est@'a localizado y el tama@~no del buffer.

source: Evaluation Exercise
es: Ejercicio de evaluaci@'on

source: How To Write Function Definitions
es: C@'omo escribir definiciones de funciones

source: Primitive Functions::
es: Funciones primitivas::

source: The @code{defun} special form.
es: La forma especial @code{defun}.

source: Install
es: Instalar

source: Install a function definition.
es: Instalar una definici@'on de funci@'on.

source: Making a function interactive.
es: Creando una funci@'on interactive.

source: Interactive Options
es: Opciones de interactive.

source: Different options for @code{interactive}.
es: Diferentes opciones para @code{interactive}.

source: Permanent Installation
es: Instalaci@'on Permanente

source: Installing code permanently.
es: Instalando c@'odigo permanentemente.

source: Creating and initializing local variables.
es: Creando e inicializando variables locales.

source: What if?
es: @questiondown{}Y qu@'e si?

source: If--then--else expressions.
es: Expresiones If--then--else.

source: Truth & Falsehood
es: Verdad y falsedad

source: What Lisp considers false and true.
es: Que considera Lisp falso y cierto.

source: Keeping track of point, mark, and buffer.
es: Guardando la traza del punto, la marca, y el buffer.

source: Review::
es: Revisar::

source: defun Exercises
es: Ejercicios defun

source: Install a Function Definition
es: Instalar una definici@'on de funci@'on

source: Effect of installation::
es: Efecto de instalaci@'on::

source: Change a defun
es: Cambiar un defun

source: How to change a function definition.
es: C@'omo cambiar una definici@'on de funci@'on

source: Make a Function Interactive
es: Crear una funci@'on interactive

source: Interactive multiply-by-seven
es: multiply-by-seven interactivo

source: An overview.
es: Un resumen

source: multiply-by-seven in detail
es: multiply-by-seven en detalle

source: The interactive version.
es: La versi@'on interactive.

source: Prevent confusion::
es: Prevenir confusi@'on::

source: Parts of let Expression::
es: Partes de la expresi@'on let::

source: Sample let Expression::
es: Ejemplo de expresi@'on let::

source: Uninitialized let Variables
es: Variables let inicializadas

source: The @code{if} Special Form
es: La forma especial @code{if}

source: if in more detail::
es: if en m@'as detalle::

source: type-of-animal in detail
es: tipo-de-animal en detalle

source: An example of an @code{if} expression.
es: Un ejemplo de una expresi@'on @code{if}.

source: Truth and Falsehood in Emacs Lisp
es: Verdad y falsedad en Emacs Lisp

source: nil explained
es: nil explicado

source: @code{nil} has two meanings.
es: @code{nil} tiene dos significados.

source: Point and mark
es: Punto y marca

source: A review of various locations.
es: Una revisi@'on de varias localizaciones.

source: Template for save-excursion
es: Plantilla para save-excursion

source: A Few Buffer--Related Functions
es: Unas pocas funciones de buffer relacionadas

source: Finding More
es: Encontrando m@'as

source: How to find more information.
es: C@'omo encontrar m@'as informaci@'on.

source: Shows @code{goto-char}, @code{point-min}, and @code{push-mark}.
es: Muestra @code{goto-char}, @code{point-min}, y @code{push-mark}.

source: Almost the same as @code{beginning-of-buffer}.
es: Casi lo mismo que @code{beginning-of-buffer}.

source: Uses @code{save-excursion} and @code{insert-buffer-substring}.
es: Usa @code{save-excursion} y @code{insert-buffer-substring}.

source: Buffer Related Review
es: Revisa lo relacionado con el b@'uffer

source: Review.
es: Revisa

source: Buffer Exercises
es: Ejercicios de b@'uffer

source: The Definition of @code{mark-whole-buffer}
es: La definici@'on de @code{mark-whole-buffer}

source: mark-whole-buffer overview::
es: resumen de mark-whole-buffer::

source: Body of mark-whole-buffer
es: Cuerpo de mark-whole-buffer

source: Only three lines of code.
es: Solo tres l@'{@dotless{i}}neas de c@'odigo.

source: The Definition of @code{append-to-buffer}
es: La definici@'on de @code{append-to-buffer}

source: append-to-buffer overview::
es: resumen de append-to-buffer::

source: append interactive
es: append interactivo

source: A two part interactive expression.
es: Una expresi@'on interactiva de dos partes.

source: append-to-buffer body
es: cuerpo append-to-buffer

source: Incorporates a @code{let} expression.
es: Incorpora una expresi@'on @code{let}.

source: How the @code{save-excursion} works.
es: C@'omo @code{save-excursion} trabaja.

source: A Few More Complex Functions
es: Unas pocas funciones m@'as complejas

source: With @code{set-buffer}, @code{get-buffer-create}.
es: Con @code{set-buffer}, @code{get-buffer-create}.

source: Read-only, and with @code{or}.
es: Solo lectura, y con @code{or}.

source: Second Buffer Related Review::
es: Revisar el segundo b@'uffer relacionado::

source: optional Exercise
es: Ejercicio opcional

source: The Definition of @code{insert-buffer}
es: La definici@'on de @code{insert-buffer}

source: insert-buffer code::
es: c@'odigo insert-buffer::

source: insert-buffer interactive
es: insert-buffer interactivo

source: When you can read, but not write.
es: Cuando tu puedes leer, pero no escribir.

source: insert-buffer body
es: cuerpo insert-buffer

source: The body has an @code{or} and a @code{let}.
es: El cuerpo tiene un @code{or} y un @code{let}.

source: if & or
es: si y o

source: Using an @code{if} instead of an @code{or}.
es: Usando un @code{if} en vez de un @code{or}.

source: Insert or
es: Insertar o

source: How the @code{or} expression works.
es: C@'omo la expresi@'on @code{or} funciona.

source: Insert let
es: Insertar let

source: Two @code{save-excursion} expressions.
es: Dos expresiones @code{save-excursion}.

source: New insert-buffer
es: Nuevo insert-buffer

source: The Interactive Expression in @code{insert-buffer}
es: La expresi@'on interactiva en @code{insert-buffer}

source: Read-only buffer
es: B@'uffer solo lectura

source: When a buffer cannot be modified.
es: Cuando un buffer no puede ser modificado.

source: b for interactive
es: b para interactivo

source: An existing buffer or else its name.
es: Un buffer existe o adem@'as su nombre.

source: Complete Definition of @code{beginning-of-buffer}
es: Definici@'on completa de @code{beginning-of-buffer}

source: Optional Arguments::
es: Argumentos opcionales::

source: Example with optional argument.
es: Ejemplo con argumento opcional.

source: beginning-of-buffer complete
es: Completo beginning-of-buffer

source: @code{beginning-of-buffer} with an Argument
es: @code{beginning-of-buffer} con un argumento

source: Disentangle beginning-of-buffer::
es: Desenmara@~nar beginning-of-buffer::

source: Large buffer case::
es: El caso del buffer largo::

source: Small buffer case
es: Peque@~no caso de b@'uffer

source: Narrowing and Widening
es: Encogiendo y extendiendo

source: Narrowing advantages
es: Ventajas de encoger

source: The advantages of narrowing
es: Las ventajas de encoger

source: The @code{save-restriction} special form.
es: La forma especial @code{save-restriction}.

source: The number of the line that point is on.
es: El n@'umero de la l@'{@dotless{i}}nea que apunta est@'a activa.

source: narrow Exercise
es: Ejercicio narrow

source: @code{car}, @code{cdr}, @code{cons}: Fundamental Functions
es: @code{car}, @code{cdr}, @code{cons}: Funciones fundamentales

source: Strange Names
es: Nombres extra@~nos

source: An historical aside: why the strange names?
es: Un lado hist@'orico: @questiondown{}por qu@'e los nombres extra@~nos?

source: car & cdr
es: car y cdr

source: Functions for extracting part of a list.
es: Funciones para extraer parte de una lista.

source: Constructing a list.
es: Construyendo una lista.

source: Calling @code{cdr} repeatedly.
es: Llamando @code{cdr} repetidamente.

source: Changing the first element of a list.
es: Cambiando el primer elemento de una lista.

source: Changing the rest of a list.
es: Cambiando el resto de una lista.

source: cons Exercise
es: Ejercicio cons

source: Build a list::
es: Construir una lista::

source: How to find the length of a list.
es: C@'omo encontrar el tama@~no de una lista.

source: Cutting and Storing Text
es: Cortando y almacenando texto

source: Storing Text
es: Almacenando Texto

source: Text is stored in a list.
es: El texto est@'a almacenado en una lista.

source: Cutting out text up to a character.
es: Cortando texto a un car@'acter.

source: Cutting text out of a region.
es: Cortando texto de una regi@'on.

source: A definition for copying text.
es: Una definici@'on para copiar texto.

source: Digression into C
es: Disgresi@'on dentro de C

source: Minor note on C programming language macros.
es: Nota menor en macros del lenguaje de programaci@'on C.

source: How to give a variable an initial value.
es: C@'omo dar a una variable un valor inicial.

source: cons & search-fwd Review::
es: Revisi@'on de cons y search-fwd::

source: search Exercises
es: Buscar ejercicios

source: Complete zap-to-char
es: Completar zap-to-char

source: The complete implementation.
es: La implementaci@'on completa.

source: zap-to-char interactive
es: zap-to-char interactivo

source: A three part interactive expression.
es: Una expresi@'on interactiva de tres partes.

source: zap-to-char body
es: cuerpo zap-to-char

source: A short overview.
es: Un resumen corto

source: How to search for a string.
es: C@'omo buscar una cadena.

source: The @code{progn} special form.
es: La forma especial @code{progn}.

source: Summing up zap-to-char
es: Resumiendo zap-to-char

source: Using @code{point} and @code{search-forward}.
es: Usando @code{point} y @code{search-forward}.

source: Complete kill-region
es: Completa kill-region

source: The function definition.
es: La definici@'on de funci@'on.

source: Dealing with a problem.
es: Tratando con un problema.

source: Lisp macro
es: Macro Lisp

source: Complete copy-region-as-kill
es: Completar copy-region-as-kill

source: The complete function definition.
es: La definici@'on completa de funci@'on.

source: copy-region-as-kill body
es: cuerpo copy-region-as-kill

source: The body of @code{copy-region-as-kill}.
es: El cuerpo de @code{copy-region-as-kill}.

source: The Body of @code{copy-region-as-kill}
es: El cuerpo de @code{copy-region-as-kill}

source: kill-append function::
es: Funci@'on kill-append::

source: kill-new function
es: Funci@'on kill-new

source: Initializing a Variable with @code{defvar}
es: Inicializando una variable con @code{defvar}

source: See variable current value::
es: Mira el valor actual de la variable::

source: defvar and asterisk
es: defvar y asterisk

source: How Lists are Implemented
es: C@'omo las listas se implementan

source: Lists diagrammed::
es: Listas diagramadas::

source: Symbols as Chest
es: S@'{@dotless{i}}mbolos como cajas

source: Exploring a powerful metaphor.
es: Explorando una met@'afora poderosa.

source: List Exercise
es: Ejercicio Lista

source: Yanking Text Back
es: Pegando texto

source: Kill Ring Overview::
es: Resumen del anillo de la muerte::

source: The kill ring is a list.
es: El anillo de la muerte es una lista.

source: yank nthcdr Exercises
es: pegar Ejercicio nthcdr

source: The @code{kill-ring-yank-pointer} variable.
es: La variable @code{kill-ring-yank-pointer}.

source: Loops and Recursion
es: Bucles y recursi@'on

source: Causing a stretch of code to repeat.
es: Causando un cierto c@'odigo para repetir.

source: dolist dotimes::
es: Dolist y dotimes::

source: Causing a function to call itself.
es: Causando que una funci@'on se llame a s@'{@dotless{i}} misma.

source: Looping exercise
es: Ejercicio de Bucle

source: Looping with while
es: Bucles while

source: Repeat so long as test returns true.
es: Repetir tantas veces como el test devuelva verdadero.

source: Loop Example
es: Ejemplo de bucle

source: A @code{while} loop that uses a list.
es: Un bucle @code{while} que usa una lista.

source: Uses @code{while}, @code{car}, @code{cdr}.
es: Usos @code{while}, @code{car}, @code{cdr}.

source: Incrementing Loop
es: Incrementando el Bucle

source: A loop with an incrementing counter.
es: Un bucle con un contador de incremento.

source: Incrementing Loop Details::
es: Incrementando los detalles de los bucles::

source: Decrementing Loop
es: Bucle que se decrementa

source: A loop with a decrementing counter.
es: Un bucle con un decrementando contador.

source: Details of an Incrementing Loop
es: Detalles de un bucle que se incrementa

source: Incrementing Example
es: Ejemplo de Incremento

source: Counting pebbles in a triangle.
es: Contando esquinas en un tri@'angulo.

source: Inc Example parts
es: Partes Inc de Ejemplo

source: The parts of the function definition.
es: Las partes de la definici@'on de funci@'on.

source: Inc Example altogether
es: Ejemplo Inc junto

source: Putting the function definition together.
es: Poniendo la definici@'on de funci@'on junta.
