Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Instead of choosing the word @code{number} for the name of the argument, I could have picked any other name. For example, I could have chosen the word @code{multiplicand}. I picked the word `number' because it tells what kind of value is intended for this slot; but I could just as well have chosen the word `multiplicand' to indicate the role that the value placed in this slot will play in the workings of the function. I could have called it @code{foogle}, but that would have been a bad choice because it would not tell humans what it means. The choice of name is up to the programmer and should be chosen to make the meaning of the function clear.
es: En vez de elegir la palabra @code{n@'umero} por el nombre del argumento, podr@'{@dotless{i}}a haber escogido cualquier otro nombre. Por ejemplo, podr@'{@dotless{i}}a haber elegido la palabra @code{multiplicando}. Yo escojo la palabra `n@'umero' porque cuenta qu@'e tipo de valor se pretende para este slot; pero yo podr@'{@dotless{i}}a haber elegido `multiplicando' para indicar el rol que el valor emplaza en este slot jugar@'a en los trabajos de la funci@'on. Yo podr@'{@dotless{i}}a haber llamado @code{foogle}, pero habr@'{@dotless{i}}a sido una mala elecci@'on porque no contar@'{@dotless{i}}a qu@'e significa. La elecci@'on del nombre es subir al programador y habr@'{@dotless{i}}a elegido crear el significado claro de la funci@'on.

source: Indeed, you can choose any name you wish for a symbol in an argument list, even the name of a symbol used in some other function: the name you use in an argument list is private to that particular definition. In that definition, the name refers to a different entity than any use of the same name outside the function definition. Suppose you have a nick-name `Shorty' in your family; when your family members refer to `Shorty', they mean you. But outside your family, in a movie, for example, the name `Shorty' refers to someone else. Because a name in an argument list is private to the function definition, you can change the value of such a symbol inside the body of a function without changing its value outside the function. The effect is similar to that produced by a @code{let} expression. (@xref{let, , @code{let}}.)
es: En realidad, se puede elegir cualquier nombre que se desee para un s@'{@dotless{i}}mbolo en una lista de argumentos, incluso el nombre del s@'{@dotless{i}}mbolo usado en alguna otra funci@'on: el nombre a usar en una lista de argumentos es privado para esta definici@'on particular. En esta definici@'on, el nombre se refiere a una entidad diferente que cualquiera que usa el mismo nombre fuera de la definici@'on de funci@'on. Sup@'on que tienes un apodo `corto' en tu familia; cuando tus miembros de familia se refieren a `corto', significa el apodo. Pero fuera de tu familia, en una pel@'{@dotless{i}}cula, por ejemplo, el nombre `corto' se refiere a alguien m@'as. Porque un nombre en una lista de argumentos es privado para la definici@'on de la funci@'on, se puede cambiar el valor de un s@'{@dotless{i}}mbolo dentro del cuerpo de una funci@'on sin cambiar su valor fuera de la funci@'on. El efecto es similar a este producido por una expresi@'on @code{let}. (Ver secci@'on @ref{let, @code{let}}.)

source: The argument list is followed by the documentation string that describes the function. This is what you see when you type @w{@kbd{C-h f}} and the name of a function. Incidentally, when you write a documentation string like this, you should make the first line a complete sentence since some commands, such as @code{apropos}, print only the first line of a multi-line documentation string. Also, you should not indent the second line of a documentation string, if you have one, because that looks odd when you use @kbd{C-h f} (@code{describe-function}). The documentation string is optional, but it is so useful, it should be included in almost every function you write.
es: La lista de argumentos est@'a seguida por la documentaci@'on que describe la funci@'on. Esto es lo que tu ves cuando tu escribes @w{@kbd{C-h f}} y el nombre de una funci@'on. Incidentalmente, cuando se escribe una documentaci@'on como esta, se har@'{@dotless{i}}a la primera l@'{@dotless{i}}nea una frase completa desde algunos comandos, tal como @code{apropos}, imprime solo la primera l@'{@dotless{i}}nea de una documentaci@'on multi-l@'{@dotless{i}}nea. Tambi@'en, no indentar@'{@dotless{i}}a la segunda l@'{@dotless{i}}nea de una documentaci@'on, si tu tienes una, esto se ve cuando usas @kbd{C-h f} (@code{describe-function}). La documentaci@'on es opcional, pero es tambi@'en @'util, deber@'{@dotless{i}}a ser incluido en casi cualquier funci@'on que se escribe.

source: * @r{(multiplication)}
es: * @r{(multiplicaci@'on)}

source: The third line of the example consists of the body of the function definition. (Most functions' definitions, of course, are longer than this.) In this function, the body is the list, @code{(* 7 number)}, which says to multiply the value of @var{number} by 7. (In Emacs Lisp, @code{*} is the function for multiplication, just as @code{+} is the function for addition.)
es: La tercera l@'{@dotless{i}}nea del ejemplo consiste en el cuerpo de la definici@'on de funci@'on. (La mayor@'{@dotless{i}}a de las definiciones de funciones, de acuerdo, son m@'as largas que esto.) En esta funci@'on, el cuerpo es la lista, @code{(* 7 number)}, que dice multiplicar el valor de @var{n@'umero} por 7. (En Emacs Lisp, @code{*} es la funci@'on para la multiplicaci@'on, solo como @code{+} es la funci@'on de suma.

source: When you use the @code{multiply-by-seven} function, the argument @code{number} evaluates to the actual number you want used. Here is an example that shows how @code{multiply-by-seven} is used; but don't try to evaluate this yet!
es: Cuando se usa la funci@'on @code{multiply-by-seven}, el argumento @code{number} eval@'ua para el n@'umero actual que quiere ser usada. Aqu@'{@dotless{i}} hay un ejemplo que muestra como @code{multiply-by-seven} es usada; pero @exclamdown{}no intentes evaluar esto primero!.

source: The symbol @code{number}, specified in the function definition in the next section, is given or ``bound to'' the value 3 in the actual use of the function. Note that although @code{number} was inside parentheses in the function definition, the argument passed to the @code{multiply-by-seven} function is not in parentheses. The parentheses are written in the function definition so the computer can figure out where the argument list ends and the rest of the function definition begins.
es: El s@'{@dotless{i}}mbolo @code{n@'umero}, especificado en la definici@'on de funci@'on en la siguiente secci@'on, es dada o ``emparejado a'' el valor 3 en el uso actual de la funci@'on. Note que aunque @code{n@'umero} estaba dentro de par@'entesis en la definici@'on de funci@'on, el argumento pasado a la funci@'on @code{multiply-by-seven} no est@'a entre par@'entesis. Los par@'entesis son escritos en la definici@'on de funci@'on as@'{@dotless{i}} el ordenador puede figurarse donde la lista de argumentos finaliza y el resto de la definici@'on de funci@'on empieza.

source: If you evaluate this example, you are likely to get an error message. (Go ahead, try it!) This is because we have written the function definition, but not yet told the computer about the definition---we have not yet installed (or `loaded') the function definition in Emacs. Installing a function is the process that tells the Lisp interpreter the definition of the function. Installation is described in the next section.
es: Si se eval@'ua este ejemplo, se obtendr@'a un mensaje error. (@exclamdown{}Ve adelante, pru@'ebalo!) Esto es porque hemos escrito la definici@'on de funci@'on pero no le hemos contado todav@'{@dotless{i}}a al ordenador la definici@'on --- no se ha instalado (o `cargado') la definici@'on de funci@'on en Emacs. Instalando una funci@'on es el proceso que cuenta al int@'erprete Lisp la definici@'on de la funci@'on. La instalaci@'on se describe en la siguiente secci@'on.

source: Definition installation
es: Definici@'on de la instalaci@'on

source: Function definition installation
es: Definici@'on de la Instalaci@'on de Funci@'on

source: If you are reading this inside of Info in Emacs, you can try out the @code{multiply-by-seven} function by first evaluating the function definition and then evaluating @code{(multiply-by-seven 3)}. A copy of the function definition follows. Place the cursor after the last parenthesis of the function definition and type @kbd{C-x C-e}. When you do this, @code{multiply-by-seven} will appear in the echo area. (What this means is that when a function definition is evaluated, the value it returns is the name of the defined function.) At the same time, this action installs the function definition.
es: Si est@'a leyendo esto dentro de Info en Emacs, se puede probar la funci@'on @code{multiply-by-seven} evaluando primero la definici@'on de funci@'on y entonces evaluando @code{(multiply-by-seven 3)}. Una copia de la definici@'on sigue. Emplaza el cursor despu@'es del @'ultimo par@'entesis de la definici@'on de funci@'on y escribe @kbd{C-x C-e}. Cuando se hace esto, @code{multiply-by-seven} aparecer@'a en el @'area echo. (Lo que significa es que cuando una definici@'on de funci@'on es evaluada, el valor devuelto es el nombre de la funci@'on definida.) Al mismo tiempo, esta acci@'on instala la definici@'on de funci@'on.

source: By evaluating this @code{defun}, you have just installed @code{multiply-by-seven} in Emacs. The function is now just as much a part of Emacs as @code{forward-word} or any other editing function you use. (@code{multiply-by-seven} will stay installed until you quit Emacs. To reload code automatically whenever you start Emacs, see @ref{Permanent Installation, , Installing Code Permanently}.)
es: Evaluando esta @code{defun}, se ha instalado @code{multiply-by-seven} en Emacs. La funci@'on es ahora solo una parte de Emacs como @code{forward-word} o cualquier otra editando la funci@'on que se usa. (@code{multiply-by-seven} estar@'a instalada hasta que sales de Emacs. Para recargar c@'odigo autom@'aticamente siempre y cuando empieces Emacs, ver @ref{Instalaci@'on Permanente, , Instalar C@'odigo Permanentemente}.)

source: Effect of installation
es: Efecto de instalaci@'on

source: The effect of installation
es: El efecto de instalaci@'on

source: You can see the effect of installing @code{multiply-by-seven} by evaluating the following sample. Place the cursor after the following expression and type @kbd{C-x C-e}. The number 21 will appear in the echo area.
es: Se puede ver el efecto de instalar @code{multiply-by-seven} evaluando el siguiente ejemplo. Localiza el cursor despu@'es de la siguiente expresi@'on y escribe @kbd{C-x C-e}. El n@'umero 21 aparacer@'a en el @'area echo.

source: If you wish, you can read the documentation for the function by typing @kbd{C-h f} (@code{describe-function}) and then the name of the function, @code{multiply-by-seven}. When you do this, a @file{*Help*} window will appear on your screen that says:
es: Si lo desea, se puede leer la documentaci@'on para la funci@'on escribiendo @kbd{C-h f} (@code{describe-function}) y entonces el nombre de la funci@'on, @code{multiply-by-seven}. Cuando haces esto, una ventana @file{*Help*} aparecer@'a en tu pantalla que dice:

source: multiply-by-seven is a Lisp function. (multiply-by-seven NUMBER)
es: multiply-by-seven es una funci@'on Lisp. (multiply-by-seven NUMBER)

source: Multiply NUMBER by seven.
es: Multiplicar NUMERO por siete.

source: (To return to a single window on your screen, type @kbd{C-x 1}.)
es: (Para devolver a una ventana simple en tu pantalla, escribe @kbd{C-x 1}.)

source: Change a Function Definition
es: Cambiar una definici@'on de funci@'on

source: Changing a function definition
es: Cambiando una definici@'on de funci@'on

source: Function definition, how to change
es: Definici@'on de Funci@'on, como cambiar

source: Definition, how to change
es: Definici@'on, c@'omo cambiar

source: If you want to change the code in @code{multiply-by-seven}, just rewrite it. To install the new version in place of the old one, evaluate the function definition again. This is how you modify code in Emacs. It is very simple.
es: Si se quiere cambiar al c@'odigo en @code{multiply-by-seven}, solo reescr@'{@dotless{i}}belo. Para instalar la nueva versi@'on en lugar de la vieja, eval@'ua la definici@'on de la funci@'on de nuevo. As@'{@dotless{i}}, s@'e c@'omo modificar el c@'odigo en Emacs. Es muy simple,

source: As an example, you can change the @code{multiply-by-seven} function to add the number to itself seven times instead of multiplying the number by seven. It produces the same answer, but by a different path. At the same time, we will add a comment to the code; a comment is text that the Lisp interpreter ignores, but that a human reader may find useful or enlightening. The comment is that this is the ``second version''.
es: Por ejemplo, se puede cambiar la funci@'on @code{multiply-by-seven} a@~nade el n@'umero por s@'{@dotless{i}} mismo siete veces en vez de multiplicar el n@'umero por siete. Eso produce la misma respuesta, pero por una ruta diferente. Al mismo tiempo, a@~nadiremos un comentario; un comentario es texto que el int@'erprete Lisp ignora, pero un lector humano puede encontrar @'util o iluminante. El comentario es que esto es la ``segunda versi@'on''.

source: (defun multiply-by-seven (number) ; @r{Second version.} "Multiply NUMBER by seven." (+ number number number number number number number))
es: (defun multiply-by-seven (number) ; @r{Segunda versi@'on.} "Multiplicar NUMERO por siete." (+ number number number number number number number))

source: Comments in Lisp code
es: Comentarios en C@'odigo Lisp

source: The comment follows a semicolon, @samp{;}. In Lisp, everything on a line that follows a semicolon is a comment. The end of the line is the end of the comment. To stretch a comment over two or more lines, begin each line with a semicolon.
es: El comentario sigue por un punto y coma, @samp{;}. En Lisp cada cosa en una l@'{@dotless{i}}nea sigue un punto y coma que es un comentario. El final de la l@'{@dotless{i}}nea es el fin del comentario. Para estrechar un comentario a trav@'es de dos o m@'as l@'{@dotless{i}}neas, empieza cada l@'{@dotless{i}}nea con un punto y coma.

source: @xref{Beginning a .emacs File, , Beginning a @file{.emacs} File}, and @ref{Comments, , Comments, elisp, The GNU Emacs Lisp Reference Manual}, for more about comments.
es: @xref{Empezando un fichero .emacs, , Empezando un Fichero @file{.emacs}}, y @ref{Comentarios, , Comentarios, elisp, El Manual de Referencia de GNU Emacs Lisp}, para m@'as comentarios.

source: You can install this version of the @code{multiply-by-seven} function by evaluating it in the same way you evaluated the first function: place the cursor after the last parenthesis and type @kbd{C-x C-e}.
es: Se puede instalar esta versi@'on de la funci@'on @code{multiply-by-seven} para evalu@'andolo en el mismo camino que se evalu@'o la primera funci@'on: deja el cursor despu@'es de los @'ultimos par@'entesis y escribe @kbd{C-x C-e}.

source: In summary, this is how you write code in Emacs Lisp: you write a function; install it; test it; and then make fixes or enhancements and install it again.
es: En resumen, esto es c@'omo se escribe c@'odigo en Emacs Lisp: tu escribes una funci@'on; se instala; se testea; y entonces crea arreglos y mejoras e inst@'alalas de nuevo.

source: Interactive functions
es: Funciones Interactivas

source: You make a function interactive by placing a list that begins with the special form @code{interactive} immediately after the documentation. A user can invoke an interactive function by typing @kbd{M-x} and then the name of the function; or by typing the keys to which it is bound, for example, by typing @kbd{C-n} for @code{next-line} or @kbd{C-x h} for @code{mark-whole-buffer}.
es: Se crea una funci@'on interactive emplazando una lista que empieza con la forma especial @code{interactive} inmediatamente despu@'es de la documentaci@'on. Un usuario puede invocar una funci@'on interactive escribiendo @kbd{M-x} y entonces el nombre de la funci@'on; o escribiendo las teclas para el que est@'a emparejado, por ejemplo, escribiendo @kbd{C-n} para @code{next-line} o @kbd{C-x h} para @code{mark-whole-buffer}.

source: Interestingly, when you call an interactive function interactively, the value returned is not automatically displayed in the echo area. This is because you often call an interactive function for its side effects, such as moving forward by a word or line, and not for the value returned. If the returned value were displayed in the echo area each time you typed a key, it would be very distracting.
es: De manera interesante, cuando se llama a una funci@'on interactive interactivamente, el valor devuelto no est@'a autom@'aticamente mostrado en el @'area echo. Esto es porque con frecuencia se llama a una funci@'on interactive para sus efectos laterales, tales como mover hacia adelante por una palabra o l@'{@dotless{i}}nea, y no para el valor devuelto. Si el valor devuelto fuera mostrado en el @'area echo cada vez que escribiste una tecla, distraer@'{@dotless{i}}a mucho

source: An Interactive @code{multiply-by-seven}, An Overview
es: Un @code{multiply-by-seven} interactivo, Un resumen

source: Both the use of the special form @code{interactive} and one way to display a value in the echo area can be illustrated by creating an interactive version of @code{multiply-by-seven}.
es: Tanto el uso de la forma especial @code{interactive} y un camino para mostrar un valor en el @'area echo puede ser ilustrada creando una versi@'on interactiva de @code{multiply-by-seven}.

source: Here is the code:
es: Aqu@'{@dotless{i}} est@'a el c@'odigo:

source: (defun multiply-by-seven (number) ; @r{Interactive version.} "Multiply NUMBER by seven." (interactive "p") (message "The result is %d" (* 7 number)))
es: (defun multiply-by-seven (number) ; @r{Versi@'on Interactiva.} "Multiplicar NUMERO por siete." (interactive "p") (message "El resultado es %d" (* 7 number)))

source: You can install this code by placing your cursor after it and typing @kbd{C-x C-e}. The name of the function will appear in your echo area. Then, you can use this code by typing @kbd{C-u} and a number and then typing @kbd{M-x multiply-by-seven} and pressing @key{RET}. The phrase @samp{The result is @dots{}} followed by the product will appear in the echo area.
es: Se puede instalar este c@'odigo emplazando tu cursor despu@'es y escribiendo @kbd{C-x C-e}. El nombre de la funci@'on aparecer@'a en tu @'area echo. Entonces, se puede usar este c@'odigo escribiendo @kbd{C-u} y un n@'umero y entonces escribiendo @kbd{M-x multiply-by-seven} y presionando @key{RET}. La frase @samp{El resultado es @dots{}} seguido por el producto aparecer@'a en el @'area echo

source: Speaking more generally, you invoke a function like this in either of two ways:
es: Hablando m@'as generalmente, se puede invocar a una funci@'on como @'esta de dos maneras:

source: By typing a prefix argument that contains the number to be passed, and then typing @kbd{M-x} and the name of the function, as with @kbd{C-u 3 M-x forward-sentence}; or,
es: Escribir un argumento prefijo que contiene el n@'umero a ser pasado, y entonces escribir @kbd{M-x} y el nombre de la funci@'on, como con @kbd{C-u 3 M-x forward-sentence}; o,

source: By typing whatever key or keychord the function is bound to, as with @kbd{C-u 3 M-e}.
es: Escribe siempre de modo que la tecla/s de la funci@'on est@'en emparejadas, como con @kbd{C-u 3 M-e}.

source: Both the examples just mentioned work identically to move point forward three sentences. (Since @code{multiply-by-seven} is not bound to a key, it could not be used as an example of key binding.)
es: Ambos ejemplos solo trabajan mencionados id@'enticamente para mover puntos hacia adelantes tres frases. (Desde @code{multiply-by-seven} no est@'a emparejado a una tecla, eso no podr@'{@dotless{i}}a ser usado como un ejemplo de emparejar la tecla.

source: (@xref{Keybindings, , Some Keybindings}, to learn how to bind a command to a key.)
es: (@xref{Atajos de teclado, , Algunos Atajos de Teclas}, para aprender como emparejar un comando a una tecla.)

source: A prefix argument is passed to an interactive function by typing the @key{META} key followed by a number, for example, @kbd{M-3 M-e}, or by typing @kbd{C-u} and then a number, for example, @kbd{C-u 3 M-e} (if you type @kbd{C-u} without a number, it defaults to 4).
es: Un argumento prefijo est@'a pasado para una funci@'on interactive escribiendo la tecla @key{META} seguido por un n@'umero, por ejemplo, @kbd{M-3 M-e}, o escribiendo @kbd{C-u} y entonces un n@'umero, por ejemplo, @kbd{C-u 3 M-e} (si se escribe @kbd{C-u} sin un n@'umero, por defecto a 4).

source: An Interactive @code{multiply-by-seven}
es: Un @code{multiply-by-seven} interactivo

source: Let's look at the use of the special form @code{interactive} and then at the function @code{message} in the interactive version of @code{multiply-by-seven}. You will recall that the function definition looks like this:
es: Permite mirar el uso de la forma especial @code{interactive} y entonces en la funci@'on @code{message} en la versi@'on interactiva de @code{multiply-by-seven}. Se volver@'a a llamar que la definici@'on funci@'on se ve as@'{@dotless{i}}:

source: In this function, the expression, @code{(interactive "p")}, is a list of two elements. The @code{"p"} tells Emacs to pass the prefix argument to the function and use its value for the argument of the function.
es: En esta funci@'on, la expresi@'on, @code{(interactive "p")}, es una lista de dos elementos. El @code{"p"} cuenta Emacs a pasar el argumento prefijo a la funci@'on y usar su valor para el argumento de la funci@'on.

source: The argument will be a number. This means that the symbol @code{number} will be bound to a number in the line:
es: El argumento ser@'a un n@'umero. Esto significa que el s@'{@dotless{i}}mbolo @code{number} ser@'a asociado a un n@'umero en la l@'{@dotless{i}}nea:

source: (message "The result is %d" (* 7 number))
es: (message "El resultado es %d" (* 7 number))

source: For example, if your prefix argument is 5, the Lisp interpreter will evaluate the line as if it were:
es: Por ejemplo, si tu argumento prefijo es 5, el int@'erprete Lisp evaluar@'a la l@'{@dotless{i}}nea como si fuera:

source: (message "The result is %d" (* 7 5))
es: (message "El resultado es %d" (* 7 5))

source: (If you are reading this in GNU Emacs, you can evaluate this expression yourself.) First, the interpreter will evaluate the inner list, which is @code{(* 7 5)}. This returns a value of 35. Next, it will evaluate the outer list, passing the values of the second and subsequent elements of the list to the function @code{message}.
es: (Si est@'a leyendo esto en GNU Emacs, se puede evaluar esta expresi@'on por s@'{@dotless{i}} misma.) Primera, el int@'erprete evaluar@'a la lista interna, que es @code{(* 7 5)}. Esto devuelve un valor de 35. Lo siguiente, evaluar@'a la lista externa, pasando los valores de la segunda y subsiguientes elementos de la lista a la funci@'on @code{message}.
