Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Besides a @code{while} loop, you can work on each of a list of files with recursion. A recursive version of @code{lengths-list-many-files} is short and simple.
es: Bajo un bucle @code{while}, se puede trabajar cada lista de ficheros con recursi@'on. Una versi@'on recursiva de @code{lengths-list-many-files} es corta y simple.

source: The recursive function has the usual parts: the `do-again-test', the `next-step-expression', and the recursive call. The `do-again-test' determines whether the function should call itself again, which it will do if the @code{list-of-files} contains any remaining elements; the `next-step-expression' resets the @code{list-of-files} to the @sc{cdr} of itself, so eventually the list will be empty; and the recursive call calls itself on the shorter list. The complete function is shorter than this description!
es: La funci@'on recursiva tiene las partes normales: el `do-again-test', la `next-step-expression', y la llamada recursiva. El `do-again-test' determina si la funci@'on se llamar@'{@dotless{i}}a, que har@'a si la @code{list-of-files} contiene los elementos que permanecen; la `next-step-expression' resetea el @code{list-of-files} al @sc{cdr} en s@'{@dotless{i}}, as@'{@dotless{i}} finalmente la lista ser@'a vac@'{@dotless{i}}a; y la llamada recursiva llama en s@'{@dotless{i}} a la lista ordenada. @exclamdown{}La funci@'on completa est@'a ordenada por esta descripci@'on!

source: (defun recursive-lengths-list-many-files (list-of-files) "Return list of lengths of each defun in LIST-OF-FILES." (if list-of-files ; @r{do-again-test} (append (lengths-list-file (expand-file-name (car list-of-files))) (recursive-lengths-list-many-files (cdr list-of-files)))))
es: (defun recursive-lengths-list-many-files (list-of-files) "Devuelve la lista de tama@~nos de cada defun en LIST-OF-FILES." (if list-of-files ; @r{do-again-test} (append (lengths-list-file (expand-file-name (car list-of-files))) (recursive-lengths-list-many-files (cdr list-of-files)))))

source: In a sentence, the function returns the lengths' list for the first of the @code{list-of-files} appended to the result of calling itself on the rest of the @code{list-of-files}.
es: En una frase, la funci@'on devuelve de tama@~nos de la lista para la el primero de la @code{list-of-files} al resultado de llamarse as@'{@dotless{i}} mismo al resto de @code{list-of-files}.

source: Here is a test of @code{recursive-lengths-list-many-files}, along with the results of running @code{lengths-list-file} on each of the files individually.
es: Aqu@'{@dotless{i}} hay un test @code{recursive-lengths-list-many-files}, a lo largo de los resultados de ejecutar @code{lengths-list-file} en cada uno de los ficheros individualmente.

source: Install @code{recursive-lengths-list-many-files} and @code{lengths-list-file}, if necessary, and then evaluate the following expressions. You may need to change the files' pathnames; those here work when this Info file and the Emacs sources are located in their customary places. To change the expressions, copy them to the @file{*scratch*} buffer, edit them, and then evaluate them.
es: Instala @code{recursive-lengths-list-many-files} y @code{lengths-list-file}, si es necesario, y entonces eval@'ua las siguientes expresiones. Se puede necesitar cambiar las rutas de ficheros; aqu@'{@dotless{i}} se trabaja cuando este fichero Info y las fuentes de Emacs est@'an localizadas en sus lugares personales. Para cambiar las expresiones, c@'opialas al b@'uffer @file{*scratch*}, ed@'{@dotless{i}}talos y entonces eval@'ualos.

source: The results are shown after the @samp{@result{}}. (These results are for files from Emacs version 22.1.1; files from other versions of Emacs may produce different results.)
es: Los resultados son mostrados despu@'es del @samp{@result{}}. (Estos resultados son para ficheros de Emacs versi@'on 22.1.1; ficheros desde otras versiones de Emacs puede producir diferentes resultados.)

source: The @code{recursive-lengths-list-many-files} function produces the output we want.
es: La funci@'on @code{recursive-lengths-list-many-files} produce la salida que queremos.

source: The next step is to prepare the data in the list for display in a graph.
es: El siguiente paso es preparar el dato en la lista para mostrarlo en un grafo.

source: The @code{recursive-lengths-list-many-files} function returns a list of numbers. Each number records the length of a function definition. What we need to do now is transform this data into a list of numbers suitable for generating a graph. The new list will tell how many functions definitions contain less than 10 words and symbols, how many contain between 10 and 19 words and symbols, how many contain between 20 and 29 words and symbols, and so on.
es: La funci@'on @code{recursive-lengths-list-many-files} devuelve una lista de n@'umeros. Cada n@'umero graba el tama@~no de una definici@'on de funci@'on. Lo que se necesita hacer ahora es transformar estos datos dentro de una lista de n@'umeros ajustado para generar un grafo. La nueva lista contar@'a cu@'antas definiciones de funciones contienen menos de 10 palabras y s@'{@dotless{i}}mbolos, cuantas contienen entre 10 y 19 palabras y s@'{@dotless{i}}mbolos, cu@'antas contienen entre 20 y 29 palabras y s@'{@dotless{i}}mbolos, y as@'{@dotless{i}}.

source: In brief, we need to go through the lengths' list produced by the @code{recursive-lengths-list-many-files} function and count the number of defuns within each range of lengths, and produce a list of those numbers.
es: En breve, se necesita ir a trav@'es el tama@~no de la lista producida por la funci@'on @code{recursive-lengths-list-many-files} y contar el n@'umero de defuns con cada rango de tama@~nos, y produce una lista de esto de n@'umeros.

source: Data for Display in Detail
es: Datos para mostrar en detalle

source: The Data for Display in Detail
es: El dato para mostrar en detalle

source: Based on what we have done before, we can readily foresee that it should not be too hard to write a function that `@sc{cdr}s' down the lengths' list, looks at each element, determines which length range it is in, and increments a counter for that range.
es: Basado en lo que hemos hecho antes, se prevee que no ser@'{@dotless{i}}a dif@'{@dotless{i}}cil escribir una funci@'on que `@sc{cdr}s' bajo la lista de tama@~nos, parece que cada elemento, determina que rango de tama@~nos est@'a dentro, e incrementa un contador para este rango.

source: However, before beginning to write such a function, we should consider the advantages of sorting the lengths' list first, so the numbers are ordered from smallest to largest. First, sorting will make it easier to count the numbers in each range, since two adjacent numbers will either be in the same length range or in adjacent ranges. Second, by inspecting a sorted list, we can discover the highest and lowest number, and thereby determine the largest and smallest length range that we will need.
es: Sin embargo, antes de empezar a escribir tal funci@'on, nosotros considerar@'{@dotless{i}}amos las ventajas de ordenar los tama@~nos de la lista primero, as@'{@dotless{i}} los n@'umeros son ordenados desde el m@'as peque@~no al m@'as largo. Primero, ordenando se har@'a f@'acil contar los n@'umeros en cada rango, desde dos n@'umeros adyacentes ser@'a el mismo rango del tama@~no en rangos adyacentes. Segundo, inspeccionando una lista ordenada, se puede descubrir el n@'umero mayor y menor, y esto significa determinar el rango de tama@~no mayor y menor que necesitar@'a.

source: Sorting Lists
es: Ordenando listas

source: Emacs contains a function to sort lists, called (as you might guess) @code{sort}. The @code{sort} function takes two arguments, the list to be sorted, and a predicate that determines whether the first of two list elements is ``less'' than the second.
es: Emacs contiene una funci@'on para listas ordenadas, llamadas (como se podr@'{@dotless{i}}a adivinar) @code{sort}. La funci@'on @code{sort} toma dos argumentos, la lista es ordenada, y un predicado que determina si la primera de dos elementos de lista es ``menor'' que la segunda.

source: As we saw earlier (@pxref{Wrong Type of Argument, , Using the Wrong Type Object as an Argument}), a predicate is a function that determines whether some property is true or false. The @code{sort} function will reorder a list according to whatever property the predicate uses; this means that @code{sort} can be used to sort non-numeric lists by non-numeric criteria---it can, for example, alphabetize a list.
es: Como se vi@'o antes (@pxref{Tipo incorrecto de argumento, , Usando el Tipo Incorrecto de Objeto como un Argumento}), un predicado es una funci@'on que determina si alguna propiedad es verdadera o falsa. La funci@'on @code{sort} reordenar@'a una lista de acuerdo a lo que la propiedad del predicado usa; esto significa que @code{sort} puede ser usado para ordenar listas no num@'ericas por un criterio no num@'erico --- eso puede, por ejemplo, alfabetizar una lista.

source: The @code{<} function is used when sorting a numeric list. For example,
es: La funci@'on @code{<} se usa cuando se ordena una lista num@'erica. Por ejemplo,

source: (Note that in this example, both the arguments are quoted so that the symbols are not evaluated before being passed to @code{sort} as arguments.)
es: (Note que en este ejemplo, ambos argumentos se citan as@'{@dotless{i}} que los s@'{@dotless{i}}mbolos no se eval@'uan antes de ser pasados por @code{sort} como argumentos.)

source: Sorting the list returned by the @code{recursive-lengths-list-many-files} function is straightforward; it uses the @code{<} function:
es: Ordenando la lista devuelta por la funci@'on @code{recursive-lengths-list-many-files} es honesta; eso usa la funci@'n @code{<}:

source: which produces:
es: que produce:

source: (Note that in this example, the first argument to @code{sort} is not quoted, since the expression must be evaluated so as to produce the list that is passed to @code{sort}.)
es: (Note que en este ejemplo, el primer argumento para @code{sort} no est@'a citado, desde que la expresi@'on debe ser evaluado as@'{@dotless{i}} como producir la lista que es pasada para @code{sort}.)

source: Making a List of Files
es: Creando una lista de ficheros

source: The @code{recursive-lengths-list-many-files} function requires a list of files as its argument. For our test examples, we constructed such a list by hand; but the Emacs Lisp source directory is too large for us to do for that. Instead, we will write a function to do the job for us. In this function, we will use both a @code{while} loop and a recursive call.
es: La funci@'on @code{recursive-lengths-list-many-files} requiere una lista de fichero como argumento. Para nuestros ejemplos de test, se construyeron tal como una lista a mano; pero el directorio fuente de Emacs Lisp es demasiado grande para hacer esto. As@'{@dotless{i}}, se escribir@'a una funci@'on para hacer el trabajo. En esta funci@'on, se usa tanto un bucle @code{while} como una llamada recursiva.

source: We did not have to write a function like this for older versions of GNU Emacs, since they placed all the @samp{.el} files in one directory. Instead, we were able to use the @code{directory-files} function, which lists the names of files that match a specified pattern within a single directory.
es: En viejas versiones de GNU Emacs no hizo falta tener que escribir esta funci@'on, puesto que todos los ficheros @samp{.el} en un directorio. En vez de eso, se puede ser capaz de usar la funci@'on @code{directory-files}, que lista los nombres de fichero que hay en un directorio simple.

source: However, recent versions of Emacs place Emacs Lisp files in sub-directories of the top level @file{lisp} directory. This re-arrangement eases navigation. For example, all the mail related files are in a @file{lisp} sub-directory called @file{mail}. But at the same time, this arrangement forces us to create a file listing function that descends into the sub-directories.
es: Sin embargo, las versiones reciente Emacs emplazan ficheros de Emacs Lisp en subdirectorios del directorio de alto nivel @file{lisp}. Esto facilita la navegaci@'on. Por ejemplo, todos los ficheros de correo relacionados que est@'an en el subdirectorio llamado @file{mail}. Pero al mismo tiempo, esta facilidad fuerza a crear un fichero listando la funci@'on que desciende dentro de los subdirectorios.

source: We can create this function, called @code{files-in-below-directory}, using familiar functions such as @code{car}, @code{nthcdr}, and @code{substring} in conjunction with an existing function called @code{directory-files-and-attributes}. This latter function not only lists all the filenames in a directory, including the names of sub-directories, but also their attributes.
es: Se puede crear esta funci@'on, llamada @code{files-en-below-directory}, usando funciones familiares tales como @code{car}, @code{nthcdr}, y @code{substring} en conjunci@'on con una funci@'on existente llamada @code{directory-files-and-attributes}. Esta @'ultima funci@'on no solo listas de ficheros en un directorio, incluyendo los nombres de subdirectorios, pero tambi@'en sus atributos.

source: To restate our goal: to create a function that will enable us to feed filenames to @code{recursive-lengths-list-many-files} as a list that looks like this (but with more elements):
es: Para empezar nuestro objetivo: crear una funci@'on que nos permita alimentas ficheros a @code{recursive-lengths-list-many-files} como una lista que se parece a esto (pero con m@'as elementos):

source: The @code{directory-files-and-attributes} function returns a list of lists. Each of the lists within the main list consists of 13 elements. The first element is a string that contains the name of the file---which, in GNU/Linux, may be a `directory file', that is to say, a file with the special attributes of a directory. The second element of the list is @code{t} for a directory, a string for symbolic link (the string is the name linked to), or @code{nil}.
es: La funci@'on @code{directory-files-and-attributes} devuelve una lista de listas. Cada una de las listas con la lista principal consiste de 13 elementos. El primer elemento es una cadena que contiene el nombre del fichero -- que, en GNU/Linux, puede ser un `directorio fichero', que dice, un fichero con los atributos especiales de un directorio. El segundo elemento de la lista es @code{t} para un directorio, es una cadena para el enlace simb@'olico (la cadena es el nombre enlazado), o @code{nil}.

source: For example, the first @samp{.el} file in the @file{lisp/} directory is @file{abbrev.el}. Its name is @file{/usr/local/share/emacs/22.1.1/lisp/abbrev.el} and it is not a directory or a symbolic link.
es: Por ejemplo, el primer fichero @samp{.el} en el directorio es @file{abbrev.el}. Su nombre es @file{/usr/local/share/emacs/22.1.1/lisp/abbrev.el} y no es un directorio o un enlace simb@'olico.

source: This is how @code{directory-files-and-attributes} lists that file and its attributes:
es: Esto es c@'omo @code{directory-files-and-attributes} lista este fichero y sus atributos:

source: On the other hand, @file{mail/} is a directory within the @file{lisp/} directory. The beginning of its listing looks like this:
es: Por otro lado, @file{mail/} es un directorio con el directorio @file{lisp/}. El principio del listado se parece a esto:

source: (To learn about the different attributes, look at the documentation of @code{file-attributes}. Bear in mind that the @code{file-attributes} function does not list the filename, so its first element is @code{directory-files-and-attributes}'s second element.)
es: (Para aprender acerca de los diferentes atributos, mira en la documentaci@'on de @code{file-attributes}. Tenga en mente que la funci@'on @code{file-attributes} no lista el nombre del fichero, as@'{@dotless{i}} su primer elemento es @code{directory-files-and-attributes} que es el segundo elemento.)

source: We will want our new function, @code{files-in-below-directory}, to list the @samp{.el} files in the directory it is told to check, and in any directories below that directory.
es: Se querr@'an nuestras nuevas funciones, @code{files-in-below-directory}, para listar los fichero @samp{.el} en el directorio eso es contado para chequear, y en los directorios bajo este directorio.

source: This gives us a hint on how to construct @code{files-in-below-directory}: within a directory, the function should add @samp{.el} filenames to a list; and if, within a directory, the function comes upon a sub-directory, it should go into that sub-directory and repeat its actions.
es: Esto nos da una sugesti@'on de como construir @code{files-in-below-directory}: con un directorio, la funci@'on a@~nadir los nombres de ficheros @samp{.el} a una lista; y si, con un directorio, la funci@'on viene con un subdirectorio, ir@'{@dotless{i}}a dentro de este subdirectorio y repite sus acciones.

source: However, we should note that every directory contains a name that refers to itself, called @file{.}, (``dot'') and a name that refers to its parent directory, called @file{..} (``double dot''). (In @file{/}, the root directory, @file{..} refers to itself, since @file{/} has no parent.) Clearly, we do not want our @code{files-in-below-directory} function to enter those directories, since they always lead us, directly or indirectly, to the current directory.
es: Sin embargo, nosotros notar@'{@dotless{i}}amos que cada directorio contiene un nombre que se refiere a s@'{@dotless{i}} mismo, llamado @file{.}, (``dot'') y un nombre que se refiere a su directorio padre, llamado @file{..} (``doble punto''). (En @file{/}, el directorio ra@'{@dotless{i}}z, @file{..} se refiere as@'{@dotless{i}} mismo, desde que @file{/} no tiene padre.) Claramente, no que se quiere nuestra funci@'on @code{files-in-below-directory} para introducir estos directorio, desde que ellos siempre nos lideran, directamente o indirectamente, al directorio actual.

source: Consequently, our @code{files-in-below-directory} function must do several tasks:
es: Consecuentemente, nuestra funci@'on @code{files-in-below-directory} debe hacer varias tareas:

source: Check to see whether it is looking at a filename that ends in @samp{.el}; and if so, add its name to a list.
es: Chequee para ver si se est@'a mirando en un nombre de fichero que finaliza en @samp{.el} y si es as@'{@dotless{i}}, se a@~nade el nombre a una lista.

source: Check to see whether it is looking at a filename that is the name of a directory; and if so,
es: Chequee para ver si est@'a mirando en un nombre de fichero que es el nombre de un directorio; y si es as@'{@dotless{i}},

source: Check to see whether it is looking at @file{.} or @file{..}; and if so skip it.
es: Chequee para ver si est@'a mirando en @file{.} o @file{..}; y si es as@'{@dotless{i}} sal.

source: Or else, go into that directory and repeat the process.
es: O adem@'as, ve dentro de este directorio y repite el proceso.

source: Let's write a function definition to do these tasks. We will use a @code{while} loop to move from one filename to another within a directory, checking what needs to be done; and we will use a recursive call to repeat the actions on each sub-directory. The recursive pattern is `accumulate' (@pxref{Accumulate, , Recursive Pattern: @emph{accumulate}}), using @code{append} as the combiner.
es: Se permite escribir una definici@'on de funci@'on para hacer estas tareas. Se usar@'a un bucle @code{while} para mover de un nombre de fichero a otro con un directorio chequeando lo que necesita ser hecho; y se usa una llamada recursiva para repetir las acciones en cada subdirectorio. El patr@'on recursivo es `acumular' (@pxref{Acumular, , Patr@'on recursivo: @emph{accumulate}}) usando @code{append} para combinar.

source: Here is the function:
es: Aqu@'{@dotless{i}} est@'a la funci@'on:

source: (defun files-in-below-directory (directory) "List the .el files in DIRECTORY and in its sub-directories." ;; Although the function will be used non-interactively, ;; it will be easier to test if we make it interactive. ;; The directory will have a name such as ;; "/usr/local/share/emacs/22.1.1/lisp/" (interactive "DDirectory name: ")
es: (defun files-in-below-directory (directory) "Lista los ficheros .el en DIRECTORIO y en sus subdirectorios." ;; Aunque la funci@'on ser@'a usada no interactivamente, ;; ser@'a f@'acil chequear si lo hacemos interactivo. ;; El directorio tendr@'a un nombre tal como ;; "/usr/local/share/emacs/22.1.1/lisp/" (interactive "DNombre del Directorio: ")

source: (let (el-files-list (current-directory-list (directory-files-and-attributes directory t))) ;; while we are in the current directory (while current-directory-list
es: (let (el-files-list (current-directory-list (directory-files-and-attributes directory t))) ;; mientras estamos en el directorio actual (while current-directory-list

source: (cond ;; check to see whether filename ends in `.el' ;; and if so, append its name to a list. ((equal ".el" (substring (car (car current-directory-list)) -3)) (setq el-files-list (cons (car (car current-directory-list)) el-files-list)))
es: (cond ;; chequee para ver si el nombre del fichero finaliza en `.el' ;; y si es as@'{@dotless{i}}, a@~nade su nombre a una lista. ((equal ".el" (substring (car (car current-directory-list)) -3)) (setq el-files-list (cons (car (car current-directory-list)) el-files-list)))

source: ;; check whether filename is that of a directory ((eq t (car (cdr (car current-directory-list)))) ;; decide whether to skip or recurse (if (equal "." (substring (car (car current-directory-list)) -1)) ;; then do nothing since filename is that of ;; current directory or parent, "." or ".." ()
es: ;; chequee si el nombre del fichero es un directorio ((eq t (car (cdr (car current-directory-list)))) ;; decide si salir o hacer recursi@'on (if (equal "." (substring (car (car current-directory-list)) -1)) ;; entonces no hagas nada puesto que el nombre del fichero es ;; el actual directorio o padre, "." o ".." ()

source: ;; else descend into the directory and repeat the process (setq el-files-list (append (files-in-below-directory (car (car current-directory-list))) el-files-list))))) ;; move to the next filename in the list; this also ;; shortens the list so the while loop eventually comes to an end (setq current-directory-list (cdr current-directory-list))) ;; return the filenames el-files-list))
es: ;; else desciende dentro del directorio y repite el proceso (setq el-files-list (append (files-in-below-directory (car (car current-directory-list))) el-files-list))))) ;; mueve al siguiente fichero en la lista; esto tambi@'en ;; ordena la lista as@'{@dotless{i}} mientras el bucle ;; eventualmente llega a un fin (setq current-directory-list (cdr current-directory-list))) ;; devuelve los ficheros el-files-list))

source: The @code{files-in-below-directory} @code{directory-files} function takes one argument, the name of a directory.
es: Las funciones @code{files-in-below-directory} @code{directory-files} toma un argumento, el nombre de un directorio.

source: Thus, on my system,
es: De este modo, en mi sistema,

source: tells me that in and below my Lisp sources directory are 1031 @samp{.el} files.
es: se cuenta que dentro y debajo de mi directorio de fuentes Lisp hay 1031 ficheros @samp{.el}

source: @code{files-in-below-directory} returns a list in reverse alphabetical order. An expression to sort the list in alphabetical order looks like this:
es: @code{files-in-below-directory} devuelve una lista en orden alfab@'etico inverso. Una expresi@'on para ordenar la lista en orden que parece como este:
