Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: You can see the consequences of doing this if you evaluate the following version of the @code{type-of-animal} function definition to install it and then evaluate the two subsequent expressions to pass different arguments to the function.
es: Se puede ver las consecuencias de hacer esto si se eval@'ua la siguiente versi@'on de la definici@'on de funci@'on @code{type-of-animal} (@emph{tipo-de-animal}) para instalarlo y entonces evaluar las dos expresiones subsiguientes para pasar diferentes argumentos para la funci@'on.

source: (defun type-of-animal (characteristic) ; @r{Second version.} "Print message in echo area depending on CHARACTERISTIC. If the CHARACTERISTIC is the symbol `fierce', then warn of a tiger; else say it's not fierce." (if (equal characteristic 'fierce) (message "It's a tiger!") (message "It's not fierce!")))
es: (defun tipo-de-animal (caracteristica) ; @r{Segunda versi@'on.} "Imprime el mensaje en el @'area echo dependiendo de CARACTERISTICA. Si la CARACTERISTICA es el s@'{@dotless{i}}mbolo `fiera', entonces avisa de un tigre; sino di que no es una fiera." (if (equal caracteristica 'fiera) (message "@exclamdown{}Es un tigre!") (message "@exclamdown{}No es una fiera!")))

source: When you evaluate @code{(type-of-animal 'fierce)}, you will see the following message printed in the echo area: @code{"It's a tiger!"}; but when you evaluate @code{(type-of-animal 'zebra)}, you will see @code{"It's not fierce!"}.
es: Cuando se eval@'ua @code{(tipo-de-animal 'fiera)}, se ver@'a el siguiente mensaje impreso en el @'area echo: @code{"@exclamdown{}Eso es un tigre!"}; pero cuando se eval@'ua @code{(tipo-de-animal 'cebra)}, se ver@'a @code{"@exclamdown{}No es una fiera!"}.

source: (Of course, if the @var{characteristic} were @code{ferocious}, the message @code{"It's not fierce!"} would be printed; and it would be misleading! When you write code, you need to take into account the possibility that some such argument will be tested by the @code{if} and write your program accordingly.)
es: (De acuerdo, si la @var{caracter@'{@dotless{i}}stica} fuera @code{feroz}, el mensaje @code{"@exclamdown{}No es una fiera!"} ser@'{@dotless{i}}a impreso; @exclamdown{}y ser@'{@dotless{i}}a err@'oneo! Cuando se escribe c@'odigo, se necesita tener en cuenta la posibilidad que algunos argumentos ser@'a probado por @code{if} @emph{si} y escribir tu programa de acuerdo.

source: Truth and falsehood in Emacs Lisp
es: Verdad y mentira en Emacs Lisp

source: Falsehood and truth in Emacs Lisp
es: Falsedad y verdad en Emacs Lisp

source: There is an important aspect to the truth test in an @code{if} expression. So far, we have spoken of `true' and `false' as values of predicates as if they were new kinds of Emacs Lisp objects. In fact, `false' is just our old friend @code{nil}. Anything else---anything at all---is `true'.
es: Hay un aspecto importante para el test de verdad en una expresi@'on @code{if} (@emph{si}). As@'{@dotless{i}}, hemos hablado de `verdad' y `mentira' como valores de predicados como si fueran nuevos tipos de objetos Emacs Lisp. En efecto, `falso' es solo nuestro viejo amigo @code{nil}. Cualquier otra es `verdadero'.

source: The expression that tests for truth is interpreted as @dfn{true} if the result of evaluating it is a value that is not @code{nil}. In other words, the result of the test is considered true if the value returned is a number such as 47, a string such as @code{"hello"}, or a symbol (other than @code{nil}) such as @code{flowers}, or a list (so long as it is not empty), or even a buffer!
es: La expresi@'on chequea si verdad se interpreta como (@dfn{true}) @emph{verdadero} si el resultado de evaluarlo es un valor que no es @code{nil}. En otras palabras, el resultado del test se considera cierto si el valor devuelto es un n@'umero como 47, una cadena tal como @code{"hola"}, o un s@'{@dotless{i}}mbolo (otro como @code{nil}) tal como @code{flores}, o una lista (tan larga como eso no est@'a vac@'{@dotless{i}}a) @exclamdown{}o incluso un b@'uffer!

source: An explanation of @code{nil}
es: Una explicaci@'on de @code{nil}

source: Before illustrating a test for truth, we need an explanation of @code{nil}.
es: Antes de ilustrar un test para verdad, se necesita una explicaci@'on de @code{nil}.

source: In Emacs Lisp, the symbol @code{nil} has two meanings. First, it means the empty list. Second, it means false and is the value returned when a true-or-false-test tests false. @code{nil} can be written as an empty list, @code{()}, or as @code{nil}. As far as the Lisp interpreter is concerned, @code{()} and @code{nil} are the same. Humans, however, tend to use @code{nil} for false and @code{()} for the empty list.
es: En Emacs Lisp, el s@'{@dotless{i}}mbolo @code{nil} tiene dos significados. Primero, est@'a el significado de la lista vac@'{@dotless{i}}a. Segundo, est@'a el valor de falso y es el valor devuelto cuando el test test-verdadero-o-falso salga falso. @code{nil}. Tan lejos como el int@'erprete Lisp es concebido, @code{()} y @code{nil} son el mismo. Los humanos, sin embargo, tienden a usar @code{nil} para falso y @code{()} para la lista vac@'{@dotless{i}}a.

source: In Emacs Lisp, any value that is not @code{nil}---is not the empty list---is considered true. This means that if an evaluation returns something that is not an empty list, an @code{if} expression will test true. For example, if a number is put in the slot for the test, it will be evaluated and will return itself, since that is what numbers do when evaluated. In this conditional, the @code{if} expression will test true. The expression tests false only when @code{nil}, an empty list, is returned by evaluating the expression.
es: En Emacs Lisp, cualquier valor que no es @code{nil} --- no es una lista vac@'{@dotless{i}}a --- es considerado verdad. Esto significa que si una evaluaci@'on devuelve alguna cosa que no es una lista vac@'{@dotless{i}}a, una expresi@'on @code{if} devuelve verdad. Por ejemplo, si un n@'umero es puesto en el slot para el test, ser@'a evaluado y devolver@'a por s@'{@dotless{i}} mismo, desde lo que hacen los n@'umeros cuando se eval@'uan. En este condicional, la expresi@'on @code{if} devuelve verdad. La expresi@'on se chequea como falso solo cuando @code{nil}, una lista vac@'{@dotless{i}}a, es devuelta evaluando la expresi@'on.

source: You can see this by evaluating the two expressions in the following examples.
es: Se puede ver esto evaluando las dos expresiones en los siguientes ejemplos.

source: In the first example, the number 4 is evaluated as the test in the @code{if} expression and returns itself; consequently, the then-part of the expression is evaluated and returned: @samp{true} appears in the echo area. In the second example, the @code{nil} indicates false; consequently, the else-part of the expression is evaluated and returned: @samp{false} appears in the echo area.
es: En el primer ejemplo, n@'umero 4 es evaluado como el test en la expresi@'on @code{if} y se devuelve por s@'{@dotless{i}} mismo; por consiguiente, la then-part de la expresi@'on es evaluada y devuelta: @samp{true} aparece en el @'area echo. En el segundo ejemplo, @code{nil} indica falso; por consiguiente, el else-part de la expresi@'on es evaluada y devuelta: @samp{false} aparece en el @'area echo.

source: Incidentally, if some other useful value is not available for a test that returns true, then the Lisp interpreter will return the symbol @code{t} for true. For example, the expression @code{(> 5 4)} returns @code{t} when evaluated, as you can see by evaluating it in the usual way:
es: Incidentalmente, si alg@'un otro valor @'util no est@'a disponible para un test que devuelve cierto, entonces el int@'erprete Lisp retornar@'a el s@'{@dotless{i}}mbolo @code{t} para cierto. Por ejemplo, la expresi@'on @code{(> 5 4)} devuelve @code{t} cuando se eval@'ua, como puedes ver evalu@'andolo en el camino usual:

source: On the other hand, this function returns @code{nil} if the test is false.
es: Por otro lado, esta funci@'on devuelve @code{nil} si el test es falso.

source: Region, what it is
es: Regi@'on, qu@'e es

source: Preserving point, mark, and buffer
es: Preservando punto, marca, y b@'uffer

source: Point, mark, buffer preservation
es: Punto, marca, preservaci@'on de b@'uffer

source: point
es: punto

source: mark
es: marca

source: The @code{save-excursion} function is the fourth and final special form that we will discuss in this chapter.
es: La funci@'on @code{save-excursion} es la cuarta y @'ultima forma especial que se discutir@'a en este cap@'{@dotless{i}}tulo.

source: In Emacs Lisp programs used for editing, the @code{save-excursion} function is very common. It saves the location of point and mark, executes the body of the function, and then restores point and mark to their previous positions if their locations were changed. Its primary purpose is to keep the user from being surprised and disturbed by unexpected movement of point or mark.
es: En Emacs Lisp hay programas usados para edici@'on, la funci@'on @code{save-excursion} es muy com@'un. Eso guarda la posici@'on de punto y marca, ejecuta el cuerpo de la funci@'on, y entonces restaura el punto y marca a sus posiciones previas si sus posiciones fueran cambiadas. Su prop@'osito primario es guardar que el usuario sea sorprendido y molesto por movimientos inesperados de punto y marca.

source: Point and Mark
es: Punto y Marca

source: Before discussing @code{save-excursion}, however, it may be useful first to review what point and mark are in GNU Emacs. @dfn{Point} is the current location of the cursor. Wherever the cursor is, that is point. More precisely, on terminals where the cursor appears to be on top of a character, point is immediately before the character. In Emacs Lisp, point is an integer. The first character in a buffer is number one, the second is number two, and so on. The function @code{point} returns the current position of the cursor as a number. Each buffer has its own value for point.
es: Antes de discutir @code{save-excursion}, sin embargo, puede ser @'util primero revisar que punto y marca est@'an en GNU Emacs. @dfn{Punto} es la posici@'on actual del cursor. En cualquier lugar que el cursor se posicione hay un punto. De manera m@'as precisa, en terminales donde el cursor parece estar en lo alto de un car@'acter, el punto est@'a inmediatamente antes del car@'acter. En Emacs Lisp, punto es un entero. El primer car@'acter en un b@'uffer es el n@'umero uno, el segundo es el n@'umero dos, y as@'{@dotless{i}}. La funci@'on @code{punto} devuelve la posici@'on actual del cursor como un n@'umero. Cada b@'uffer tiene su propio valor para el punto.

source: The @dfn{mark} is another position in the buffer; its value can be set with a command such as @kbd{C-@key{SPC}} (@code{set-mark-command}). If a mark has been set, you can use the command @kbd{C-x C-x} (@code{exchange-point-and-mark}) to cause the cursor to jump to the mark and set the mark to be the previous position of point. In addition, if you set another mark, the position of the previous mark is saved in the mark ring. Many mark positions can be saved this way. You can jump the cursor to a saved mark by typing @kbd{C-u C-@key{SPC}} one or more times.
es: La @dfn{marca} es otra posici@'on en el b@'uffer; su valor puede ser asignado con un comando tal como @kbd{C-@key{SPC}} (@code{set-mark-command}). Si una marca ha sido asignada, se puede usar el comando @kbd{C-x C-x} (@code{exchange-point-and-mark}) para hacer que el cursor salte a la marca y asignar la marca para la posici@'on previa del punto. Adem@'as, si tu asignas otra marca, la posici@'on puede ser guardada por este camino. Se puede saltar al cursor para una marca guardada escribiendo @kbd{C-u C-@key{SPC}} una o m@'as veces.

source: The part of the buffer between point and mark is called @dfn{the region}. Numerous commands work on the region, including @code{center-region}, @code{count-lines-region}, @code{kill-region}, and @code{print-region}.
es: La parte del b@'uffer entre el punto y la marca es llamada @dfn{la regi@'on}. Numerosos comandos trabajan en la regi@'on, incluyendo @code{center-region}, @code{count-lines-region}, @code{kill-region} y @code{print-region}.

source: The @code{save-excursion} special form saves the locations of point and mark and restores those positions after the code within the body of the special form is evaluated by the Lisp interpreter. Thus, if point were in the beginning of a piece of text and some code moved point to the end of the buffer, the @code{save-excursion} would put point back to where it was before, after the expressions in the body of the function were evaluated.
es: La forma especial @code{save-excursion} salva las posiciones del punto y la marca y restaura estas posiciones despu@'es del c@'odigo con el cuerpo de la forma especial es evaluada por el int@'erprete Lisp. De este modo, si el punto fuera en el principio de una pieza de texto y alg@'un c@'odigo movido apunta al fin del b@'uffer, el @code{save-excursion} no apuntar@'{@dotless{i}}a a donde fu@'e antes, despu@'es las expresiones en el cuerpo de las que fueron evaluadas.

source: In Emacs, a function frequently moves point as part of its internal workings even though a user would not expect this. For example, @code{count-lines-region} moves point. To prevent the user from being bothered by jumps that are both unexpected and (from the user's point of view) unnecessary, @code{save-excursion} is often used to keep point and mark in the location expected by the user. The use of @code{save-excursion} is good housekeeping.
es: En Emacs, una funci@'on frecuentemente mueve el punto como parte de sus trabajos internos incluso aunque un usuario no espere esto. Por ejemplo, @code{count-lines-region} se mueve al punto. Para prevenir al usuario que se preocupe por el salto que es inesperado y (desde el punto de vista del usuario) innecesario, @code{save-excursion} es con frecuencia usado para punto y marca en la posici@'on esperada por el usuario. El uso de @code{save-excursion} es un buen guarda casas.

source: To make sure the house stays clean, @code{save-excursion} restores the values of point and mark even if something goes wrong in the code inside of it (or, to be more precise and to use the proper jargon, ``in case of abnormal exit''). This feature is very helpful.
es: Para estar seguro que la casa est@'a limpia, @code{save-excursion} restaura los valores de punto y marca incluso si alguna cosa va mal en el c@'odigo dentro de eso (o, para ser m@'as preciso y usar la jerga apropiada, ``en caso de salida anormal''). Esta funcionalidad es muy @'util.

source: In addition to recording the values of point and mark, @code{save-excursion} keeps track of the current buffer, and restores it, too. This means you can write code that will change the buffer and have @code{save-excursion} switch you back to the original buffer. This is how @code{save-excursion} is used in @code{append-to-buffer}. (@xref{append-to-buffer, , The Definition of @code{append-to-buffer}}.)
es: Adem@'as grabando los valores de punto y marca, @code{save-excursion} guarda la traza del actual buffer, y lo restaura, tambi@'en. Esto significa que puedes escribir c@'odigo que cambiar@'a el buffer y tener que @code{save-excursion} vuelva al buffer original. Esto es como @code{save-excursion} es usado en @code{append-to-buffer}. (@xref{append-to-buffer, , La Definici@'on de @code{append-to-buffer}}.)

source: Template for a @code{save-excursion} Expression
es: Plantilla para una expresi@'on @code{save-excursion}

source: The template for code using @code{save-excursion} is simple:
es: La plantilla para c@'odigo usando @code{save-excursion} es simple:

source: The body of the function is one or more expressions that will be evaluated in sequence by the Lisp interpreter. If there is more than one expression in the body, the value of the last one will be returned as the value of the @code{save-excursion} function. The other expressions in the body are evaluated only for their side effects; and @code{save-excursion} itself is used only for its side effect (which is restoring the positions of point and mark).
es: El cuerpo de la funci@'on es una o m@'as expresiones que ser@'an evaluadas en secuencia por el int@'erprete Lisp. Si hay m@'as de una expresi@'on en el cuerpo, el valor de la @'ultima ser@'a devuelto como el valor de la funci@'on @code{save-excursion}. Las otras expresiones en el cuerpo son evaluadas solo por sus efectos laterales; y @code{save-excursion} en s@'{@dotless{i}} es usado solo por su efecto lateral (que est@'a restaurando las posiciones de punto y marca).

source: In more detail, the template for a @code{save-excursion} expression looks like this:
es: Para m@'as detalles, la siguiente plantilla explica @code{save-excursion}

source: (save-excursion @var{first-expression-in-body} @var{second-expression-in-body} @var{third-expression-in-body} @dots{} @var{last-expression-in-body})
es: (save-excursion @var{primera-expresion-en-el-cuerpo} @var{segunda-expresion-en-el-cuerpo} @var{tercera-expresion-en-el-cuerpo} @dots{} @var{ultima-expresion-en-el-cuerpo})

source: An expression, of course, may be a symbol on its own or a list.
es: Una expresi@'on, de acuerdo, puede ser un s@'{@dotless{i}}mbolo por s@'{@dotless{i}} mismo o una lista.

source: In Emacs Lisp code, a @code{save-excursion} expression often occurs within the body of a @code{let} expression. It looks like this:
es: En c@'odigo Emacs Lisp, una expresi@'on @code{save-excursion} con frecuencia ocurre el cuerpo de una expresi@'on @code{let}. Eso se ve como esto:

source: Review
es: Revisar

source: In the last few chapters we have introduced a fair number of functions and special forms. Here they are described in brief, along with a few similar functions that have not been mentioned yet.
es: En los @'ultimos pocos cap@'{@dotless{i}}tulos se han introducido un n@'umero limpio de funciones y formas especiales. Aqu@'{@dotless{i}} se han descrito brevemente, con unas pocas funciones similares que no han sido mencionadas todav@'{@dotless{i}}a.

source: Evaluate the last symbolic expression before the current location of point. The value is printed in the echo area unless the function is invoked with an argument; in that case, the output is printed in the current buffer. This command is normally bound to @kbd{C-x C-e}.
es: Eval@'ua la @'ultima expresi@'on simb@'olica antes de la posici@'on actual del punto. El valor es impreso en el @'area echo a menos que la funci@'on sea invocada con un argumento; en este caso, la salida es impresa en el actual b@'uffer. Este comando est@'a normalmente asociado a @kbd{C-x C-e}.

source: Define function. This special form has up to five parts: the name, a template for the arguments that will be passed to the function, documentation, an optional interactive declaration, and the body of the definition.
es: Definir funci@'on. Esta forma especial ha subido a cinco partes: el nombre una plantilla para los argumentos que ser@'an pasados a la documentaci@'on de la funci@'on, una declaraci@'on interactiva opcional, y el cuerpo de la definici@'on.

source: For example, in an early version of Emacs, the function definition was as follows. (It is slightly more complex now that it seeks the first non-whitespace character rather than the first visible character.)
es: Por ejemplo, en las primeras versiones de Emacs, la definici@'on de funci@'on era como sigue. (Eso es ligeramente m@'as complejo ahora que si busca el primer caracter de espacio no en blanco en vez del primer caracter visible.)

source: (defun back-to-indentation () "Move point to first visible character on line." (interactive) (beginning-of-line 1) (skip-chars-forward " \t"))
es: (defun volver-a-indentacion () "Mover el punto al primer caracter visible en linea." (interactive) (beginning-of-line 1) (skip-chars-forward " \t"))

source: Declare to the interpreter that the function can be used interactively. This special form may be followed by a string with one or more parts that pass the information to the arguments of the function, in sequence. These parts may also tell the interpreter to prompt for information. Parts of the string are separated by newlines, @samp{\n}.
es: Declara al int@'erprete que la funci@'on puede ser usada interactivamente. Esta forma especial puede ser seguida por una cadena con una o m@'as partes que pasan la informaci@'on a los argumentos de la funci@'on, en secuencia. Estas partes pueden tambi@'en contar al int@'erprete para mostrar la informaci@'on. Parte de las cadenas son separadas por nuevas l@'{@dotless{i}}neas, @samp{\n}.

source: Common code characters are:
es: Caracteres de c@'odigo com@'un son:

source: The name of an existing buffer.
es: El nombre de un b@'uffer existente.

source: The name of an existing file.
es: El nombre de un fichero existente

source: The numeric prefix argument. (Note that this `p' is lower case.)
es: El argumento prefijo num@'erico. (N@'otese que esta `p' es min@'uscula.)

source: Point and the mark, as two numeric arguments, smallest first. This is the only code letter that specifies two successive arguments rather than one.
es: El Punto y la marca, como dos argumentos num@'ericos, el m@'as peque@~no primero. Esta es la @'unica letra que especifica dos argumentos sucesivos en vez de uno.

source: @xref{Interactive Codes, , Code Characters for @samp{interactive}, elisp, The GNU Emacs Lisp Reference Manual}, for a complete list of code characters.
es: @xref{C@'odigos Interactivos, , Caracteres de C@'odigo para @samp{interactive}, elisp, El Manual de Referencia de GNU Emacs Lisp}, para una lista de caracteres de c@'odigo.

source: Declare that a list of variables is for use within the body of the @code{let} and give them an initial value, either @code{nil} or a specified value; then evaluate the rest of the expressions in the body of the @code{let} and return the value of the last one. Inside the body of the @code{let}, the Lisp interpreter does not see the values of the variables of the same names that are bound outside of the @code{let}.
es: Declara que una lista de variables es para usarla con el cuerpo del @code{let} y darles un valor inicial, bien @code{nil} o un valor espec@'{@dotless{i}}fico; entonces se evaluar@'an el resto de las expresiones en el cuerpo del @code{let} y devolver el valor de la @'ultima. Dentro del cuerpo del @code{let}, el int@'erprete Lisp no ve los valores de las variables de los mismos nombres que son asociados fuera del @code{let}.

source: For example,
es: Por ejemplo,

source: (let ((foo (buffer-name)) (bar (buffer-size))) (message "This buffer is %s and has %d characters." foo bar))
es: (let ((foo (nombre-de-buffer)) (bar (tamagno-de-buffer))) (message "Este buffer es %s y tiene %d caracteres." foo bar))

source: Record the values of point and mark and the current buffer before evaluating the body of this special form. Restore the values of point and mark and buffer afterward.
es: Graba los valores de punto y marca y el actual b@'uffer antes de evaluar el cuerpo de esta forma especial. Restaura los valores de punto y marca y el b@'uffer despu@'es de esto.

source: (message "We are %d characters into this buffer." (- (point) (save-excursion (goto-char (point-min)) (point))))
es: (message "Hay %d caracteres dentro de este buffer." (- (point) (save-excursion (goto-char (point-min)) (point))))

source: Evaluate the first argument to the function; if it is true, evaluate the second argument; else evaluate the third argument, if there is one.
es: Eval@'ua el primer argumento a la funci@'on; si es verdad, eval@'ua el segundo argumento; lo dem@'as eval@'ua el tercer argumento, si hay uno.
