Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The function @code{1+} which adds one to its argument, is executed on @emph{each} element of the list, and a new list is returned.
es: La funci@'on @code{1+} a@~nade uno a su argumento, es ejecutada en @emph{each} de la lista, y una nueva lista es devuelta.

source: Contrast this with @code{apply}, which applies its first argument to all the remaining. (@xref{Readying a Graph, , Readying a Graph}, for a explanation of @code{apply}.)
es: En contraste con esto @code{apply}, se aplica su primer argumento a todo lo que permanece. (@xref{Leyendo un grafo, , Leyendo un grafo}, para una explicaci@'on de @code{apply}.)

source: In the definition of @code{one-fiftieth}, the first argument is the anonymous function:
es: En la definici@'on de @code{one-fiftieth}, el primer argumento es la funci@'on an@'onima:

source: and the second argument is @code{full-range}, which will be bound to @code{list-for-graph}.
es: y el segundo argumento es @code{full-range}, que ser@'a asociado para @code{list-for-graph}.

source: The whole expression looks like this:
es: La expresi@'on completa se parece a esto:

source: @xref{Mapping Functions, , Mapping Functions, elisp, The GNU Emacs Lisp Reference Manual}, for more about @code{mapcar}.
es: @xref{Funciones de Mapeo, , Mapeando Funciones, elisp, El Manual de Referencia de GNU Emacs Lisp}, para m@'as acerca de @code{mapcar}.

source: Using the @code{one-fiftieth} function, we can generate a list in which each element is one-fiftieth the size of the corresponding element in @code{list-for-graph}.
es: Usando la funci@'on @code{one-fiftieth}, se puede generar una lista en el que cada elemento es un cincuenteavo del tama@~no del correspondiente elemento en @code{list-for-graph}.

source: The resulting list looks like this:
es: La lista resultante se parece a esto:

source: This, we are almost ready to print! (We also notice the loss of information: many of the higher ranges are 0, meaning that fewer than 50 defuns had that many words or symbols---but not necessarily meaning that none had that many words or symbols.)
es: As@'{@dotless{i}}, @exclamdown{}ya estamos casi listos para imprimir! (Tambi@'en se notifica la p@'erdida de informaci@'on: muchos de los rangos superiores son 0, esto significa que menos de 50 funciones ten@'{@dotless{i}}an muchas palabras o s@'{@dotless{i}}mbolos --- pero no necesariamente significando que niguna ten@'{@dotless{i}}a muchas palabras o s@'{@dotless{i}}mbolos.)

source: Another Bug @dots{} Most Insidious
es: Otro error @dots{} m@'as insidioso

source: Bug, most insidious type
es: Error, del tipo m@'as insidioso

source: Insidious type of bug
es: Insidioso tipo de error

source: I said `almost ready to print'! Of course, there is a bug in the @code{print-graph} function @dots{} It has a @code{vertical-step} option, but not a @code{horizontal-step} option. The @code{top-of-range} scale goes from 10 to 300 by tens. But the @code{print-graph} function will print only by ones.
es: @exclamdown{}Se dijo `casi listo para imprimir'! De acuerdo, hay un error en la funci@'on @code{print-graph} @dots{}. Esta tiene una opci@'on @code{vertical-step}, pero no una opci@'on @code{horizontal-step}. La escala @code{top-of-range} va desde 10 a 300 por decenas. Pero la funci@'on @code{print-graph} imprimir@'a solo uno por uno.

source: This is a classic example of what some consider the most insidious type of bug, the bug of omission. This is not the kind of bug you can find by studying the code, for it is not in the code; it is an omitted feature. Your best actions are to try your program early and often; and try to arrange, as much as you can, to write code that is easy to understand and easy to change. Try to be aware, whenever you can, that whatever you have written, @emph{will} be rewritten, if not soon, eventually. A hard maxim to follow.
es: Esto es un ejemplo cl@'asico de lo que algunos consideramos el tipo m@'as insidioso de error, el error de omisi@'on. Este no es el tipo de error que se puede encontrar estudiando el c@'odigo, para eso no es el c@'odigo; es una funcionalidad omitida. Tus mejores acciones son probar tu programa pronto y con frecuencia; e intentar poner en orden, tanto como se pueda, escribir c@'odigo que sea f@'acil de comprender y f@'acil de cambiar. Intenta ser consciente, siempre y cuando se pueda, esto es siempre que tengas que escribir, @emph{ser@'a} reescrito, si no pronto, eventualmente. Un m@'aximo duro de seguir.

source: It is the @code{print-X-axis-numbered-line} function that needs the work; and then the @code{print-X-axis} and the @code{print-graph} functions need to be adapted. Not much needs to be done; there is one nicety: the numbers ought to line up under the tic marks. This takes a little thought.
es: Esta es la funci@'on @code{print-X-axis-numbered-line} que necesita el trabajo; y entonces el @code{print-X-axis} y la funci@'on @code{print-graph} necesita ser adaptada. No se necesita mucho para ser hecho; hay uno simp@'atico: los n@'umeros podr@'{@dotless{i}}an alinearse con marcas de tic. Esto toma un peque@~no pensamiento.

source: Here is the corrected @code{print-X-axis-numbered-line}:
es: Aqu@'{@dotless{i}} est@'a el @code{print-X-axis-numbered-line} corregido:

source: (defun print-X-axis-numbered-line (number-of-X-tics X-axis-leading-spaces &optional horizontal-step) "Print line of X-axis numbers" (let ((number X-axis-label-spacing) (horizontal-step (or horizontal-step 1)))
es: (defun print-X-axis-numbered-line (number-of-X-tics X-axis-leading-spaces &optional horizontal-step) "Imprime la l@'{@dotless{i}}neas de n@'umeros X-axis" (let ((number X-axis-label-spacing) (horizontal-step (or horizontal-step 1)))

source: (insert X-axis-leading-spaces) ;; @r{Delete extra leading spaces.} (delete-char (- (1- (length (number-to-string horizontal-step))))) (insert (concat (make-string
es: (insert X-axis-leading-spaces) ;; @r{Elimina espacios extra de gu@'{@dotless{i}}a.} (delete-char (- (1- (length (number-to-string horizontal-step))))) (insert (concat (make-string

source: ;; @r{Insert white space.} (- (* symbol-width X-axis-label-spacing) (1- (length (number-to-string horizontal-step))) 2) ? ) (number-to-string (* number horizontal-step))))
es: ;; @r{Inserta espacio en blanco.} (- (* symbol-width X-axis-label-spacing) (1- (length (number-to-string horizontal-step))) 2) ? ) (number-to-string (* number horizontal-step))))

source: ;; @r{Insert remaining numbers.} (setq number (+ number X-axis-label-spacing)) (while (> number-of-X-tics 1) (insert (X-axis-element (* number horizontal-step))) (setq number (+ number X-axis-label-spacing)) (setq number-of-X-tics (1- number-of-X-tics)))))
es: ;; @r{Insertar los n@'umeros que permanecen.} (setq number (+ number X-axis-label-spacing)) (while (> number-of-X-tics 1) (insert (X-axis-element (* number horizontal-step))) (setq number (+ number X-axis-label-spacing)) (setq number-of-X-tics (1- number-of-X-tics)))))

source: If you are reading this in Info, you can see the new versions of @code{print-X-axis} @code{print-graph} and evaluate them. If you are reading this in a printed book, you can see the changed lines here (the full text is too much to print).
es: Si se est@'a leyendo esto en Info, se pueden ver las nuevas versiones @code{print-X-axis} y @code{print-graph} y los evaluarlas. Si se est@'a leyendo esto en un libro impreso, se pueden ver las l@'{@dotless{i}}neas cambiadas aqu@'{@dotless{i}} (el texto completo es mucho para imprimir).

source: (defun print-X-axis (numbers-list horizontal-step) "Print X axis labels to length of NUMBERS-LIST. Optionally, HORIZONTAL-STEP, a positive integer, specifies how much an X axis label increments for each column."
es: (defun print-X-axis (numbers-list horizontal-step) "Imprime etiquetas del eje X a la longitud de NUMBERS-LIST. Opcionalmente, HORIZONTAL-STEP, un entero positivo, especifica cuanto una etiqueta del eje X incrementa cada columna."

source: ;; Value of symbol-width and full-Y-label-width ;; are passed by `print-graph'. (let* ((leading-spaces (make-string full-Y-label-width ? )) ;; symbol-width @r{is provided by} graph-body-print (tic-width (* symbol-width X-axis-label-spacing)) (X-length (length numbers-list))
es: ;; Valor del s@'{@dotless{i}}mbolo symbol-width and full-Y-label-width ;; se pasan por `print-graph'. (let* ((leading-spaces (make-string full-Y-label-width ? )) ;; symbol-width @r{is provided by} graph-body-print (tic-width (* symbol-width X-axis-label-spacing)) (X-length (length numbers-list))

source: (X-tic (concat (make-string ;; @r{Make a string of blanks.} (- (* symbol-width X-axis-label-spacing) (length X-axis-tic-symbol)) ? )
es: (X-tic (concat (make-string ;; @r{Crea una cadena de espacios en blanco.} (- (* symbol-width X-axis-label-spacing) (length X-axis-tic-symbol)) ? )

source: ;; @r{Concatenate blanks with tic symbol.} X-axis-tic-symbol)) (tic-number (if (zerop (% X-length tic-width)) (/ X-length tic-width) (1+ (/ X-length tic-width)))))
es: ;; @r{Concatena espacios en blanco con el s@'{@dotless{i}}mbolo tic.} X-axis-tic-symbol)) (tic-number (if (zerop (% X-length tic-width)) (/ X-length tic-width) (1+ (/ X-length tic-width)))))

source: (defun print-graph (numbers-list &optional vertical-step horizontal-step) "Print labeled bar graph of the NUMBERS-LIST. The numbers-list consists of the Y-axis values.
es: (defun print-graph (numbers-list &optional vertical-step horizontal-step) "Imprime el gr@'afico de barras etiquetada de los NUMBERS-LIST. Los numbers-list consisten en los valores del eje Y."

source: Optionally, VERTICAL-STEP, a positive integer, specifies how much a Y axis label increments for each line. For example, a step of 5 means that each row is five units.
es: Opcionalmente, VERTICAL-STEP, un entero positivo, especifica cuanto un eje Y se incrementa por cada l@'{@dotless{i}}nea. Por ejemplo, un paso de 5 significa que cada fila es de cinco unidades.

source: Optionally, HORIZONTAL-STEP, a positive integer, specifies how much an X axis label increments for each column." (let* ((symbol-width (length graph-blank)) ;; @code{height} @r{is both the largest number} ;; @r{and the number with the most digits.} (height (apply 'max numbers-list))
es: Opcionalmente, HORIZONTAL-STEP, un entero positivo, especifica cuanto se incrementa en un eje X cada columna." (let* ((symbol-width (length graph-blank)) ;; @code{height} @r{es ambos el n@'umero m@'as largo} ;; @r{y el n@'umero con la mayor@'{@dotless{i}}a de los d@'{@dotless{i}}gitos.} (height (apply 'max numbers-list))

source: (defvar top-of-ranges '(10 20 30 40 50 60 70 80 90 100 110 120 130 140 150 160 170 180 190 200 210 220 230 240 250) "List specifying ranges for `defuns-per-range'.")
es: (defvar top-of-ranges '(10 20 30 40 50 60 70 80 90 100 110 120 130 140 150 160 170 180 190 200 210 220 230 240 250) "Lista especificando rangos para `defuns-per-range'.")

source: (message "Working on `%s' ... " filename) (save-excursion (let ((buffer (find-file-noselect filename)) (lengths-list)) (set-buffer buffer) (setq buffer-read-only t) (widen) (goto-char (point-min))
es: (message "Trabajando en `%s' ... " filename) (save-excursion (let ((buffer (find-file-noselect filename)) (lengths-list)) (set-buffer buffer) (setq buffer-read-only t) (widen) (goto-char (point-min))

source: (defun lengths-list-many-files (list-of-files) "Return list of lengths of defuns in LIST-OF-FILES." (let (lengths-list) ;;; @r{true-or-false-test} (while list-of-files (setq lengths-list (append lengths-list
es: (defun lengths-list-many-files (list-of-files) "Retorna la lista de tama@~nos de defuns en LIST-OF-FILES." (let (lengths-list) ;;; @r{true-or-false-test} (while list-of-files (setq lengths-list (append lengths-list

source: ;;; @r{Generate a lengths' list.} (lengths-list-file (expand-file-name (car list-of-files))))) ;;; @r{Make files' list shorter.} (setq list-of-files (cdr list-of-files))) ;;; @r{Return final value of lengths' list.} lengths-list))
es: ;;; @r{Genera una lista de longitudes.} (lengths-list-file (expand-file-name (car list-of-files))))) ;;; @r{Crea una lista de ficheros ordenada.} (setq list-of-files (cdr list-of-files))) ;;; @r{Devuelve el valor final de las longitudes.} lengths-list))

source: ;; @r{Outer loop.} (while top-of-ranges
es: ;; @r{Bucle Exterior.} (while top-of-ranges

source: ;; @r{Inner loop.} (while (and ;; @r{Need number for numeric test.} (car sorted-lengths) (< (car sorted-lengths) top-of-range))
es: ;; @r{Bucle Interior.} (while (and ;; @r{Necesita el n@'umero para el test num@'erico.} (car sorted-lengths) (< (car sorted-lengths) top-of-range))

source: ;; @r{Count number of definitions within current range.} (setq number-within-range (1+ number-within-range)) (setq sorted-lengths (cdr sorted-lengths)))
es: ;; @r{Cuenta el n@'umero de definiciones con el rango actual.} (setq number-within-range (1+ number-within-range)) (setq sorted-lengths (cdr sorted-lengths)))

source: ;; @r{Exit inner loop but remain within outer loop.}
es: ;; @r{Bucle de salida interna, pero permanece con el bucle exterior.}

source: (setq defuns-per-range-list (cons number-within-range defuns-per-range-list)) (setq number-within-range 0) ; @r{Reset count to zero.}
es: (setq defuns-per-range-list (cons number-within-range defuns-per-range-list)) (setq number-within-range 0) ; @r{Resetea el contador a cero.}

source: ;; @r{Exit outer loop and count the number of defuns larger than} ;; @r{ the largest top-of-range value.} (setq defuns-per-range-list (cons (length sorted-lengths) defuns-per-range-list))
es: ;; @r{Salir del bucle exterior y cuenta el n@'umero de defuns tan largas como} ;; @r{el valor m@'as largo (top-of-range).} (setq defuns-per-range-list (cons (length sorted-lengths) defuns-per-range-list))

source: (defun column-of-graph (max-graph-height actual-height) "Return list of MAX-GRAPH-HEIGHT strings; ACTUAL-HEIGHT are graph-symbols. The graph-symbols are contiguous entries at the end of the list. The list will be inserted as one column of a graph. The strings are either graph-blank or graph-symbol."
es: (defun column-of-graph (max-graph-height actual-height) "Devuelve la lista de cadenas MAX-GRAPH-HEIGHT; ACTUAL-HEIGHT son los s@'{@dotless{i}}mbolos del grafo. Los s@'{@dotless{i}}mbolos del grafo son entradas contiguas al fin de la lista. La lista ser@'a insertada como una columna de un grafo. Las cadenas son tanto grafos en blanco como s@'{@dotless{i}}mbolos de un grafo."

source: (defun print-Y-axis (height full-Y-label-width &optional vertical-step) "Insert Y axis by HEIGHT and FULL-Y-LABEL-WIDTH. Height must be the maximum height of the graph. Full width is the width of the highest label element. Optionally, print according to VERTICAL-STEP."
es: (defun print-Y-axis (height full-Y-label-width &optional vertical-step) "Inserta el eje Y por HEIGHT y FULL-Y-LABEL-WIDTH. La altura debe ser la m@'axima altura del grafo. La altura completa es el ancho del mayor elemento etiquetado. Opcionalmente, se imprime de acuerdo a VERTICAL-STEP."

source: ;; Value of height and full-Y-label-width ;; are passed by `print-graph'. (let ((start (point))) (insert-rectangle (Y-axis-column height full-Y-label-width vertical-step))
es: ;; Valor de la altura y full-Y-label-width ;; son pasados por `print-graph'. (let ((start (point))) (insert-rectangle (Y-axis-column height full-Y-label-width vertical-step))

source: ;; @r{Place point ready for inserting graph.} (goto-char start) ;; @r{Move point forward by value of} full-Y-label-width (forward-char full-Y-label-width)))
es: ;; @r{Posiciona el punto lista para insertar el grafo.} (goto-char start) ;; @r{Mueve el punto hacia adelante por el valor de} full-Y-label-width (forward-char full-Y-label-width)))

source: (defun graph-body-print (numbers-list height symbol-width) "Print a bar graph of the NUMBERS-LIST. The numbers-list consists of the Y-axis values. HEIGHT is maximum height of graph. SYMBOL-WIDTH is number of each column."
es: (defun graph-body-print (numbers-list height symbol-width) "Imprime un gr@'afico de barras de la NUMBERS-LIST. La numbers-list consiste en los valores de eje Y. HEIGHT es el m@'aximo tama@~no del grafo. SYMBOL-WIDTH es el n@'umero de cada columna."

source: (defun Y-axis-column (height width-of-label &optional vertical-step) "Construct list of labels for Y axis. HEIGHT is maximum height of graph. WIDTH-OF-LABEL is maximum width of label.
es: (defun Y-axis-column (height width-of-label &optional vertical-step) "Construye una lista de etiquetas del eje Y. HEIGHT es la m@'axima del grafo. WIDTH-OF-LABEL es el m@'aximo ancho de la etiqueta.

source: VERTICAL-STEP, an option, is a positive integer that specifies how much a Y axis label increments for each line. For example, a step of 5 means that each line is five units of the graph." (let (Y-axis (number-per-line (or vertical-step 1)))
es: VERTICAL-STEP, una opci@'on, es un entero positivo que especifica cuanto una etiqueta del eje Y incrementa por cada l@'{@dotless{i}}nea. Por ejemplo, un paso de 5 significa que cada l@'{@dotless{i}}nea es cinco unidades del grafo" (let (Y-axis (number-per-line (or vertical-step 1)))

source: (while (> height 1) (if (zerop (% height Y-axis-label-spacing)) ;; @r{Insert label.} (setq Y-axis (cons (Y-axis-element (* height number-per-line) width-of-label) Y-axis))
es: (while (> height 1) (if (zerop (% height Y-axis-label-spacing)) ;; @r{Inserta la etiqueta.} (setq Y-axis (cons (Y-axis-element (* height number-per-line) width-of-label) Y-axis))

source: (insert X-axis-leading-spaces) ;; line up number (delete-char (- (1- (length (number-to-string horizontal-step))))) (insert (concat (make-string ;; @r{Insert white space up to next number.} (- (* symbol-width X-axis-label-spacing) (1- (length (number-to-string horizontal-step))) 2) ? ) (number-to-string (* number horizontal-step))))
es: (insert X-axis-leading-spaces) (delete-char (- (1- (length (number-to-string horizontal-step))))) (insert (concat (make-string ;; @r{Inserta el espacio en blanco al siguiente n@'umero.} (- (* symbol-width X-axis-label-spacing) (1- (length (number-to-string horizontal-step))) 2) ? ) (number-to-string (* number horizontal-step))))

source: ;; @r{Insert remaining numbers.} (setq number (+ number X-axis-label-spacing)) (while (> number-of-X-tics 1) (insert (X-axis-element (* number horizontal-step))) (setq number (+ number X-axis-label-spacing)) (setq number-of-X-tics (1- number-of-X-tics)))))
es: ;; @r{Inserta n@'umeros que permanazcan.} (setq number (+ number X-axis-label-spacing)) (while (> number-of-X-tics 1) (insert (X-axis-element (* number horizontal-step))) (setq number (+ number X-axis-label-spacing)) (setq number-of-X-tics (1- number-of-X-tics)))))

source: (defun one-fiftieth (full-range) "Return list, each number of which is 1/50th previous." (mapcar (lambda (arg) (/ arg 50)) full-range))
es: (defun one-fiftieth (full-range) "Devuelve la lista, cada n@'umero del que es 1/50 posiciones previas." (mapcar '(lambda (arg) (/ arg 50)) full-range))

source: The Printed Graph
es: El gr@'afico impreso

source: When made and installed, you can call the @code{print-graph} command like this:
es: Cuando est@'e hecho e instalado, se puede llamar al comando @code{print-graph} como esto:

source: Here is the graph:
es: Aqu@'{@dotless{i}} est@'a el gr@'afico:

source: The largest group of functions contain 10--19 words and symbols each.
es: El grupo largo de funciones contienen de 10 a 19 palabras y s@'{@dotless{i}}mbolos.

source: Free Software and Free Manuals
es: Software Libre y Manuales Libres

source: by Richard M. Stallman
es: por Richard M. Stallman

source: The biggest deficiency in free operating systems is not in the software---it is the lack of good free manuals that we can include in these systems. Many of our most important programs do not come with full manuals. Documentation is an essential part of any software package; when an important free software package does not come with a free manual, that is a major gap. We have many such gaps today.
es: La mayor deficiencia en sistemas operativos libres no est@'a en el software --- es la falta de buenos manuales libres que se puedan incluir en estos sistemas. Muchos de nuestros programas m@'as importantes no vienen con manuales completos. La documentaci@'on es una parte esencial de cualquier paquete de software; cuando un paquete de software libre no viene con un manual libre, es una brecha mayor. Nosotros tenemos muchas brechas hoy.

source: Once upon a time, many years ago, I thought I would learn Perl. I got a copy of a free manual, but I found it hard to read. When I asked Perl users about alternatives, they told me that there were better introductory manuals---but those were not free.
es: @'Erase una vez, hace muchos a@~nos, se piensa que aprender@'{@dotless{i}}a Perl. Se tiene una copia de un manual libre, pero se encontr@'o dif@'{@dotless{i}}cil de leer. Cuando pregunto a los usuarios de Perl acerca de alternativas, me contaron que ser@'{@dotless{i}}an mejor los manuales introductorios --- pero estos no eran libres.

source: Why was this? The authors of the good manuals had written them for O'Reilly Associates, which published them with restrictive terms---no copying, no modification, source files not available---which exclude them from the free software community.
es: ¿Por qu@'e era esto? Los autores de los buenos manuales los hab@'{@dotless{i}}an escrito para O'Reilly Associates, que los publicaron con t@'erminos restrictivos --- no copiando, no modificando, los ficheros fuentes est@'an disponibles --- que los excluyen desde la comunidad de software libre.

source: That wasn't the first time this sort of thing has happened, and (to our community's great loss) it was far from the last. Proprietary manual publishers have enticed a great many authors to restrict their manuals since then. Many times I have heard a GNU user eagerly tell me about a manual that he is writing, with which he expects to help the GNU project---and then had my hopes dashed, as he proceeded to explain that he had signed a contract with a publisher that would restrict it so that we cannot use it.
es: No era la primera vez que esto ocurr@'{@dotless{i}}a, y (para nuestra comunidad es una gran p@'erdida) eso est@'a lejos desde el @'ultimo. Las editoriales de manuales privativos han logrado que muchos autores restrinjan sus manuales desde entonces. Muchas veces se ha oido que un usuario de GNU h@'abil me cuente que un manual que est@'a escribiendo, con el que @'el espera ayudar al proyecto GNU --- y entonces ten@'{@dotless{i}}a mis esperanzas frustradas, como se ha procedi@'o a explicar que @'el ten@'{@dotless{i}}a que haber firmado un contrato con una editorial que restringir@'{@dotless{i}}a eso, as@'{@dotless{i}} que no puede usarlo.

source: Given that writing good English is a rare skill among programmers, we can ill afford to lose manuals this way.
es: Debido a que escribir buen ingl@'es es una habilidad rara entre programadores, se pueden perder manuales por este motivo.
