Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The next to last expression in the @code{kill-new} function is
es: De la siguiente a la @'ultima expresi@'on en la funci@'on @code{kill-new} es

source: The @code{kill-ring-yank-pointer} is a global variable that is set to be the @code{kill-ring}.
es: El @code{kill-ring-yank-pointer} es una variable global que es asignado para ser el @code{kill-ring}.

source: Even though the @code{kill-ring-yank-pointer} is called a @samp{pointer}, it is a variable just like the kill ring. However, the name has been chosen to help humans understand how the variable is used.
es: Incluso aunque el @code{kill-ring-yank-pointer} es llamado un @samp{puntero}, eso es una variable solo como el anillo de la muerte @emph{kill ring}. Sin embargo, el nombre que ha sido elegido para ayudar a humanos a comprender c@'omo la variable se usa.

source: Now, to return to an early expression in the body of the function:
es: Ahora, para devolver r@'apido una expresi@'on en el cuerpo de la funci@'on:

source: It starts with an @code{if} expression
es: Empieza con una expresi@'on @code{if}

source: In this case, the expression tests first to see whether @code{menu-bar-update-yank-menu} exists as a function, and if so, calls it. The @code{fboundp} function returns true if the symbol it is testing has a function definition that `is not void'. If the symbol's function definition were void, we would receive an error message, as we did when we created errors intentionally (@pxref{Making Errors, , Generate an Error Message}).
es: En este caso, la expresi@'on chequea primero si @code{menu-bar-update-yank-menu} existe como una funci@'on, y si as@'{@dotless{i}}, se llama. La funci@'on @code{fboundp} devuelve cierto si el s@'{@dotless{i}}mbolo que se chequea tiene una definici@'on de funci@'on que `no es vac@'{@dotless{i}}a'. Si el s@'{@dotless{i}}mbolo de la definici@'on de funci@'on fuera vac@'{@dotless{i}}o, recibir@'{@dotless{i}}a un mensaje de error, como se hizo cuando se crearon errores intencionalmente (@pxref{Creando errores, , Genera un Mensaje de Error}).

source: The then-part contains an expression whose first element is the function @code{and}.
es: La then-part contiene una expresi@'on cuyo primer elemento es la funci@'on @code{and}.

source: The @code{and} special form evaluates each of its arguments until one of the arguments returns a value of @code{nil}, in which case the @code{and} expression returns @code{nil}; however, if none of the arguments returns a value of @code{nil}, the value resulting from evaluating the last argument is returned. (Since such a value is not @code{nil}, it is considered true in Emacs Lisp.) In other words, an @code{and} expression returns a true value only if all its arguments are true. (@xref{Second Buffer Related Review}.)
es: La forma especial @code{and} eval@'ua cada uno de sus argumentos hasta que uno de los argumentos devuelva un valor de @code{nil}, en cuyo caso la expresi@'on @code{and} devuelve @code{nil}; sin embargo, si ninguno de los argumentos devuelve una valor de @code{nil}, el valor resultante desde la evaluaci@'on el @'ultimo argumento es devuelto. (Desde que tal valor no es @code{nil}, eso es considerado cierto en Emacs Lisp.) En otras palabras, una expresi@'on @code{and} devuelve un valor cierto solo si todos sus argumentos son verdaderos. (@xref{Revisar el segundo b@'uffer relacionado}.)

source: The expression determines whether the second argument to @code{menu-bar-update-yank-menu} is true or not.
es: La expresi@'on determina si el segundo argumento @code{menu-bar-update-yank-menu} es verdadero o no.

source: @code{menu-bar-update-yank-menu} is one of the functions that make it possible to use the `Select and Paste' menu in the Edit item of a menu bar; using a mouse, you can look at the various pieces of text you have saved and select one piece to paste.
es: @code{menu-bar-update-yank-menu} es una de la funciones que lo hace posible para usar el menu `Seleccionar y Pegar' en el @'{@dotless{i}}tem Editar de una barra de menu; usando un rat@'on, se pueden mirar varias piezas de texto que se han guardado y se selecciona una pieza para pegar.

source: The last expression in the @code{kill-new} function adds the newly copied string to whatever facility exists for copying and pasting among different programs running in a windowing system. In the X Windowing system, for example, the @code{x-select-text} function takes the string and stores it in memory operated by X@. You can paste the string in another program, such as an Xterm.
es: La @'ultima expresi@'on en la funci@'on @code{kill-new} a@~nade las cadenas nuevamente copiadas a aquella facilidad que existe copiando y pegando entre diferentes programas ejecutando un sistema de ventanas. En el Sistema de Ventanas de X, por ejemplo, la funci@'on @code{x-select-text} toma la cadena y la almacena en memoria operada por X@. Se puede pegar la cadena en otro programa, tal como un Xterm.

source: If an @code{interprogram-cut-function} exists, then Emacs executes @code{funcall}, which in turn calls its first argument as a function and passes the remaining arguments to it. (Incidentally, as far as I can see, this @code{if} expression could be replaced by an @code{and} expression similar to the one in the first part of the function.)
es: Si @code{interprogram-cut-function} existe, entonces Emacs ejecuta @code{funcall}, que en vez de llamar a su primer argumento como una funci@'on, pasa los argumentos que permanecen en eso. (Incidentalmente, tan lejos como se puede ver, esta expresi@'on @code{if} podr@'{@dotless{i}}a ser reemplazado por una expresi@'on @code{and} similar a uno en la primera parte de la funci@'on.)

source: We are not going to discuss windowing systems and other programs further, but merely note that this is a mechanism that enables GNU Emacs to work easily and well with other programs.
es: Estamos yendo a discutir sistemas de ventanas y otros programas m@'as all@'a pero meramente nota que este es un mecanismo que habilita GNU Emacs a trabajar f@'acilmente y bien con otros programas.

source: This code for placing text in the kill ring, either concatenated with an existing element or as a new element, leads us to the code for bringing back text that has been cut out of the buffer---the yank commands. However, before discussing the yank commands, it is better to learn how lists are implemented in a computer. This will make clear such mysteries as the use of the term `pointer'. But before that, we will digress into C.
es: Este c@'odigo para emplazar texot en el anillo de la muerte @emph{kill ring}, concatenado con un elemento existente o como un nuevo elemento, nos lidera al c@'odigo para traer texto que ha sido cortado del b@'uffer --- los comandos de corte. Sin embargo, antes de discutir los comandos de corte, es mejor aprender c@'omo las listas son implementadas en un ordenador. Esto dejar@'a claro tales misterios como el uso del t@'ermino `puntero'. Pero antes de esto, nos desviaremos a C.

source: C, a digression into
es: C, una disgresi@'on dentro

source: The @code{copy-region-as-kill} function (@pxref{copy-region-as-kill, , @code{copy-region-as-kill}}) uses the @code{filter-buffer-substring} function, which in turn uses the @code{delete-and-extract-region} function. It removes the contents of a region and you cannot get them back.
es: La funci@'on @code{copy-region-as-kill} (@pxref{copy-region-as-kill, , @code{copy-region-as-kill}}) usa la funci@'on @code{filter-buffer-substring}, que en vez de eso usa la funci@'on @code{delete-and-extract-region}. Eso elimina los contenidos de una regi@'on y no se puede volverlos a tener.

source: Unlike the other code discussed here, the @code{delete-and-extract-region} function is not written in Emacs Lisp; it is written in C and is one of the primitives of the GNU Emacs system. Since it is very simple, I will digress briefly from Lisp and describe it here.
es: Al contrario que el otro c@'odigo discutido aqu@'{@dotless{i}}, la funci@'on @code{delete-and-extract-region} no est@'a escrita en Emacs Lisp; eso est@'a escrito en C y es una de las primitivas del sistema GNU Emacs. Puesto que es muy simple, se har@'a la disgresi@'on brevemente desde el Lisp y se describe aqu@'{@dotless{i}}.

source: Like many of the other Emacs primitives, @code{delete-and-extract-region} is written as an instance of a C macro, a macro being a template for code. The complete macro looks like this:
es: Como muchas de las otras primitivas Emacs, @code{delete-and-extract-region} se escribe como una instancia de una macro C, una macro es una plantilla para codificar. La macro completa se parece a esto:

source: DEFUN ("delete-and-extract-region", Fdelete_and_extract_region, Sdelete_and_extract_region, 2, 2, 0, doc: /* Delete the text between START and END and return it. */) (Lisp_Object start, Lisp_Object end) @{ validate_region (&start, &end); if (XINT (start) == XINT (end)) return empty_unibyte_string; return del_range_1 (XINT (start), XINT (end), 1, 1); @}
es: DEFUN ("delete-and-extract-region", Fdelete_and_extract_region, Sdelete_and_extract_region, 2, 2, 0, doc: /* Borra el texto entre START y END y lo devuelve. */) (Lisp_Object start, Lisp_Object end) @{ validate_region (&start, &end); if (XINT (start) == XINT (end)) return empty_unibyte_string; return del_range_1 (XINT (start), XINT (end), 1, 1); @}

source: Without going into the details of the macro writing process, let me point out that this macro starts with the word @code{DEFUN}. The word @code{DEFUN} was chosen since the code serves the same purpose as @code{defun} does in Lisp. (The @code{DEFUN} C macro is defined in @file{emacs/src/lisp.h}.)
es: Sin ir dentro de los detalles de la macro que escribe el proceso, se har@'a un apunte de esta macro que empieza con la palabra @code{DEFUN}. La palabra @code{DEFUN} fu@'e elegida puesto que el c@'odigo sirve para el mismo prop@'osito que @code{defun} hace en Lisp. (La macro C @code{DEFUN} definida en @file{emacs/src/lisp.h}.)

source: The word @code{DEFUN} is followed by seven parts inside of parentheses:
es: El palabra @code{DEFUN} tiene siete partes dentro de los par@'entesis:

source: The first part is the name given to the function in Lisp, @code{delete-and-extract-region}.
es: La primera parte es el nombre dado a la funci@'on en Lisp, @code{delete-and-extract-region}.

source: The second part is the name of the function in C, @code{Fdelete_and_extract_region}. By convention, it starts with @samp{F}. Since C does not use hyphens in names, underscores are used instead.
es: La segunda parte es el nombre de la funci@'on en C, @code{Fdelete_and_extract_region}. Por convenci@'on, eso empieza con @samp{F}. Puesto que C no usa guiones en nombres, los guiones bajos son usados a su vez.

source: The third part is the name for the C constant structure that records information on this function for internal use. It is the name of the function in C but begins with an @samp{S} instead of an @samp{F}.
es: La tercera parte es el nombre para la estructura constante C que registra informaci@'on en esta funci@'on para uso interno. Es el nombre de la funci@'on en C pero empieza con una @samp{S} en vez de una @samp{F}.

source: The fourth and fifth parts specify the minimum and maximum number of arguments the function can have. This function demands exactly 2 arguments.
es: Las partes cuarta y quinta especifican el n@'umero m@'{@dotless{i}}nimo y m@'aximo de argumentos que la funci@'on puede tener. Esta funci@'on demanda exactamente 2 argumentos.

source: The sixth part is nearly like the argument that follows the @code{interactive} declaration in a function written in Lisp: a letter followed, perhaps, by a prompt. The only difference from the Lisp is when the macro is called with no arguments. Then you write a @code{0} (which is a `null string'), as in this macro.
es: La sexta parte est@'a cerca del argumento que sigue la declaraci@'on @code{interactive} en una funci@'on escrita en Lisp: una carta seguida, quiz@'as, por una consola. La @'unica diferencia con Lisp es que si la macro se llama sin argumentos. Entonces se escribe un @code{0} (que es una `cadena nula'), como en esta macro.

source: If you were to specify arguments, you would place them between quotation marks. The C macro for @code{goto-char} includes @code{"NGoto char: "} in this position to indicate that the function expects a raw prefix, in this case, a numerical location in a buffer, and provides a prompt.
es: Si se fueran a especificar argumentos, se emplazar@'{@dotless{i}}an entre marcas de comillas. La macro C para @code{goto-char} incluye @code{\"NGoto char \"} en esta posici@'on se indica que la funci@'on espera un prefijo plano, en este caso, una localizaci@'on num@'erica en un b@'uffer, y provee una consola.

source: The seventh part is a documentation string, just like the one for a function written in Emacs Lisp. This is written as a C comment. (When you build Emacs, the program @command{lib-src/make-docfile} extracts these comments and uses them to make the ``real'' documentation.)
es: La s@'eptima parte es una cadena de documentaci@'on, solo como la @'unica para una funci@'on escrita en Emacs Lisp. Esto es escrito como un comentario C. (Cuando se escribe Emacs, el programa @command{lib-src/make-docfile} extrae estos comentarios y los usa para crear la documentaci@'on ``real''.)

source: In a C macro, the formal parameters come next, with a statement of what kind of object they are, followed by what might be called the `body' of the macro. For @code{delete-and-extract-region} the `body' consists of the following four lines:
es: En una macro C, los par@'ametros son los siguientes, con una frase de este tipo de objeto se siguen por lo que podr@'{@dotless{i}}a ser llamado el `cuerpo' de la macro. Para @code{delete-and-extract-region} el `cuerpo' consiste de las siguientes cuatro l@'{@dotless{i}}neas:

source: validate_region (&start, &end); if (XINT (start) == XINT (end)) return empty_unibyte_string; return del_range_1 (XINT (start), XINT (end), 1, 1);
es: validate_region (&start, &end); if (XINT (start) == XINT (end)) return build_string (""); return del_range_1 (XINT (start), XINT (end), 1, 1);

source: The @code{validate_region} function checks whether the values passed as the beginning and end of the region are the proper type and are within range. If the beginning and end positions are the same, then return an empty string.
es: La funci@'on @code{validate_region} chequea si los valores pasados como el principio y fin de la regi@'on son el tipo apropiado y son del mismo rango. Si las posiciones del principio y fin son las mismas, entonces se devuelve una cadena vac@'{@dotless{i}}a.

source: The @code{del_range_1} function actually deletes the text. It is a complex function we will not look into. It updates the buffer and does other things. However, it is worth looking at the two arguments passed to @code{del_range}. These are @w{@code{XINT (start)}} and @w{@code{XINT (end)}}.
es: La funci@'on @code{del_range_1} actualmente borra el texto. Eso es una funci@'on compleja que no miraremos. Eso actualiza el b@'uffer y hace otras cosas. Sin embargo, es el valorable mirar los dos argumentos pasados para @code{del_range}. Estos son @w{@code{XINT (start)}} y @w{@code{XINT (end)}}.

source: As far as the C language is concerned, @code{start} and @code{end} are two integers that mark the beginning and end of the region to be deleted@footnote{More precisely, and requiring more expert knowledge to understand, the two integers are of type `Lisp_Object', which can also be a C union instead of an integer type.}.
es: Tan lejos como el lenguaje C es concebido, @code{start} y @code{end} son dos enteros que marcan el principio y el fin de la regi@'on para ser borrada@footnote{M@'as precisamente, y requiriendo conocimiento m@'as experto para comprender, los dos enteros son del tipo `Lisp_Object', que puede tambi@'en ser una uni@'on C en vez de un tipo de entero.}.

source: In early versions of Emacs, these two numbers were thirty-two bits long, but the code is slowly being generalized to handle other lengths. Three of the available bits are used to specify the type of information; the remaining bits are used as `content'.
es: En las primeras versiones de Emacs, estos dos n@'umeros fueron 32 bits de longitud, pero el c@'odigo est@'a lentamente siendo generalizado para manejar otras longitudes. Tres de los bits disponibles son usados para especificar el tipo de informaci@'on; los bits permanecen ser usados como `contenido'.

source: @samp{XINT} is a C macro that extracts the relevant number from the longer collection of bits; the three other bits are discarded.
es: @samp{XINT} es una macro C que extrae los n@'umeros relevantes desde la colecci@'on larga de bits; los otros tres bits se descartan.

source: The command in @code{delete-and-extract-region} looks like this:
es: El comando en @code{delete-and-extract-region} se parece a esto:

source: It deletes the region between the beginning position, @code{start}, and the ending position, @code{end}.
es: Esto borra la regi@'on entre la posici@'on del principio, @code{start}, y la posici@'on final, @code{end}.

source: From the point of view of the person writing Lisp, Emacs is all very simple; but hidden underneath is a great deal of complexity to make it all work.
es: Desde el punto de vista de la persona que escribe Lisp, Emacs es muy simple; pero oculta en el fondo un gran trato de complejidad para hacer todo el trabajo.

source: Initializing a variable
es: Inicializando una variable

source: Variable initialization
es: Inicializaci@'on de Variable

source: The @code{copy-region-as-kill} function is written in Emacs Lisp. Two functions within it, @code{kill-append} and @code{kill-new}, copy a region in a buffer and save it in a variable called the @code{kill-ring}. This section describes how the @code{kill-ring} variable is created and initialized using the @code{defvar} special form.
es: La funci@'on @code{copy-region-as-kill} es escrita en Emacs Lisp. Dos funciones con eso, @code{kill-append} y @code{kill-new}, copiar una regi@'on en un b@'uffer y guardarlo en una variable llamada el @code{kill-ring}. Esta secci@'on describe c@'omo la variable @code{kill-ring} es creada e inicializada usando la forma especial @code{defvar}.

source: (Again we note that the term @code{kill-ring} is a misnomer. The text that is clipped out of the buffer can be brought back; it is not a ring of corpses, but a ring of resurrectable text.)
es: (De nuevo se nota que el t@'ermino @code{kill-ring} es un sin nombre. El texto que es cortado fuera del b@'uffer puede ser traido; eso no es un corpus de anillo, pero un anillo de texto resucitable.)

source: In Emacs Lisp, a variable such as the @code{kill-ring} is created and given an initial value by using the @code{defvar} special form. The name comes from ``define variable''.
es: En Emacs Lisp, una variable tal como @code{kill-ring} es creada y dada por un valor inicial usando la forma especial @code{defvar}. El nombre viene de ``definir variable''.

source: The @code{defvar} special form is similar to @code{setq} in that it sets the value of a variable. It is unlike @code{setq} in two ways: first, it only sets the value of the variable if the variable does not already have a value. If the variable already has a value, @code{defvar} does not override the existing value. Second, @code{defvar} has a documentation string.
es: La forma especial @code{defvar} es similar a @code{setq} en este se configura el valor de una variable. Eso no es @code{setq} en dos modos; primero solo configura el valor de la variable si la variable no tiene ya un valor. Si la variable ya tiene un valor, @code{defvar} no sobreescribe el valor existente. Segundo, @code{defvar} tiene una cadena de documentaci@'on.

source: (Another special form, @code{defcustom}, is designed for variables that people customize. It has more features than @code{defvar}. (@xref{defcustom, , Setting Variables with @code{defcustom}}.)
es: (Otra forma especial, @code{defcustom}, est@'a dise@~nado para variables que la gente personaliza. Eso tiene m@'as funcionalidades que @code{defvar}. (@xref{defcustom, , Configurando Variables con @code{defcustom}}.)

source: See variable current value
es: Mira el valor actual de la variable

source: Seeing the Current Value of a Variable
es: Mirando el actual valor de una variable

source: You can see the current value of a variable, any variable, by using the @code{describe-variable} function, which is usually invoked by typing @kbd{C-h v}. If you type @kbd{C-h v} and then @code{kill-ring} (followed by @key{RET}) when prompted, you will see what is in your current kill ring---this may be quite a lot! Conversely, if you have been doing nothing this Emacs session except read this document, you may have nothing in it. Also, you will see the documentation for @code{kill-ring}:
es: Se puede ver el actual valor de una variable, cualquier variable, usando la funci@'on @code{describe-variable}, que es normalmente invocado escribiendo @kbd{C-h v}. Si se escribe @kbd{C-h v} y @code{kill-ring} (seguido por @key{RET}), se ver@'a que hay en tu anillo de la muerte actual @emph{kill ring} al ser pulsado --- @exclamdown{}esto puede ser bastante tranquilo! A la inversa, si no has estado haciendo nada esta sesi@'on en Emacs, excepto leer este documento, se puede no tener nada dentro. Tambi@'en, se ver@'a la documentaci@'on para @code{kill-ring}:

source: Documentation: List of killed text sequences. Since the kill ring is supposed to interact nicely with cut-and-paste facilities offered by window systems, use of this variable should
es: Documentaci@'on: Lista de secuencias de texto muerto (guardado). Desde que el (kill ring) se supone que interactua bien con cut-and-paste facilita ofrecer por sistemas de ventanas, deber@'{@dotless{i}}a usar esta variable

source: interact nicely with `interprogram-cut-function' and `interprogram-paste-function'. The functions `kill-new', `kill-append', and `current-kill' are supposed to implement this interaction; you may want to use them instead of manipulating the kill ring directly.
es: interact@'ua bin con `interprogram-cut-function' y `interprogram-paste-function'. Las funciones `kill-new', `kill-append', y `current-kill' se suponen para implementar esta interacci@'on; se puede querer usarlo en vez de manipular en anillo de la muerte @emph{kill ring} directamente.

source: The kill ring is defined by a @code{defvar} in the following way:
es: El kill ring @emph{anillo de la muerte} est@'a definido por un @code{defvar} del siguiente modo:

source: (defvar kill-ring nil "List of killed text sequences. @dots{}")
es: (defvar kill-ring nil "Lista de secuencia de textos cortados. @dots{}")
