Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: We can see how the @code{let} expression fits into the function as a whole by showing a template for @code{append-to-buffer} with the @code{let} expression in outline:
es: Podemos ver como la expresi@'on @code{let} se ajusta dentro de la funci@'on como un todo mostrando una plantilla para @code{append-to-buffer} con la expresi@'on @code{let} en l@'{@dotless{i}}nea:

source: (defun append-to-buffer (buffer start end) "@var{documentation}@dots{}" (interactive @dots{}) (let ((@var{variable} @var{value})) @var{body}@dots{})
es: (defun append-to-buffer (buffer start end) "@var{documentacion}@dots{}" (interactive @dots{}) (let ((@var{variable} @var{valor})) @var{cuerpo}@dots{})

source: The @code{let} expression has three elements:
es: La expresi@'on @code{let} tiene tres elementos:

source: The symbol @code{let};
es: El s@'{@dotless{i}}mbolo @code{let};

source: A varlist containing, in this case, a single two-element list, @code{(@var{variable} @var{value})};
es: Una varlist conteniendo, en este caso, una lista simple de dos elementos, @code{(@var{variable} @var{value})};

source: The body of the @code{let} expression.
es: El cuerpo de la expresi@'on @code{let}.

source: In the @code{append-to-buffer} function, the varlist looks like this:
es: En la funci@'on @code{append-to-buffer}, la varlist se parece a esto:

source: In this part of the @code{let} expression, the one variable, @code{oldbuf}, is bound to the value returned by the @code{(current-buffer)} expression. The variable, @code{oldbuf}, is used to keep track of the buffer in which you are working and from which you will copy.
es: En esta parte de la expresi@'on @code{let}, una variable, @code{oldbuf} es emparejada al valor devuelto por la expresi@'on @code{(current-buffer)}. La variable, @code{oldbuf}, es usada para guardar la traza del b@'uffer en el que tu est@'as trabajando y desde el que se copiar@'a.

source: The element or elements of a varlist are surrounded by a set of parentheses so the Lisp interpreter can distinguish the varlist from the body of the @code{let}. As a consequence, the two-element list within the varlist is surrounded by a circumscribing set of parentheses. The line looks like this:
es: El elemento o elementos de una varlist son rodeados por un conjunto de par@'entesis as@'{@dotless{i}} el int@'erprete Lisp puede distinguir la varlist desde el cuerpo del @code{let}. Como consecuencia, la lista de dos elementos con la varlist est@'a rodeados por un circunscrito conjunto de par@'entesis. Las l@'{@dotless{i}}neas se ven as@'{@dotless{i}}:

source: The two parentheses before @code{oldbuf} might surprise you if you did not realize that the first parenthesis before @code{oldbuf} marks the boundary of the varlist and the second parenthesis marks the beginning of the two-element list, @code{(oldbuf (current-buffer))}.
es: Los dos par@'entesis antes de @code{oldbuf} podr@'{@dotless{i}}an sorprenderte si no fuera porque los primeros par@'entesis antes de @code{oldbuf} marcan el l@'{@dotless{i}}mite de la varlist y el segundo par@'entesis marca el principio de la lista de dos elementos, @code{(oldbuf (current-buffer))}.

source: @code{save-excursion} in @code{append-to-buffer}
es: @code{save-excursion} en @code{append-to-buffer}

source: The body of the @code{let} expression in @code{append-to-buffer} consists of a @code{save-excursion} expression.
es: El cuerpo de la expresi@'on @code{let} en @code{append-to-buffer} consiste de una expresi@'on @code{save-excursion}.

source: The @code{save-excursion} function saves the locations of point and mark, and restores them to those positions after the expressions in the body of the @code{save-excursion} complete execution. In addition, @code{save-excursion} keeps track of the original buffer, and restores it. This is how @code{save-excursion} is used in @code{append-to-buffer}.
es: La funci@'on @code{save-excursion} guarda las localizaciones de punto y la marca, y las restaura a estas posiciones despu@'es de las expresiones en el cuerpo de la ejecuci@'on completa @code{save-excursion}. Adem@'as, @code{save-excursion} completa la ejecuci@'on. Adem@'as, @code{save-excursion} guarda la traza del b@'uffer original, y lo restaura. Esto es c@'omo @code{save-excursion} que se usa en @code{append-to-buffer}.

source: Indentation for formatting
es: Indentaci@'n para formatear

source: Formatting convention
es: Convenci@'on formateando

source: Incidentally, it is worth noting here that a Lisp function is normally formatted so that everything that is enclosed in a multi-line spread is indented more to the right than the first symbol. In this function definition, the @code{let} is indented more than the @code{defun}, and the @code{save-excursion} is indented more than the @code{let}, like this:
es: Incidentalmente, no se valora nada aqu@'{@dotless{i}} que una funci@'on Lisp es normalmente formateada as@'{@dotless{i}} que cada cosa que es encerrada en conjunto multil@'{@dotless{i}}nea que es indentada m@'as a la derecha que el primer s@'{@dotless{i}}mbolo. En esta definici@'on de funci@'on, el @code{let} es indentado m@'as que @code{defun}, y el @code{save-excursion} es indentado m@'as que el @code{let}, como esto:

source: This formatting convention makes it easy to see that the lines in the body of the @code{save-excursion} are enclosed by the parentheses associated with @code{save-excursion}, just as the @code{save-excursion} itself is enclosed by the parentheses associated with the @code{let}:
es: Esta convenci@'on formatea que sea f@'acil de ver que las l@'{@dotless{i}}neas en el cuerpo de @code{save-excursion}, solo como @code{save-excurion} por s@'{@dotless{i}} mismo est@'an encerradas por los par@'entesis asociados con el @code{let}:

source: The use of the @code{save-excursion} function can be viewed as a process of filling in the slots of a template:
es: El uso de la funci@'on @code{save-excursion} puede ser vista como un proceso de rellenar slots de una plantilla:

source: (save-excursion @var{first-expression-in-body} @var{second-expression-in-body} @dots{} @var{last-expression-in-body})
es: (save-excursion @var{primera-expresion-en-cuerpo} @var{segunda-expresion-en-cuerpo} @dots{} @var{ultima-expresion-en-cuerpo})

source: In this function, the body of the @code{save-excursion} contains only one expression, the @code{let*} expression. You know about a @code{let} function. The @code{let*} function is different. It has a @samp{*} in its name. It enables Emacs to set each variable in its varlist in sequence, one after another.
es: En esta funci@'on, el cuerpo de @code{save-excursion} contiene solo una expresi@'on, la expresi@'on @code{let*}. Se conoce una funci@'on @code{let}. La funci@'on @code{let*} es diferente. Eso tiene un @samp{*} en su nombre. Eso permite a Emacs asignar cada variable de su varlist en secuencia, una despu@'es de otra.

source: Its critical feature is that variables later in the varlist can make use of the values to which Emacs set variables earlier in the varlist. @xref{fwd-para let, , The @code{let*} expression}.
es: Su funcionalidad cr@'{@dotless{i}}tica es que las variable despu@'es en la varlist puedan hacer uso de los valores para los que Emacs asigna variables pronto en la varlist. @xref{fwd-para let, La expresi@'on @code{let*}}.

source: We will skip functions like @code{let*} and focus on two: the @code{set-buffer} function and the @code{insert-buffer-substring} function.
es: Se obviar@'an funciones como @code{let*} y se focalizar@'a en dos: la funci@'on @code{set-buffer} y la funci@'on @code{insert-buffer-substring}.

source: In the old days, the @code{set-buffer} expression was simply
es: En anta@~no, la expresi@'on @code{set-buffer} era simple:

source: but now it is
es: pero ahora eso es

source: @code{append-to} is bound to @code{(get-buffer-create buffer)} earlier on in the @code{let*} expression. That extra binding would not be necessary except for that @code{append-to} is used later in the varlist as an argument to @code{get-buffer-window-list}.
es: @code{append-to} se asigna a @code{(get-buffer-create-buffer)} pronto en la expresi@'on @code{let*}. Esta asociaci@'on extra no ser@'{@dotless{i}}a necesaria excepto para este @code{append-to} es usado despu@'es en la varlist como un argumento para @code{get-buffer-window-list}.

source: The @code{append-to-buffer} function definition inserts text from the buffer in which you are currently to a named buffer. It happens that @code{insert-buffer-substring} copies text from another buffer to the current buffer, just the reverse---that is why the @code{append-to-buffer} definition starts out with a @code{let} that binds the local symbol @code{oldbuf} to the value returned by @code{current-buffer}.
es: La definici@'on de la funci@'on @code{append-to-buffer} inserta texto desde el b@'uffer en el que est@'as actualmente a un buffer nombrado. Eso sucede que @code{insert-buffer-substring} copia texto desde otro b@'uffer al b@'uffer actual, solo el inverso --- que es porque la definici@'on @code{append-to-buffer} empieza con un @code{let} que asocia el s@'{@dotless{i}}mbolo local @code{oldbuf} al valor devuelto por @code{current-buffer}.

source: The @code{insert-buffer-substring} expression looks like this:
es: La expresi@'on @code{insert-buffer-substring} se ve como esto:

source: The @code{insert-buffer-substring} function copies a string @emph{from} the buffer specified as its first argument and inserts the string into the present buffer. In this case, the argument to @code{insert-buffer-substring} is the value of the variable created and bound by the @code{let}, namely the value of @code{oldbuf}, which was the current buffer when you gave the @code{append-to-buffer} command.
es: La funci@'on @code{insert-buffer-substring} copia una cadena @emph{from} al b@'uffer especificado como su primer argumento e inserta la cadena dentro del b@'uffer presente. En este caso, el argumento para @code{insert-buffer-substring} es el valor de la variable creada y asociada por el @code{let}, llama al valor de @code{oldbuf}, que fu@'e el b@'uffer actual cuando tu diste el comando @code{append-to-buffer}.

source: After @code{insert-buffer-substring} has done its work, @code{save-excursion} will restore the action to the original buffer and @code{append-to-buffer} will have done its job.
es: Despu@'es de que @code{insert-buffer-substring} ha hecho su trabajo, @code{save-excursion} restaurar@'a la acci@'on al b@'uffer original y @code{append-to-buffer} habr@'a hecho su trabajo.

source: Written in skeletal form, the workings of the body look like this:
es: Escrito en forma esquel@'etica, los trabajos del cuerpo se ven como esto:

source: (let (@var{bind-}@code{oldbuf}@var{-to-value-of-}@code{current-buffer}) (save-excursion ; @r{Keep track of buffer.} @var{change-buffer} @var{insert-substring-from-}@code{oldbuf}@var{-into-buffer})
es: (let (@var{bind-}@code{oldbuf}@var{-to-value-of-}@code{current-buffer}) (save-excursion ; @r{Guarda la traza del b@'uffer.} @var{change-buffer} @var{insert-substring-from-}@code{oldbuf}@var{-into-buffer})

source: In summary, @code{append-to-buffer} works as follows: it saves the value of the current buffer in the variable called @code{oldbuf}. It gets the new buffer (creating one if need be) and switches Emacs's attention to it. Using the value of @code{oldbuf}, it inserts the region of text from the old buffer into the new buffer; and then using @code{save-excursion}, it brings you back to your original buffer.
es: En resumen, @code{append-to-buffer} funciona como sigue: se guarda el valor del b@'uffer actual en la variable llamada @code{oldbuf}. Se obtiene el nuevo b@'uffer (creando uno si necesita ser) y cambia la atenci@'on de Emacs a eso. Usando el valor de @code{oldbuf}, inserta la regi@'on del texto desde el viejo b@'uffer dentro del nuevo b@'uffer; y entonces usando @code{save-excursion}, trae atr@'as a tu b@'uffer original.

source: In looking at @code{append-to-buffer}, you have explored a fairly complex function. It shows how to use @code{let} and @code{save-excursion}, and how to change to and come back from another buffer. Many function definitions use @code{let}, @code{save-excursion}, and @code{set-buffer} this way.
es: Buscando @code{append-to-buffer}, se ha explorado una funci@'on limpia compleja. Eso muestra como usar @code{let} y @code{save-excursion}, y como cambiar y volver desde otro buffer. Muchas definiciones de funci@'on usan @code{let}, @code{save-excursion}, y @code{set-buffer} de este modo.

source: Here is a brief summary of the various functions discussed in this chapter.
es: Aqu@'{@dotless{i}} est@'a un breve resumen de varias funciones discutidas en este cap@'{@dotless{i}}tulo.

source: Print the documentation for a function or variable. Conventionally bound to @kbd{C-h f} and @kbd{C-h v}.
es: Imprime la documentaci@'on para una funci@'on o variable. Convencionalmente asociada a @kbd{C-h f} y @kbd{C-h v}.

source: Find the file containing the source for a function or variable and switch buffers to it, positioning point at the beginning of the item. Conventionally bound to @kbd{M-.} (that's a period following the @key{META} key).
es: Encuentra el fichero que contiene la fuente para una funci@'on o variable y cambia buffer a @'el, posicionando el punto al principio del @'{@dotless{i}}tem. Convencionalmente emparejado a @kbd{M-.} (esto es un per@'{@dotless{i}}odo seguiendo la tecla @key{META}).

source: Save the location of point and mark and restore their values after the arguments to @code{save-excursion} have been evaluated. Also, remember the current buffer and return to it.
es: Guarda la localizaci@'on de punto y marca y restaura sus valores despu@'es de los argumentos para @code{save-excursion} y han sido evaluados. Tambi@'en, recuerda el buffer actual y devu@'elvelo.

source: Set mark at a location and record the value of the previous mark on the mark ring. The mark is a location in the buffer that will keep its relative position even if text is added to or removed from the buffer.
es: Asigna la marca en una localizaci@'on y graba el valor de la marca previa en el anillo de la marca. La marca es una localizaci@'on en el b@'uffer que guarda su posici@'on relativa incluso si el texto es a@~nadido o borrado desde el b@'uffer.

source: Set point to the location specified by the value of the argument, which can be a number, a marker, or an expression that returns the number of a position, such as @code{(point-min)}.
es: Asigna punto a la localizaci@'on especificada por el valor del argumento, que puede ser un n@'umero, una marca, o una expresi@'on que devuelve el n@'umero de una posici@'on, tal como @code{(point-min)}.

source: Copy a region of text from a buffer that is passed to the function as an argument and insert the region into the current buffer.
es: Copia una regi@'on de texto desde un b@'uffer que es pasado a la funci@'on como un argumento e inserta la regi@'on dentro del b@'uffer actual.

source: Mark the whole buffer as a region. Normally bound to @kbd{C-x h}.
es: Marca el b@'uffer completo como una regi@'on. Normalmente asignado a @kbd{C-x h}.

source: Switch the attention of Emacs to another buffer, but do not change the window being displayed. Used when the program rather than a human is to work on a different buffer.
es: Cambia la atenci@'on de Emacs a otro b@'uffer, pero no cambies la ventana siendo mostrada. Usado cuando el programa en vez de un humano trabaja en un b@'uffer diferente.

source: Find a named buffer or create one if a buffer of that name does not exist. The @code{get-buffer} function returns @code{nil} if the named buffer does not exist.
es: Encuentra un b@'uffer nombrado o crea uno si un b@'uffer de este nombre no existe. La funci@'on @code{get-buffer} devuelve @code{nil} si el nombre del b@'uffer no existe.

source: Write your own @code{simplified-end-of-buffer} function definition; then test it to see whether it works.
es: Escribe tu propia definici@'on de funci@'on @code{simplified-end-of-buffer}; entonces testea para ver si funciona.

source: Use @code{if} and @code{get-buffer} to write a function that prints a message telling you whether a buffer exists.
es: Usa @code{if} y @code{get-buffer} para escribir una funci@'on que imprime un mensaje contando si un buffer existe.

source: Using @code{find-tag}, find the source for the @code{copy-to-buffer} function.
es: Usando @code{find-tag}, encuentra la fuente para la funci@'on @code{copy-to-buffer}

source: In this chapter, we build on what we have learned in previous chapters by looking at more complex functions. The @code{copy-to-buffer} function illustrates use of two @code{save-excursion} expressions in one definition, while the @code{insert-buffer} function illustrates use of an asterisk in an @code{interactive} expression, use of @code{or}, and the important distinction between a name and the object to which the name refers.
es: En este cap@'{@dotless{i}}tulo, se construye lo que se aprendi@'o en los cap@'{@dotless{i}}tulos previos mirando en funciones m@'as complejas. La funci@'on @code{copy-to-buffer} ilustra el uso de expresiones @code{save-excursion} en una definici@'on, mientras la funci@'on @code{insert-buffer} ilustra el uso de un asterisco en una expresi@'on @code{interactive}, uso de @code{o}, y la importante distinci@'on entre un nombre y el objeto para el que el nombre se refiere.

source: The Definition of @code{copy-to-buffer}
es: La definici@'on de @code{copy-to-buffer}

source: After understanding how @code{append-to-buffer} works, it is easy to understand @code{copy-to-buffer}. This function copies text into a buffer, but instead of adding to the second buffer, it replaces all the previous text in the second buffer.
es: Despu@'es de comprender c@'omo se trabaja @code{append-to-buffer}, es f@'acil para comprender @code{copy-to-buffer}. Esta funci@'on copia texto dentro de un b@'uffer, pero en vez de a@~nadir al segundo b@'uffer, se reemplaza a todo el texto previo en el segundo b@'uffer.

source: The body of @code{copy-to-buffer} looks like this,
es: El cuerpo de @code{copy-to-buffer} se ve como esto,

source: The @code{copy-to-buffer} function has a simpler @code{interactive} expression than @code{append-to-buffer}.
es: La funci@'on @code{copy-to-buffer} tiene una expresi@'on simple @code{interactive} en vez de @code{append-to-buffer}.

source: The definition then says
es: La definici@'on entonces dice:

source: First, look at the earliest inner expression; that is evaluated first. That expression starts with @code{get-buffer-create buffer}. The function tells the computer to use the buffer with the name specified as the one to which you are copying, or if such a buffer does not exist, to create it. Then, the @code{with-current-buffer} function evaluates its body with that buffer temporarily current.
es: Primero, mira en la expresi@'on interna m@'as temprana; que es evaluada primero. Esta expresi@'on empieza con @code{get-buffer-create buffer}. La funci@'on cuenta al ordenador para usar el b@'uffer con el nombre espec@'{@dotless{i}}ficado como uno para el que est@'as copiando, o si tal b@'uffer no existe, cr@'ealo. Entonces, la funci@'on @code{with-current-buffer} eval@'ua su cuerpo con este b@'uffer temporalmente al actual.

source: (This demonstrates another way to shift the computer's attention but not the user's. The @code{append-to-buffer} function showed how to do the same with @code{save-excursion} and @code{set-buffer}. @code{with-current-buffer} is a newer, and arguably easier, mechanism.)
es: (Esto demuestra otro camino para cambiar la atenci@'on del ordenador pero no los usuarios. La funci@'on @code{append-to-buffer} muestra como hacer lo mismo con @code{save-excursion} y @code{set-buffer}. @code{with-current-buffer} es uno nuevo, y argumentablemente f@'acil, mecanismo.)

source: The @code{barf-if-buffer-read-only} function sends you an error message saying the buffer is read-only if you cannot modify it.
es: La funci@'on @code{barf-if-buffer-read-only} env@'{@dotless{i}}a un mensaje de error diciendo al b@'uffer es de solo lectura si no se puede modificar.

source: The next line has the @code{erase-buffer} function as its sole contents. That function erases the buffer.
es: La siguiente l@'{@dotless{i}}nea tiene la funci@'on @code{erase-buffer} como sus @'unicos contenidos. Este funci@'on borra el b@'uffer.

source: Finally, the last two lines contain the @code{save-excursion} expression with @code{insert-buffer-substring} as its body. The @code{insert-buffer-substring} expression copies the text from the buffer you are in (and you have not seen the computer shift its attention, so you don't know that that buffer is now called @code{oldbuf}).
es: Finalmente, las @'ultimas dos l@'{@dotless{i}}neas contienen la expresi@'on @code{save-excursion} con @code{insert-buffer-substring} como su cuerpo. La expresi@'on @code{insert-buffer-substring} copia el texto desde el b@'uffer en el que se est@'a (y no se ha visto el ordenador puesta su atenci@'on, as@'{@dotless{i}} no se sabe que este b@'uffer es ahora llamado @code{oldbuf}).

source: Incidentally, this is what is meant by `replacement'. To replace text, Emacs erases the previous text and then inserts new text.
es: De manera incidental, esto es lo que significa por `reemplazo'. Para reemplazar texto Emacs se borra el texto previo y entonces se inserta el nuevo texto.

source: In outline, the body of @code{copy-to-buffer} looks like this:
es: El c@'odigo fuente, del cuerpo de @code{copy-to-buffer} se parece a esto:

source: @code{insert-buffer} is yet another buffer-related function. This command copies another buffer @emph{into} the current buffer. It is the reverse of @code{append-to-buffer} or @code{copy-to-buffer}, since they copy a region of text @emph{from} the current buffer to another buffer.
es: @code{insert-buffer} es todav@'{@dotless{i}}a una funci@'on relacionada con el b@'uffer. Este comando copia otro b@'uffer @emph{dentro} del b@'uffer actual. Es lo inverso de @code{append-to-buffer} o @code{copy-to-buffer}, desde que se copia una regi@'on de texto @emph{desde} el b@'uffer actual a otro b@'uffer.

source: Here is a discussion based on the original code. The code was simplified in 2003 and is harder to understand.
es: Aqu@'{@dotless{i}} hay una discusi@'on basada en el c@'odigo original. El c@'odigo era simplificado en 2003 y es duro de comprender.

source: (@xref{New insert-buffer, , New Body for @code{insert-buffer}}, to see a discussion of the new body.)
es: (@xref{Nuevo insert-buffer, , Nuevo Cuerpo para @code{insert-buffer}}, para ver una discusi@'on del nuevo cuerpo.)

source: In addition, this code illustrates the use of @code{interactive} with a buffer that might be @dfn{read-only} and the important distinction between the name of an object and the object actually referred to.
es: Adem@'as, este c@'odigo ilustra el uso de @code{interactive} con un b@'uffer que podr@'{@dotless{i}}a ser @dfn{read-only} y la distinci@'on entre el nombre de un objeto y el objeto actualmente referido.

source: insert-buffer code
es: c@'odigo insert-buffer

source: The Code for @code{insert-buffer}
es: El c@'odigo para @code{insert-buffer}

source: Here is the earlier code:
es: Aqu@'{@dotless{i}} est@'a el primer c@'odigo

source: (defun insert-buffer (buffer) "Insert after point the contents of BUFFER. Puts mark after the inserted text. BUFFER may be a buffer or a buffer name." (interactive "*bInsert buffer:@: ")
es: (defun insert-buffer (buffer) "Inserta despu@'es del punto los contenidos del BUFFER. Pon la marca despu@'es del texto insertado. El BUFFER puede ser un buffer un nombre de buffer." (interactive "*bInsert buffer:@: ")
