Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: You can use your knowledge of @code{defvar} for writing the first three arguments for @code{defcustom}. The first argument to @code{defcustom} is the name of the variable. The second argument is the variable's initial value, if any; and this value is set only if the value has not already been set. The third argument is the documentation.
es: Se puede usar tu conocimiento de @code{defvar} para escribir los primeros tres argumentos para @code{defcustom}. El primer argumento para @code{defcustom} es el nombre de la variable. El segundo argumento es el valor inicial de la variable, cualquiera; y este valor es asignado solo si el valor no ha sido ya asignado. El tercer argumento es la documentaci@'on.

source: The fourth and subsequent arguments to @code{defcustom} specify types and options; these are not featured in @code{defvar}. (These arguments are optional.)
es: El cuarto y subsiguientes argumentos para @code{defcustom} especifican los tipos y opciones; estos no son funcionales en @code{defvar}. (Estos argumentos son opcionales.)

source: Each of these arguments consists of a keyword followed by a value. Each keyword starts with the colon character @samp{:}.
es: Cada uno de estos argumentos consiste de una palabra seguido de una palabra por un valor. Cada palabra clave empieza con los dos puntos @samp{:}.

source: For example, the customizable user option variable @code{text-mode-hook} looks like this:
es: Por ejemplo, la variable de opciones personalizable @code{text-mode-hook} se parece a esto:

source: (defcustom text-mode-hook nil "Normal hook run when entering Text mode and many related modes." :type 'hook :options '(turn-on-auto-fill flyspell-mode) :group 'wp)
es: (defcustom text-mode-hook nil "El hook normal se ejecuta cuando se introduce en modo texto y muchos modos relacionados." :type 'hook :options '(turn-on-auto-fill flyspell-mode) :group 'data)

source: The name of the variable is @code{text-mode-hook}; it has no default value; and its documentation string tells you what it does.
es: El nombre de la variable es @code{text-mode-hook}; no tiene valor por defecto; y su cadena de documentaci@'on cuenta lo que hace.

source: The @code{:type} keyword tells Emacs the kind of data to which @code{text-mode-hook} should be set and how to display the value in a Customization buffer.
es: La palabra clave @code{:type} le cuenta a Emacs el tipo de datos para los que @code{text-mode-hook} ser@'{@dotless{i}}a asignado y como muestra el valor en un b@'uffer de Personalizaci@'on.

source: The @code{:options} keyword specifies a suggested list of values for the variable. Usually, @code{:options} applies to a hook. The list is only a suggestion; it is not exclusive; a person who sets the variable may set it to other values; the list shown following the @code{:options} keyword is intended to offer convenient choices to a user.
es: La palabra clave @code{:options} especifica una lista sugerida de valores para la variable. Normalmente, @code{:options} se asocia a un gancho (@emph{hook}. La lista es solo una sugerencia; esa no es exclusiva; una persona quien asigna la variable puede asignarse a otros valores; la lista mostrada siguiendo la palabra clave @code{:options} se pretende ofrecer elecciones convenientes a un usuario.

source: Finally, the @code{:group} keyword tells the Emacs Customization command in which group the variable is located. This tells where to find it.
es: Finalmente, la palabra clave @code{:group} cuenta el comando de Personalizaci@'on de Emacs en el que el grupo de la variable est@'a localizado. Esto cuenta d@'onde encontralo.

source: The @code{defcustom} function recognizes more than a dozen keywords. For more information, see @ref{Customization, , Writing Customization Definitions, elisp, The GNU Emacs Lisp Reference Manual}.
es: La funci@'on @code{defcustom} reconoce m@'as de una docena de palabras clave. Para m@'as informaci@'on, mire @ref{Personalizaci@'on, , Escribiendo las Definiciones de Personalizaci@'on, elisp, El Manual de Referencia GNU Emacs Lisp}.

source: Consider @code{text-mode-hook} as an example.
es: Considere @code{text-mode-hook} como un ejemplo.

source: There are two ways to customize this variable. You can use the customization command or write the appropriate expressions yourself.
es: Hay dos caminos para personalizar esta variable. Se puede usar el comando de personalizaci@'on o escribir las expresiones apropiadas por uno mismo.

source: Using the customization command, you can type:
es: Usando el comando de personalizaci@'on, se puede escribir:

source: and find that the group for editing files of data is called `data'. Enter that group. Text Mode Hook is the first member. You can click on its various options, such as @code{turn-on-auto-fill}, to set the values. After you click on the button to
es: y encuentre que el grupo para editar ficheros de datos se llama `datos'. Introduzca este grupo. El Hook @emph{Disparador} es el primer miembro. Se puede hacer click en sus opciones varias, tal como @code{turn-on-auto-fill}, para asignar los valores. Despu@'es de hacer click en el bot@'on.

source: Save for Future Sessions
es: Gu@'ardalo para Futuras Sesiones

source: Emacs will write an expression into your @file{.emacs} file. It will look like this:
es: Emacs escribir@'a una expresi@'on en tu fichero @file{.emacs}. Se parecer@'a a esto:

source: (custom-set-variables ;; custom-set-variables was added by Custom. ;; If you edit it by hand, you could mess it up, so be careful. ;; Your init file should contain only one such instance. ;; If there is more than one, they won't work right. '(text-mode-hook (quote (turn-on-auto-fill text-mode-hook-identify))))
es: (custom-set-variables ;; custom-set-variables fu@'e a@~nadido por Custom. ;; Si se edita a mano, tu podr@'{@dotless{i}}as liarte, ;; as@'{@dotless{i}} que ten cuidado. ;; Tu fichero init contendr@'{@dotless{i}}a solo esta instancia. ;; Si hay m@'as de uno, ellos no quieren trabajar. '(text-mode-hook (quote (turn-on-auto-fill text-mode-hook-identify))))

source: (The @code{text-mode-hook-identify} function tells @code{toggle-text-mode-auto-fill} which buffers are in Text mode. It comes on automatically.)
es: (La funci@'on @code{text-mode-hook-identify} cuenta @code{toggle-text-mode-auto-fill} que buffers hay en modo Texto. Eso viene autom@'aticamente)

source: The @code{custom-set-variables} function works somewhat differently than a @code{setq}. While I have never learned the differences, I modify the @code{custom-set-variables} expressions in my @file{.emacs} file by hand: I make the changes in what appears to me to be a reasonable manner and have not had any problems. Others prefer to use the Customization command and let Emacs do the work for them.
es: La funci@'on @code{custom-set-variables} funciona de alguna manera diferente m@'as de un @code{setq}. Mientras yo nunca he aprendido las diferencias, yo modifico las expresiones @code{custom-set-variable} en mi fichero @file{.emacs} a mano: yo creo los cambios en los que aparecen a mi para ser una manera razonable y no tener problemas. Otros prefieren usar el comando de Personalizaci@'on y permitir a Emacs hacer el trabajo para ellos.

source: Another @code{custom-set-@dots{}} function is @code{custom-set-faces}. This function sets the various font faces. Over time, I have set a considerable number of faces. Some of the time, I re-set them using @code{customize}; other times, I simply edit the @code{custom-set-faces} expression in my @file{.emacs} file itself.
es: Otra funci@'on @code{custom-set-@dots{}} es @code{custom-set-faces}. Esta funci@'on asigna varios tipos de fuentes. A trav@'es del tiempo, yo he asignado un considerable n@'umero de tipos. Algo de tiempo, yo las reseteo usando @code{customize}; otras veces, simplemente edito la expresi@'on @code{custom-set-faces} en mi fichero @file{.emacs} en s@'{@dotless{i}}.

source: The second way to customize your @code{text-mode-hook} is to set it yourself in your @file{.emacs} file using code that has nothing to do with the @code{custom-set-@dots{}} functions.
es: El segundo modo de personalizar tu @code{text-mode-hook} es asignarte a t@'{@dotless{i}} mismo en tu fichero @file{.emacs} usando c@'odigo que no tiene nada que hacer con las funciones @code{custom-set-@dots{}}.

source: When you do this, and later use @code{customize}, you will see a message that says
es: Cuando se hace esto, y despu@'es usa @code{customize}, se ver@'a un mensaje que dice:

source: CHANGED outside Customize; operating on it here may be unreliable.
es: CHANGED fuera de Personalizar; operando dentro aqu@'{@dotless{i}} puede ser no confiable.

source: This message is only a warning. If you click on the button to
es: Este mensaje es solo un aviso. Si se puede cliquear en el bot@'on a

source: Emacs will write a @code{custom-set-@dots{}} expression near the end of your @file{.emacs} file that will be evaluated after your hand-written expression. It will, therefore, overrule your hand-written expression. No harm will be done. When you do this, however, be careful to remember which expression is active; if you forget, you may confuse yourself.
es: Emacs escribir@'a una expresi@'on @code{custom-set-@dots{}} cerca del fin de tu fichero @file{.emacs} que ser@'a evaluado despu@'es de que tu expresi@'on sea escrita a mano. Por esta raz@'on, se sobreescribir@'a tu expresi@'on escrita a mano. Ning@'un da@~no ser@'a hecho. Cuando se haga esto, sin embargo, ten cuidado para recordar que expresi@'on est@'a activa; si olvidas, puedes confundirte por t@'{@dotless{i}} mismo.

source: So long as you remember where the values are set, you will have no trouble. In any event, the values are always set in your initialization file, which is usually called @file{.emacs}.
es: Tan largo como se recuerda donde los valores son configurados, no habr@'a problemas. En cualquier eventos, los valores son siempre configurados en tu fichero de inicializaci@'on, que es normalmente llamado @file{.emacs}.

source: I myself use @code{customize} for hardly anything. Mostly, I write expressions myself.
es: Yo mismo hago un @code{customize} para cualquier cosa. Mayoritariamente, escribo expresiones por m@'{@dotless{i}} mismo.

source: Incidentally, to be more complete concerning defines: @code{defsubst} defines an inline function. The syntax is just like that of @code{defun}. @code{defconst} defines a symbol as a constant. The intent is that neither programs nor users should ever change a value set by @code{defconst}. (You can change it; the value set is a variable; but please do not.)
es: Incidentalmente, para ser una definici@'on concerniente m@'as completa: @code{defsubst} define una funci@'on inline. La sintaxis es solo como esta de @code{defun}. @code{defconst} define un s@'{@dotless{i}}mbolo como una constante. El intento es que ning@'un programa o usuario cambiar@'{@dotless{i}}an un valor asignado por @code{defconst}. (Se puede cambiar; el valor asignado es una variable; pero por favor no lo haga.)

source: Beginning a @file{.emacs} File
es: Empieza por un fichero @file{.emacs}

source: @file{.emacs} file, beginning of
es: fichero @file{.emacs}, empezando

source: When you start Emacs, it loads your @file{.emacs} file unless you tell it not to by specifying @samp{-q} on the command line. (The @code{emacs -q} command gives you a plain, out-of-the-box Emacs.)
es: Cuando se abre Emacs, se carga tu fichero @file{.emacs} a menos que se cuente que no se especifique @samp{-q} en la l@'{@dotless{i}}nea de comandos. (El comando @code{emacs -q} tu da un Emacs plano, fuera.)

source: A @file{.emacs} file contains Lisp expressions. Often, these are no more than expressions to set values; sometimes they are function definitions.
es: Un fichero @file{.emacs} contiene expresiones Lisp. Con frecuencia, no hay m@'as expresiones para configura valores; algunas veces esas son definiciones de funciones.

source: @xref{Init File, , The Init File @file{~/.emacs}, emacs, The GNU Emacs Manual}, for a short description of initialization files.
es: @xref{Fichero de Inicio, , El Fichero de Inicio @file{~/.emacs}, emacs, El Manual GNU Emacs}, para una corta descripci@'on de fichero de inicializaci@'on.

source: This chapter goes over some of the same ground, but is a walk among extracts from a complete, long-used @file{.emacs} file---my own.
es: Este cap@'{@dotless{i}}tulo cubre algo del mismo suelo, pero es un paseo entre extractos desde un completo, largamente usado fichero @file{.emacs} --- por m@'{@dotless{i}}.

source: The first part of the file consists of comments: reminders to myself. By now, of course, I remember these things, but when I started, I did not.
es: La primera parte del fichero consiste en comentario: me recuerdo a m@'{@dotless{i}} mismo. Por ahora, yo recuerdo estas cosas, pero cuando empec@'e, no.

source: ;;;; Bob's .emacs file ; Robert J. Chassell ; 26 September 1985
es: ;;;; fichero .emacs de Bob ; Robert J. Chassell ; 26 de Septiembre de 1985

source: Look at that date! I started this file a long time ago. I have been adding to it ever since.
es: @exclamdown{}Mira en esta fecha! Yo empec@'e este fichero hace mucho tiempo. Yo he estado a@~nadiendo cosas desde siempre.

source: ; Each section in this file is introduced by a ; line beginning with four semicolons; and each ; entry is introduced by a line beginning with ; three semicolons.
es: ; Cada secci@'on en este fichero es introducido por una ; l@'{@dotless{i}}nea empezando con cuatro puntos y comas y cada ; entrada es introducida por una l@'{@dotless{i}}nea empezando con ; tres puntos y comas.

source: This describes the usual conventions for comments in Emacs Lisp. Everything on a line that follows a semicolon is a comment. Two, three, and four semicolons are used as subsection and section markers. (@xref{Comments, ,, elisp, The GNU Emacs Lisp Reference Manual}, for more about comments.)
es: Esto describe las convenciones usuales para comentarios en Emacs Lisp. Cada cosa en una l@'{@dotless{i}}nea que sigue un punto y coma es un comentario. Dos, tres, y cuatro puntos y coma son usados como subsecci@'on y marcas de secci@'on. (@xref{Comentarios, ,, elisp, El Manual de Referencia GNU Emacs Lisp}, para m@'as comentarios.)

source: ;;;; The Help Key ; Control-h is the help key; ; after typing control-h, type a letter to ; indicate the subject about which you want help. ; For an explanation of the help facility, ; type control-h two times in a row.
es: ;;;; La Tecla de Ayuda ; Control-h es la tecla de ayuda; ; despu@'es escribiendo control-h, escribe una letra a ; indica el asunto acerca del que quieres ayuda. ; Para una explicaci@'on de la facilidad de ayuda, ; escribe control-h dos veces en una fila.

source: Just remember: type @kbd{C-h} two times for help.
es: Solo recuerda: escribe @kbd{C-h} dos veces para ayudar.

source: ; To find out about any mode, type control-h m ; while in that mode. For example, to find out ; about mail mode, enter mail mode and then type ; control-h m.
es: ; Para informarse acerca de cualquier modo, escribe control-h m ; mientras est@'e en este modo. Por ejemplo, para encontrar ; acerca del modo correo, introduce el modo correo y entonces ; escribe control-h m.

source: `Mode help', as I call this, is very helpful. Usually, it tells you all you need to know.
es: `Modo ayuda', como yo llamo a esto, es muy @'util. Usualmente, se cuenta todo lo que se necesita saber.

source: Of course, you don't need to include comments like these in your @file{.emacs} file. I included them in mine because I kept forgetting about Mode help or the conventions for comments---but I was able to remember to look here to remind myself.
es: De acuerdo, no se necesitan incluir comentarios y ficheros como estos @file{.emacs}. Yo los inclu@'{@dotless{i}} en el m@'{@dotless{i}}o porque se olvida el Modo ayuda o las convenciones para comentarios --- pero era capaz de recordar ver aqu@'{@dotless{i}} record@'armelo a m@'{@dotless{i}} mismo.

source: Text and Auto Fill Mode
es: Modo texto y auto relleno

source: Now we come to the part that `turns on' Text mode and Auto Fill mode.
es: Ahora regresa a la parte que `vuelve' al modo Texto y modo Auto Relleno.

source: ;;; Text mode and Auto Fill mode ;; The next two lines put Emacs into Text mode ;; and Auto Fill mode, and are for writers who ;; want to start writing prose rather than code. (setq-default major-mode 'text-mode) (add-hook 'text-mode-hook 'turn-on-auto-fill)
es: ;;; Modo texto modo Auto Fill ;; Las siguiente dos l@'{@dotless{i}}neas puestas en Emacs dentro de ;; modo Texto y en el modo Auto Fill, son para escritores que ;; quieren empezar a escribir prosa en vez de c@'odigo. (setq-default major-mode 'text-mode) (add-hook 'text-mode-hook 'turn-on-auto-fill)

source: Here is the first part of this @file{.emacs} file that does something besides remind a forgetful human!
es: @exclamdown{}Aqu@'{@dotless{i}} est@'a la primera parte de este fichero @file{.emacs} que hace alguna cosa bajo recuerdo de un humano olvidado!

source: The first of the two lines in parentheses tells Emacs to turn on Text mode when you find a file, @emph{unless} that file should go into some other mode, such as C mode.
es: La primera de las dos l@'{@dotless{i}}neas entre par@'entesis cuentan a Emacs a cambiar al modo Texto que se encuentra un fichero, @emph{a menos que} el fichero ir@'{@dotless{i}}a dentro de alg@'un otro modo, tal como el modo C.

source: Per-buffer, local variables list
es: Por b@'uffer, lista de variables locales

source: Local variables list, per-buffer,
es: Lista de variables locales, por b@'uffer,

source: Automatic mode selection
es: Selecci@'on de modo autom@'atico

source: Mode selection, automatic
es: Modo de selecci@'on, autom@'atico

source: When Emacs reads a file, it looks at the extension to the file name, if any. (The extension is the part that comes after a @samp{.}.) If the file ends with a @samp{.c} or @samp{.h} extension then Emacs turns on C mode. Also, Emacs looks at first nonblank line of the file; if the line says @w{@samp{-*- C -*-}}, Emacs turns on C mode. Emacs possesses a list of extensions and specifications that it uses automatically. In addition, Emacs looks near the last page for a per-buffer, ``local variables list'', if any.
es: Cuando Emacs lee un fichero, eso parece la extensi@'on al nombre del fichero. (La extensi@'on es la parte que viene despu@'es de un @samp{.}.) Si el fichero finaliza con una extensi@'on @samp{.c} o @samp{.h} entonces Emacs cambia al modo C. Tambi@'en, Emacs parece al principio una l@'{@dotless{i}}nea no blanca del fichero; si la l@'{@dotless{i}}nea dice @w{@samp{-*- C -*-}}, Emacs cambia al modo C. Emacs posee una lista de extensiones y especificaciones que usa autom@'aticamente. Adem@'as, Emacs se ve cerca de la @'ultima p@'agina por buffer, ``lista variables locales''.

source: @xref{Choosing Modes, , How Major Modes are Chosen, emacs, The GNU Emacs Manual}.
es: @xref{Eligiendo Modos, , Como los Modos Mayores son Elegidos, emacs, El Manual GNU Emacs}.

source: @xref{File Variables, , Local Variables in Files, emacs, The GNU Emacs Manual}.
es: @xref{Variables de Fichero, , Variables Locales en Ficheros, emacs, El Manual de GNU Emacs}.

source: See sections ``How Major Modes are Chosen'' and ``Local Variables in Files'' in @cite{The GNU Emacs Manual}.
es: Mira las secciones ``C@'omo los Modos Mayores son Elegidos'' y ``Variables Locales en Fichero'' en @cite{El Manual GNU Emacs}.

source: Now, back to the @file{.emacs} file.
es: Ahora, regresa al fichero @file{.emacs}.

source: Here is the line again; how does it work?
es: Aqu@'{@dotless{i}} est@'a la l@'{@dotless{i}}nea de nuevo; @questiondown{}c@'omo funciona?

source: Text Mode turned on
es: Modo Texto activado

source: This line is a short, but complete Emacs Lisp expression.
es: Esta l@'{@dotless{i}}nea es un resumen, pero completa la expresi@'on Emacs Lisp.

source: We are already familiar with @code{setq}. It sets the following variable, @code{major-mode}, to the subsequent value, which is @code{text-mode}. The single quote mark before @code{text-mode} tells Emacs to deal directly with the @code{text-mode} symbol, not with whatever it might stand for. @xref{set & setq, , Setting the Value of a Variable}, for a reminder of how @code{setq} works. The main point is that there is no difference between the procedure you use to set a value in your @file{.emacs} file and the procedure you use anywhere else in Emacs.
es: Ya estamos familiarizados con @code{setq}. Eso asigna la siguiente variable, @code{major-mode}, al subsiguiente valor, que es @code{text-mode}. La marca de cita simple antes de @code{text-mode} cuenta a Emacs como tratar directamente con el s@'{@dotless{i}}mbolo, no con cualquier cosa que pudiera existir. @xref{set y setq, , Configurando el Valor de una Variable}, por un recuerdo de como @code{setq} funciona. El principal punto es que no hay diferencia entre el procedimiento que se usa para asignar un valor en su fichero @file{.emacs} y el procedimiento que se usa en cualquier lugar m@'as en Emacs.

source: Here is the next line:
es: Aqu@'{@dotless{i}} est@'a la siguiente l@'{@dotless{i}}nea:

source: Auto Fill mode turned on
es: Modo de autoajuste activado

source: In this line, the @code{add-hook} command adds @code{turn-on-auto-fill} to the variable.
es: En esta l@'{@dotless{i}}nea, el comando @code{add-hook} a@~nade @code{turn-on-auto-fill} para la variable.

source: @code{turn-on-auto-fill} is the name of a program, that, you guessed it!, turns on Auto Fill mode.
es: @exclamdown{}@code{turn-on-auto-fill} es el nombre de un programa, que se adivina!, cambia al modo Auto Fill.

source: Every time Emacs turns on Text mode, Emacs runs the commands `hooked' onto Text mode. So every time Emacs turns on Text mode, Emacs also turns on Auto Fill mode.
es: Cada vez que Emacs cambia al modo texto, Emacs ejecuta el comando `hooked' dentro de modo Texto. As@'{@dotless{i}} que cada vez que Emacs cambia al modo Texto, Emacs tambi@'en cambia al modo de autoajuste.

source: In brief, the first line causes Emacs to enter Text mode when you edit a file, unless the file name extension, a first non-blank line, or local variables to tell Emacs otherwise.
es: En breve, la primera l@'{@dotless{i}}nea causa a Emacs a entrar en modo Texto cuando se edite un fichero, a menos que la extensi@'on del nombre del fichero, una l@'{@dotless{i}}nea no en blanco, variables locales para contar a Emacs de otro modo.

source: Text mode among other actions, sets the syntax table to work conveniently for writers. In Text mode, Emacs considers an apostrophe as part of a word like a letter; but Emacs does not consider a period or a space as part of a word. Thus, @kbd{M-f} moves you over @samp{it's}. On the other hand, in C mode, @kbd{M-f} stops just after the @samp{t} of @samp{it's}.
es: El modo texto entre otras acciones, asigna la tabla de sintaxis para trabajar adecuadamente a escritores. En modo texto, Emacs considera un ap@'ostrofe como parte de una palabra como una letra; pero Emacs no considera un per@'{@dotless{i}}odo o un espacio como parte de una palabra. De este modo, @kbd{M-f} se mueve hacia t@'{@dotless{i}} a trav@'es de @samp{eso}. Por otro lado, en modo C, @kbd{M-f} para solo despu@'es del @samp{t} de @samp{eso}.
