Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: (defun zap-to-char (arg char) "Kill up to and including ARG'th occurrence of CHAR. Case is ignored if `case-fold-search' is non-nil in the current buffer. Goes backward if ARG is negative; error if CHAR not found." (interactive "p\ncZap to char: ") (if (char-table-p translation-table-for-input) (setq char (or (aref translation-table-for-input char) char))) (kill-region (point) (progn (search-forward (char-to-string char) nil nil arg) (point))))
es: (defun zap-to-char (arg char) "Corta e incluye ARG'th ocurrencia de CHAR En caso de ser ignorada si `case-fold-search' es no nulo en el b@'uffer actual. Para ir atr@'as si ARG es negativo; error si CHAR no se encuentra." (interactive "p\ncZap to char: ") (if (char-table-p translation-table-for-input) (setq char (or (aref translation-table-for-input char) char))) (kill-region (point) (progn (search-forward (char-to-string char) nil nil arg) (point))))

source: The documentation is thorough. You do need to know the jargon meaning of the word `kill'.
es: La documentaci@'on es en l@'{@dotless{i}}nea. Se necesita conocer el significado de la jerga de la palabra `kill'.

source: The @code{interactive} Expression
es: La expresi@'on @code{interactive}

source: The interactive expression in the @code{zap-to-char} command looks like this:
es: La expresi@'on interactiva en el comando @code{zap-to-char} se ve as@'{@dotless{i}}:

source: The part within quotation marks, @code{"p\ncZap to char:@: "}, specifies two different things. First, and most simply, is the @samp{p}. This part is separated from the next part by a newline, @samp{\n}. The @samp{p} means that the first argument to the function will be passed the value of a `processed prefix'. The prefix argument is passed by typing @kbd{C-u} and a number, or @kbd{M-} and a number. If the function is called interactively without a prefix, 1 is passed to this argument.
es: La parte con comillas, @code{"p\ncZap to char:@: "} @emph{Cortar a caracter}, especifica dos cosas diferentes. Primero, y m@'as simple es el @samp{p}. Este parte se separa desde la siguiente parte por una nueva l@'{@dotless{i}}nea, @samp{\n}. El @samp{p} significa que la parte del primero argumento a la funci@'on ser@'a pasando el valor de un `prefijo procesado'. El argumento prefijo es pasado escribiendo @kbd{C-u} y un n@'umero, o @kbd{M-} y un n@'umero. Si la funci@'on es llamada interactivamente sin un prefijo, el n@'umero que se pasa es 1.

source: The second part of @code{"p\ncZap to char:@: "} is @samp{cZap to char:@: }. In this part, the lower case @samp{c} indicates that @code{interactive} expects a prompt and that the argument will be a character. The prompt follows the @samp{c} and is the string @samp{Zap to char:@: } (with a space after the colon to make it look good).
es: La segunda parte de @code{"p\ncZap a caracter:@: "} es @samp{cZap a car@'acter:@:}. En esta parte, la tecla baja @samp{c} indica que @code{interactive} espera una consola que el argumento ser@'a un caracter. La consola sigue el @samp{c} y es la cadena @samp{Zap a caracter:@: } (con un espacio despu@'es del punto y coma para hacerlo bien).

source: What all this does is prepare the arguments to @code{zap-to-char} so they are of the right type, and give the user a prompt.
es: Todo lo que se hace es preparar los argumentos para @code{zap-to-char} as@'{@dotless{i}} est@'an en el tipo correcto, y dan al usuario un prompt.

source: In a read-only buffer, the @code{zap-to-char} function copies the text to the kill ring, but does not remove it. The echo area displays a message saying that the buffer is read-only. Also, the terminal may beep or blink at you.
es: En un b@'uffer de solo lectura, la funci@'on @code{zap-to-char} copia el texto al anillo de la muerte, no se elimina. El @'area echo muestra un mensaje diciendo que el b@'uffer es de solo lectura. Tambi@'en, la terminal avisa con un pitido.

source: The Body of @code{zap-to-char}
es: El cuerpo de @code{zap-to-char}

source: The body of the @code{zap-to-char} function contains the code that kills (that is, removes) the text in the region from the current position of the cursor up to and including the specified character.
es: El cuerpo de la funci@'on @code{zap-to-char} contiene el c@'odigo que mata (que se borra/corta) el texto en la regi@'on desde la posici@'on actual del cursor e incluyendo el car@'acter especificado.

source: The first part of the code looks like this:
es: La primera parte del c@'odigo se ve como:

source: @code{char-table-p} is an hitherto unseen function. It determines whether its argument is a character table. When it is, it sets the character passed to @code{zap-to-char} to one of them, if that character exists, or to the character itself. (This becomes important for certain characters in non-European languages. The @code{aref} function extracts an element from an array. It is an array-specific function that is not described in this document. @xref{Arrays, , Arrays, elisp, The GNU Emacs Lisp Reference Manual}.)
es: @code{char-table-p} es una funci@'on prescrita no vista. Eso determina si sus argumentos son una tabla de caracteres. As@'{@dotless{i}}, se asigna el car@'acter pasado a @code{zap-to-char} a uno de ellos, si este car@'acter existe, o al car@'acter en s@'{@dotless{i}}. (Esto llega a ser importante para ciertos caracteres en lenguajes no Europeos. La funci@'on @code{aref} extrae un elemento desde un array. Eso es una funci@'on espec@'{@dotless{i}}fica de array que no est@'a descrita en este documento. @xref{Array, , Arrays, elisp, El Manual de Referencia de GNU Emacs Lisp}.)

source: @code{(point)} is the current position of the cursor.
es: Lo que devuelve @code{(point)} es la posici@'on actual del cursor.

source: The next part of the code is an expression using @code{progn}. The body of the @code{progn} consists of calls to @code{search-forward} and @code{point}.
es: La siguiente parte del c@'odigo es una expresi@'on usando @code{progn}. El cuerpo del @code{progn} se basa en llamadas a @code{search-forward} y @code{point}.

source: It is easier to understand how @code{progn} works after learning about @code{search-forward}, so we will look at @code{search-forward} and then at @code{progn}.
es: Es f@'acil comprender c@'omo @code{progn} funciona despu@'es de aprender acerca de @code{search-forward}, as@'{@dotless{i}} se ver@'a en @code{search-forward} y entonces en @code{progn}.

source: The @code{search-forward} Function
es: La funci@'on @code{search-forward}

source: The @code{search-forward} function is used to locate the zapped-for-character in @code{zap-to-char}. If the search is successful, @code{search-forward} leaves point immediately after the last character in the target string. (In @code{zap-to-char}, the target string is just one character long. @code{zap-to-char} uses the function @code{char-to-string} to ensure that the computer treats that character as a string.) If the search is backwards, @code{search-forward} leaves point just before the first character in the target. Also, @code{search-forward} returns @code{t} for true. (Moving point is therefore a `side effect'.)
es: La funci@'on @code{search-forward} se usa para localizar el zapped-for-character en @code{zap-to-char}. Si la b@'usqueda es exitosa, @code{search-forward} deja el punto inmediatamente despu@'es del @'ultimo car@'acter en la cadena objetivo. (En @code{zap-to-char}, la cadena objetivo es solo un car@'acter largo. @code{zap-to-char} usa la funci@'on @code{char-to-string} para asegurar que el ordenador trata este car@'acter como una cadena). Si la b@'usqueda es hacia atr@'as, @code{search-forward} deja el punto solo antes del primer car@'acter en el objetivo. Tambi@'en, @code{search-forward} devuelve @code{t} para verdad. (Moviendo el punto all@'{@dotless{i}} es un `efecto lateral'.)

source: In @code{zap-to-char}, the @code{search-forward} function looks like this:
es: En @code{zap-to-char}, la funci@'on @code{search-forward} se ve as@'{@dotless{i}}:

source: The @code{search-forward} function takes four arguments:
es: La funci@'on @code{search-forward} toma cuatro argumentos:

source: The first argument is the target, what is searched for. This must be a string, such as @samp{"z"}.
es: El primer argumento es el objetivo, para el que es buscado. Esto debe ser una cadena, tal como @samp{"z"}.

source: As it happens, the argument passed to @code{zap-to-char} is a single character. Because of the way computers are built, the Lisp interpreter may treat a single character as being different from a string of characters. Inside the computer, a single character has a different electronic format than a string of one character. (A single character can often be recorded in the computer using exactly one byte; but a string may be longer, and the computer needs to be ready for this.) Since the @code{search-forward} function searches for a string, the character that the @code{zap-to-char} function receives as its argument must be converted inside the computer from one format to the other; otherwise the @code{search-forward} function will fail. The @code{char-to-string} function is used to make this conversion.
es: Cuando eso ocurre, el argumento pasado a @code{zap-to-char} es un caracter simple. Debido a la forma en la que los ordenadores son construidos, el int@'erprete Lisp puede tratar un caracter simple siendo diferente desde una cadena de caracteres. Dentro del ordenador, un caracter simple tiene un formato electr@'onico en vez de una cadena de un caracter. (Un caracter simple puede con frecuencia ser grabado en el ordenador usando exactamente un byte; pero una cadena puede ser larga, y el ordenador necesita estar listo para esto.) Desde que la funci@'on @code{search-forward} busca una cadena, el caracter que la funci@'on @code{zap-to-char} recibe como argumento debe ser convertida dentro del ordenador de un formato a otro; de otro modo, la funci@'on @code{search-forward} fallar@'a. La funci@'on @code{char-to-string} es usada para hacer esta conversi@'on.

source: The second argument bounds the search; it is specified as a position in the buffer. In this case, the search can go to the end of the buffer, so no bound is set and the second argument is @code{nil}.
es: El segundo argumento asocia la b@'usqueda; eso se especifica como una posici@'on en el b@'uffer. En este caso, la b@'usqueda puede ir al final del b@'uffer, as@'{@dotless{i}} no se asigna y el segundo argumento es @code{nil}.

source: The third argument tells the function what it should do if the search fails---it can signal an error (and print a message) or it can return @code{nil}. A @code{nil} as the third argument causes the function to signal an error when the search fails.
es: El tercer argumento cuenta la funci@'on que har@'{@dotless{i}}a si la b@'usqueda cae --- eso puede se@~nalar un error (e imprimir un mensaje) o puede devolver @code{nil}. Un @code{nil} como tercer argumento hace que la funci@'on se@~nale un error cuando la b@'usqueda falla.

source: The fourth argument to @code{search-forward} is the repeat count---how many occurrences of the string to look for. This argument is optional and if the function is called without a repeat count, this argument is passed the value 1. If this argument is negative, the search goes backwards.
es: El cuarto argumento @code{search-forward} es el contaje repetido --- cu@'antas ocurrencias de la cadena para buscar. Este argumento es opcional y si la funci@'on es llamada sin un contaje repetido, este argumento pasa el valor 1. Si este argumento es negativo, la b@'usqueda va hacia atr@'as.

source: In template form, a @code{search-forward} expression looks like this:
es: En la forma de plantilla, una expresi@'on @code{search-forward} se ve as@'{@dotless{i}}:

source: (search-forward "@var{target-string}" @var{limit-of-search} @var{what-to-do-if-search-fails} @var{repeat-count})
es: (search-forward "@var{cadena-a-buscar}" @var{limite-de-busqueda} @var{que-hacer-si-la-busqueda-falla} @var{repetir-contaje})

source: We will look at @code{progn} next.
es: Lo siguiente es echar un vistazo a @code{progn}.

source: The @code{progn} Special Form
es: La forma especial @code{progn}

source: @code{progn} is a special form that causes each of its arguments to be evaluated in sequence and then returns the value of the last one. The preceding expressions are evaluated only for the side effects they perform. The values produced by them are discarded.
es: @code{progn} es una forma especial que causa que cada uno de sus argumentos puedan ser evaluados en secuencia y entonces devuelve el valor del @'ultimo. Las expresiones precedentes son evaluadas solo por los efectos laterales que ellos desarrollan. Los valores producidos por ellos son descartados.

source: The template for a @code{progn} expression is very simple:
es: La plantilla para una expresi@'on @code{progn} es muy simple:

source: In @code{zap-to-char}, the @code{progn} expression has to do two things: put point in exactly the right position; and return the location of point so that @code{kill-region} will know how far to kill to.
es: En @code{zap-to-char}, la expresi@'on @code{progn} tiene que hacer dos cosas: poner el punto en la posici@'on exacta; y devolver la posici@'on del punto de modo que @code{kill-region} conoce c@'omo de lejos se copia.

source: The first argument to the @code{progn} is @code{search-forward}. When @code{search-forward} finds the string, the function leaves point immediately after the last character in the target string. (In this case the target string is just one character long.) If the search is backwards, @code{search-forward} leaves point just before the first character in the target. The movement of point is a side effect.
es: El primer argumento de @code{progn} es @code{search-forward}. Cuando @code{search-forward} encuentra la cadena, la funci@'on deja el punto inmediatamente despu@'es del @'ultimo caracter en la cadena objetivo. (En este caso la cadena objetivo es solo un car@'acter largo.) Si la b@'usqueda es hacia atr@'as, @code{search-forward} deja el punto justo antes del primer car@'acter en el objetivo. El movimiento del punto es un efecto lateral.

source: The second and last argument to @code{progn} is the expression @code{(point)}. This expression returns the value of point, which in this case will be the location to which it has been moved by @code{search-forward}. (In the source, a line that tells the function to go to the previous character, if it is going forward, was commented out in 1999; I don't remember whether that feature or mis-feature was ever a part of the distributed source.) The value of @code{point} is returned by the @code{progn} expression and is passed to @code{kill-region} as @code{kill-region}'s second argument.
es: El segundo y @'ultimo argumento de @code{progn} es la expresi@'on @code{(point)}. Esta expresi@'on devuelve el valor del punto, que en este caso ser@'a la localizaci@'on para la que se ha movido por @code{search-forward}. (En la fuente, una l@'{@dotless{i}}nea que cuenta la funci@'on para ir al car@'acter previo, si se est@'a yendo hacia delante, se coment@'o en 1999; yo no recuerdo si esta funcionalidad o no funcionalidad era siempre parte de las fuentes distribuidas.) El valor de @code{point} se devuelve por la expresi@'on @code{progn} y se pasa a @code{kill-region} como el segundo argumento de @code{kill-region} .

source: Summing up @code{zap-to-char}
es: Resumiendo @code{zap-to-char}

source: Now that we have seen how @code{search-forward} and @code{progn} work, we can see how the @code{zap-to-char} function works as a whole.
es: Ahora que se ha visto c@'omo @code{search-forward} y @code{progn} trabajan, se puede ver c@'omo la funci@'on @code{zap-to-char} funciona como un todo.

source: The first argument to @code{kill-region} is the position of the cursor when the @code{zap-to-char} command is given---the value of point at that time. Within the @code{progn}, the search function then moves point to just after the zapped-to-character and @code{point} returns the value of this location. The @code{kill-region} function puts together these two values of point, the first one as the beginning of the region and the second one as the end of the region, and removes the region.
es: El primer argumento de @code{kill-region} es la posici@'on del cursor cuando el comando @code{zap-to-char} da --- el valor del punto en este momento. Con el @code{progn}, la b@'usqueda de la funci@'on mueve el punto a solo despu@'es del zapped-to-character y @code{point} devuelve el valor de localizaci@'on. La funci@'on @code{kill-region} pone junto a estos dos valores de punto, el primero como el principio de la regi@'on y el segundo como el fin de la regi@'on, y borra la regi@'on.

source: The @code{progn} special form is necessary because the @code{kill-region} command takes two arguments; and it would fail if @code{search-forward} and @code{point} expressions were written in sequence as two additional arguments. The @code{progn} expression is a single argument to @code{kill-region} and returns the one value that @code{kill-region} needs for its second argument.
es: La forma especial @code{progn} se necesita porque el comando @code{kill-region} toma dos argumentos; y fallar@'{@dotless{i}}a si @code{search-forward} y expresiones @code{point} fueran escritas en secuencia como dos argumentos adicionales. La expresi@'on @code{progn} es un argumento simple para @code{kill-region} y devuelve un valor para que @code{kill-region} se necesite por su segundo argumento.

source: The @code{zap-to-char} function uses the @code{kill-region} function. This function clips text from a region and copies that text to the kill ring, from which it may be retrieved.
es: La funci@'on @code{zap-to-char} usa la funci@'on @code{kill-region}. Esta funci@'on corta texto desde una regi@'on y copia este texto al kill ring @emph{anillo de la muerte}, desde el que puede ser recuperado.

source: The Emacs 22 version of that function uses @code{condition-case} and @code{copy-region-as-kill}, both of which we will explain. @code{condition-case} is an important special form.
es: Tanto la versi@'on de Emacs 22 de esta funci@'on usa @code{condition-case} y @code{copy-region-as-kill}, ambas se explicar@'an. @code{condition-case} es una forma especial importante.

source: In essence, the @code{kill-region} function calls @code{condition-case}, which takes three arguments. In this function, the first argument does nothing. The second argument contains the code that does the work when all goes well. The third argument contains the code that is called in the event of an error.
es: En esencia, la funci@'on @code{kill-region} llama a @code{condition-case}, que toma tres argumentos. En esta funci@'on, el primer argumento no hace nada. El segundo argumento contiene el c@'odigo hace el trabajo cuando todo va bien. El tercer argumento contiene el c@'odigo que se llama en el evento de un error.

source: The Complete @code{kill-region} Definition
es: La definici@'on completa @code{kill-region}

source: We will go through the @code{condition-case} code in a moment. First, let us look at the definition of @code{kill-region}, with comments added:
es: Ahora se puede volver a trav@'es del c@'odigo @code{condition-case} en un momento. Primero, se echa un vistazo a la definici@'on de @code{kill-region}, con comentarios a@~nadidos:

source: (defun kill-region (beg end) "Kill (\"cut\") text between point and mark. This deletes the text from the buffer and saves it in the kill ring. The command \\[yank] can retrieve it from there. @dots{} "
es: (defun kill-region (beg end) "Kill (\"corta\") texto entre punto y marca. Esto borra el texto desde el b@'uffer y lo guarda en anillo de la muerte @emph{kill ring}. El comando \\[yank] puede recuperarse desde all@'{@dotless{i}}. @dots{} "

source: ;; @bullet{} Since order matters, pass point first. (interactive (list (point) (mark))) ;; @bullet{} And tell us if we cannot cut the text. ;; `unless' is an `if' without a then-part. (unless (and beg end) (error "The mark is not set now, so there is no region"))
es: ;; @bullet{} Desde materias de orden, pasa el punto primero. (interactive (list (point) (mark))) ;; @bullet{} Y cu@'entanos si no podemos cortar el texto. ;; `a menos que' sea un `if' sin una then-part. (unless (and beg end) (error "La marca no est@'a asignada ahora, as@'{@dotless{i}} que no hay regi@'on"))

source: ;; @bullet{} `condition-case' takes three arguments. ;; If the first argument is nil, as it is here, ;; information about the error signal is not ;; stored for use by another function. (condition-case nil
es: ;; @bullet{} `condition-case' toma tres argumentos ;; Si el primer argumento es nulo, como aqu@'{@dotless{i}} ;; la informaci@'on acerca del error no est@'a ;; almacenada para ser usada por otra funci@'on (condition-case nil

source: ;; @bullet{} The second argument to `condition-case' tells the ;; Lisp interpreter what to do when all goes well.
es: ;; @bullet{} El segundo argumento a `condition-case' cuenta lo que el ;; int@'erprete que hace cuando todo va bien.

source: ;; It starts with a `let' function that extracts the string ;; and tests whether it exists. If so (that is what the ;; `when' checks), it calls an `if' function that determines ;; whether the previous command was another call to ;; `kill-region'; if it was, then the new text is appended to ;; the previous text; if not, then a different function, ;; `kill-new', is called.
es: ;; Empieza con una funci@'on `let' que extrae la cadena ;; y chequea si existe. Si es as@'{@dotless{i}} (esto es lo ;; que `when' chequea), eso llama a una funci@'on `if' que ;; determina si el comando previo que era otra llamada ;; si el comando previo fu@'e otra llamada a `kill-region'; ;; si lo era, entonces el siguiente texto se a@~nade ;; cuando se chequea), eso llama a una funci@'on `if' que ;; determina si el comando previo era otra llamada a ;; `kill-region'; si era eso, entonces el nuevo texto es ;; a@~nadido al texto previo; si no, entonces una funci@'on ;; diferente, `kill-new' se llama.

source: ;; The `kill-append' function concatenates the new string and ;; the old. The `kill-new' function inserts text into a new ;; item in the kill ring.
es: ;; La funci@'on `kill-append' concatena la nueva cadena y ;; la vieja. La funci@'on `kill-new' inserta texto dentro de ;; @'{@dotless{i}}tem en el kill ring @emph{anillo de la muerte}.

source: ;; `when' is an `if' without an else-part. The second `when' ;; again checks whether the current string exists; in ;; addition, it checks whether the previous command was ;; another call to `kill-region'. If one or the other ;; condition is true, then it sets the current command to ;; be `kill-region'.
es: ;; `when' es un `if' sin una parte else. El segundo `when' ;; de nuevo chequea si la cadena actual existe; ;; por a@~nadidura, eso chequea si el comando previo fuese ;; otra llamada a `kill-region'. Si una u otra condici@'on ;; es verdadero, entonces eso configura el actual comando a ;; ser `kill-region'.

source: ;; @minus{} `yank-handler' is an optional argument to ;; `kill-region' that tells the `kill-append' and ;; `kill-new' functions how deal with properties ;; added to the text, such as `bold' or `italics'. (kill-append string (< end beg) yank-handler) (kill-new string nil yank-handler))) (when (or string (eq last-command 'kill-region)) (setq this-command 'kill-region)) nil)
es: ;; @minus{} `yank-handler' es un argumento opcional para ;; `kill-region' que cuenta el `kill-append' y funciones ;; `kill-new' como tratan con propiedades a@~nadidas ;; al texto, tal como `negrilla' o `it@'alica' (kill-append string (< end beg) yank-handler) (kill-new string nil yank-handler))) (when (or string (eq last-command 'kill-region)) (setq this-command 'kill-region)) nil)
