Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: In the first part of the body of the @code{copy-region-as-kill} function, an @code{if} expression determines whether the value of @code{last-command} is @code{kill-region}. If so, the then-part of the @code{if} expression is evaluated; it uses the @code{kill-append} function to concatenate the text copied at this call to the function with the text already in the first element (the @sc{car}) of the kill ring. On the other hand, if the value of @code{last-command} is not @code{kill-region}, then the @code{copy-region-as-kill} function attaches a new element to the kill ring using the @code{kill-new} function.
es: En la primera parte del cuerpo de la funci@'on @code{copy-region-as-kill}, una expresi@'on @code{if} determina si el valor de @code{last-command} es @code{kill-region}. Si es as@'{@dotless{i}}, la then-part de la expresi@'on @code{if} se eval@'ua; eso usa la funci@'on @code{kill-append} para concatenar el texto copiado en esta llamada a la funci@'on con el texto ya en el primer elemento (el @sc{car} del anillo de la muerte. Por otro lado, si el valor de @code{last-command} no es @code{kill-region}, entonces la funci@'on @code{copy-region-as-kill} adjunta un nuevo elemento al anillo de la muerte @emph{kill ring} usando la funci@'on @code{kill-new}.

source: The @code{if} expression reads as follows; it uses @code{eq}:
es: La expresi@'on @code{or} se ve as@'{@dotless{i}}; usa @code{eq}:

source: (if (eq last-command 'kill-region) ;; @r{then-part} (kill-append (filter-buffer-substring beg end) (< end beg)) ;; @r{else-part} (kill-new (filter-buffer-substring beg end)))
es: (if (eq last-command 'kill-region) ;; @r{parte then} (kill-append (filter-buffer-substring beg end) (< end beg)) ;; @r{parte else} (kill-new (filter-buffer-substring beg end)))

source: (The @code{filter-buffer-substring} function returns a filtered substring of the buffer, if any. Optionally---the arguments are not here, so neither is done---the function may delete the initial text or return the text without its properties; this function is a replacement for the older @code{buffer-substring} function, which came before text properties were implemented.)
es: (La funci@'on @code{filter-buffer-substring} devuelve una subcadena filtrada del b@'uffer, cualquiera. Opcionalmente --- los argumentos no est@'an aqu@'{@dotless{i}}, as@'{@dotless{i}} nunca est@'a hecho --- la funci@'on puede borrar el texto inicial o devolver el texto sin sus propiedades; esta funci@'on es un reemplazo para la vieja funci@'on @code{buffer-substring}, que viene antes que las propiedades del texto fuesen implementadas.)

source: eq @r{(example of use)}
es: eq @r{(ejemplo de uso)}

source: The @code{eq} function tests whether its first argument is the same Lisp object as its second argument. The @code{eq} function is similar to the @code{equal} function in that it is used to test for equality, but differs in that it determines whether two representations are actually the same object inside the computer, but with different names. @code{equal} determines whether the structure and contents of two expressions are the same.
es: La funci@'on @code{eq} chequea si su primer argumento es el mismo objeto Lisp que su segundo argumento. La funci@'on @code{eq} es similar a la funci@'on @code{equal} en esto que es usado para chequear para igualdad, pero difiere en esto que determina si dos representaciones son actualmente el mismo objeto dentro del ordenador, pero con diferentes nombres. @code{equal} determina si la estructura y contenidos de dos expresiones son la misma.

source: If the previous command was @code{kill-region}, then the Emacs Lisp interpreter calls the @code{kill-append} function
es: Si el comando previo era @code{kill-region}, entonces el int@'erprete Emacs Lisp llama a la funci@'on @code{kill-append}

source: kill-append function
es: Funci@'on kill-append

source: The @code{kill-append} function
es: La funci@'on @code{kill-append}

source: The @code{kill-append} function looks like this:
es: La funci@'on @code{kill-new} se ve como as@'{@dotless{i}}:

source: (defun kill-append (string before-p &optional yank-handler) "Append STRING to the end of the latest kill in the kill ring. If BEFORE-P is non-nil, prepend STRING to the kill. @dots{} " (let* ((cur (car kill-ring))) (kill-new (if before-p (concat string cur) (concat cur string)) (or (= (length cur) 0) (equal yank-handler (get-text-property 0 'yank-handler cur))) yank-handler)))
es: (defun kill-append (string before-p &optional yank-handler) "Inserta STRING al fin del @'ultimo corte en el anillo de la muerte @emph{kill ring}. Si BEFORE-P es no nulo, inserta STRING. @dots{} " (let* ((cur (car kill-ring))) (kill-new (if before-p (concat string cur) (concat cur string)) (or (= (length cur) 0) (equal yank-handler (get-text-property 0 'yank-handler cur))) yank-handler)))

source: The @code{kill-append} function is fairly straightforward. It uses the @code{kill-new} function, which we will discuss in more detail in a moment.
es: La funci@'on @code{kill-append} es limpia. Usa la funci@'on @code{kill-new}, que discutiremos en m@'as detalle en un momento.

source: (Also, the function provides an optional argument called @code{yank-handler}; when invoked, this argument tells the function how to deal with properties added to the text, such as `bold' or `italics'.)
es: (Tambi@'en, la funci@'on provee un argumento opcional llamado @code{yank-handler}; cuando se invoque, este argumento cuenta a la funci@'on c@'omo tratar con la propiedades a@~nadidas al texto, tales como `negrilla' o `it@'alicas'.)

source: It has a @code{let*} function to set the value of the first element of the kill ring to @code{cur}. (I do not know why the function does not use @code{let} instead; only one value is set in the expression. Perhaps this is a bug that produces no problems?)
es: Eso tiene una funci@'on @code{let*} para asignar el valor del primer elemento del kill ring a @code{cur}. (No se sabe por qu@'e la funci@'on no usa @code{let}; solo un valor es asignado en la expresi@'on. @questiondown{}Quiz@'as esto es un error que no produce problemas?

source: Consider the conditional that is one of the two arguments to @code{kill-new}. It uses @code{concat} to concatenate the new text to the @sc{car} of the kill ring. Whether it prepends or appends the text depends on the results of an @code{if} expression:
es: Considera el condicional que es uno de los dos argumentos para @code{kill-new}. Eso usa @code{concat} para concatenar el nuevo texto al @sc{car} del anillo de la muerte @emph{kill ring}. Si eso se concatena atr@'as o delante depende de los resultados de una expresi@'on @code{if}:

source: If the region being killed is before the region that was killed in the last command, then it should be prepended before the material that was saved in the previous kill; and conversely, if the killed text follows what was just killed, it should be appended after the previous text. The @code{if} expression depends on the predicate @code{before-p} to decide whether the newly saved text should be put before or after the previously saved text.
es: Si la regi@'on cortada est@'a antes que la regi@'on que se cort@'o en el @'ultimo comando, entonces deber@'{@dotless{i}}a ser puesto antes que el material salvador en el anterior corte @emph{kill}; y de manera contraria, si el texto cortado sigue lo que fu@'e cortado, eso ser@'{@dotless{i}}a a@~nadido despu@'es del texto previo. La expresi@'on @code{if} depende del predicado @code{before-p} para decidir si el texto nuevamente salvado es puesto antes o despu@'es.

source: The symbol @code{before-p} is the name of one of the arguments to @code{kill-append}. When the @code{kill-append} function is evaluated, it is bound to the value returned by evaluating the actual argument. In this case, this is the expression @code{(< end beg)}. This expression does not directly determine whether the killed text in this command is located before or after the kill text of the last command; what it does is determine whether the value of the variable @code{end} is less than the value of the variable @code{beg}. If it is, it means that the user is most likely heading towards the beginning of the buffer. Also, the result of evaluating the predicate expression, @code{(< end beg)}, will be true and the text will be prepended before the previous text. On the other hand, if the value of the variable @code{end} is greater than the value of the variable @code{beg}, the text will be appended after the previous text.
es: El s@'{@dotless{i}}mbolo @code{before-p} es el nombre de uno de los argumentos a @code{kill-append}. Cuando la funci@'on @code{kill-append} se eval@'ua, se asocia al valor devuelto evaluando el argumento actual. En este caso, esta es la expresi@'on @code{(< end beg)}. Esta expresi@'on no determina directamente si el texto cortado en este comando se localiza antes o despu@'es del texto cortado del @'ultimo comando; lo que hace es determinar si el valor de la variable @code{end} es menor que el valor de la variable @code{beg}. Si es as@'{@dotless{i}}, significa que el usuario se encara al principio del b@'uffer. Tambi@'en, el resultado de evaluar la expresi@'on del predicado. @code{(< end beg)}, ser@'a verdadero y el texto se concatena antes del texto previo. Por otro lado, si el valor de la variable @code{end} es mayor que el valor del la variable @code{beg}, el texto ser@'a concatenado despu@'es del texto previo.

source: When the newly saved text will be prepended, then the string with the new text will be concatenated before the old text:
es: Cuando el texto nuevamente guardado se concatena, entonces la cadena con el nuevo texto ser@'a concatenado antes del viejo texto:

source: But if the text will be appended, it will be concatenated after the old text:
es: Pero si el texto ser@'a a@~nadido, eso ser@'a concatenado despu@'es del viejo texto:

source: To understand how this works, we first need to review the @code{concat} function. The @code{concat} function links together or unites two strings of text. The result is a string. For example:
es: Para comprender c@'omo funciona esto, primero se necesita revisar la funci@'on @code{concat}. La funci@'on @code{concat} enlaza junto o une dos cadenas de texto. El resultado es una cadena. Por ejemplo:

source: (concat "new " (car '("first element" "second element"))) @result{} "new first element"
es: (concat "nuevo " (car '("primer elemento" "segundo elemento"))) @result{} "nuevo primer elemento"

source: (concat (car '("first element" "second element")) " modified") @result{} "first element modified"
es: (concat (car '("primer elemento" "segundo elemento")) " modificado") @result{} "primer elemento modificado"

source: We can now make sense of @code{kill-append}: it modifies the contents of the kill ring. The kill ring is a list, each element of which is saved text. The @code{kill-append} function uses the @code{kill-new} function which in turn uses the @code{setcar} function.
es: Ahora puede tener sentido @code{kill-append}: eso modifica los contenidos del anillo de la muerte @emph{kill ring}. El anillo de la muerte @emph{kill ring} es una lista, en la que cada elemento es texto guardado. La funci@'on @code{kill-append} usa la funci@'on @code{kill-new} que usa la funci@'on @code{setcar}.

source: The @code{kill-new} function
es: La funci@'on @code{kill-new}

source: The @code{kill-new} function looks like this:
es: La funci@'on @code{kill-new} se ve de esta manera:

source: (defun kill-new (string &optional replace yank-handler) "Make STRING the latest kill in the kill ring. Set `kill-ring-yank-pointer' to point to it.
es: (defun kill-new (string &optional replace yank-handler) "Crea STRING el @'ultimo corte en el anillo de la muerte @emph{kill ring}. Asigna `kill-ring-yank-pointer' para apuntarlo.

source: If `interprogram-cut-function' is non-nil, apply it to STRING. Optional second argument REPLACE non-nil means that STRING will replace the front of the kill ring, rather than being added to the list. @dots{}"
es: Si `interprogram-cut-function' es no nulo, apl@'{@dotless{i}}calo a su STRING. Segundo argumento opcional REPLACE no-nulo significa que STRING reemplazar@'a el frente del kill ring, en vez de ser a@~andido a la lista. @dots{}"

source: (Notice that the function is not interactive.)
es: (Vea que la funci@'on no es interactiva.)

source: As usual, we can look at this function in parts.
es: Normalmente, se mira a esta funci@'on en partes.

source: The function definition has an optional @code{yank-handler} argument, which when invoked tells the function how to deal with properties added to the text, such as `bold' or `italics'. We will skip that.
es: La definici@'on de la funci@'on tiene un argumento opcional @code{yank-handler}, que cuando se invoca cuenta la funci@'on de c@'omo tratar con propiedades a@~nadidas al texto, tal como `negrilla' o `it@'alica'. Nosotros evitaremos esto.

source: The first line of the documentation makes sense:
es: La primer l@'{@dotless{i}}nea de la documentaci@'on tiene sentido:

source: Make STRING the latest kill in the kill ring.
es: Crea la CADENA la @'ultima copia en el anillo de la muerte @emph{kill ring}.

source: Let's skip over the rest of the documentation for the moment.
es: Permite saltarse el resto de la documentaci@'on por el momento.

source: Also, let's skip over the initial @code{if} expression and those lines of code involving @code{menu-bar-update-yank-menu}. We will explain them below.
es: Tambi@'en, permite salir de la expresi@'on inicial @code{if} y estas l@'{@dotless{i}}neas de c@'odigo involucrando @code{menu-bar-update-yank-menu}. Nosotros explicaremos debajo.

source: The critical lines are these:
es: Las l@'{@dotless{i}}neas cr@'{@dotless{i}}ticas son estas:

source: (if (and replace kill-ring) ;; @r{then} (setcar kill-ring string)
es: (if (and replace kill-ring) ;; @r{entonces} (setcar kill-ring string)

source: ;; @r{else} (push string kill-ring)
es: ;; @r{resto} (push string kill-ring)

source: The conditional test is @w{@code{(and replace kill-ring)}}. This will be true when two conditions are met: the kill ring has something in it, and the @code{replace} variable is true.
es: El test condicional es @w{@code{(and replace kill-ring)}}. Esto ser@'a verdad cuando dos condiciones se encuentran: el anillo de la muerte @emph{kill ring} tiene alguna cosa dentro, y la variable @code{replace} es verdad.

source: When the @code{kill-append} function sets @code{replace} to be true and when the kill ring has at least one item in it, the @code{setcar} expression is executed:
es: Cuando la funci@'on @code{kill-append} asigna @code{replace} para ser cierto y cuando el anillo de la muerte @emph{kill ring} tiene al menos un @'{@dotless{i}}tem en eso, la expresi@'on @code{setcar} es ejecutada.

source: The @code{setcar} function actually changes the first element of the @code{kill-ring} list to the value of @code{string}. It replaces the first element.
es: La funci@'on @code{setcar} actualemten cambia el primer elemento del anillo de la muerte (@code{kill-ring} lista al valor de @code{string}. Eso reemplaza el primer elemento.

source: On the other hand, if the kill ring is empty, or replace is false, the else-part of the condition is executed:
es: Por otro lado, si el kill ring est@'a vac@'{@dotless{i}}o, o reemplazar es falso, la else-part de la condici@'on est@'a ejecutado:

source: @code{push} puts its first argument onto the second. It is similar to the older
es: @code{push} pone su primer argumento dentro del segundo. Es similar al viejo.

source: or the newer
es: o el nuevo

source: When it is false, the expression first constructs a new version of the kill ring by prepending @code{string} to the existing kill ring as a new element (that is what the @code{push} does). Then it executes a second @code{if} clause. This second @code{if} clause keeps the kill ring from growing too long.
es: Cuando eso es falso, la expresi@'on primero construye una nueva versi@'on del anillo de la muerte @emph{kill ring} a@~nadiendo @code{string} al anillo de la muerte @emph{kill ring} como un nuevo elemento (que es lo que @code{push} hace). Entonces ejecuta un segundo @code{if} cl@'ausula. Este segundo @code{if} cl@'ausula guarada el anillo de la muerte @emph{kill ring} desde el creciente demasiado largo.

source: Let's look at these two expressions in order.
es: D@'ejanos mirar estas dos expresiones en orden.

source: The @code{push} line of the else-part sets the new value of the kill ring to what results from adding the string being killed to the old kill ring.
es: La l@'{@dotless{i}}nea @code{push} de la parte else asigna el nuevo valor del kill ring @emph{anillo de la muerte} a que resultados a@~naden la cadena siendo cortada al viejo anillo de la muerte @emph{kill ring}

source: We can see how this works with an example.
es: Nosotros podemos ver c@'omo esto funciona con un ejemplo.

source: First,
es: Primero,

source: (setq example-list '("here is a clause" "another clause"))
es: (setq example-list '("aqui una clausula" "otra clausula"))

source: After evaluating this expression with @kbd{C-x C-e}, you can evaluate @code{example-list} and see what it returns:
es: Despu@'es de evaluar esta expresi@'on con @kbd{C-x C-e}, se puede evaluar @code{example-list} y mira lo que devuelve:

source: example-list @result{} ("here is a clause" "another clause")
es: example-list @result{} ("aqu@'{@dotless{i}} hay una cla@'usula" "otra cla@'usula")

source: Now, we can add a new element on to this list by evaluating the following expression:
es: Ahora, se puede a@~nadir un nuevo elemento en esta lista evaluando la siguiente expresi@'on:

source: push, @r{example}
es: push, @r{ejemplo}

source: (push "a third clause" example-list)
es: (push "una tercera cl@'ausula" lista-de-ejemplo)

source: When we evaluate @code{example-list}, we find its value is:
es: Cuando se eval@'ua @code{example-list}, se encuentra su valor es:

source: example-list @result{} ("a third clause" "here is a clause" "another clause")
es: example-list @result{} ("una tercera cla@'usula" "aqu@'{@dotless{i}} hay una cla@'usula" "otra cla@'usula")

source: Thus, the third clause is added to the list by @code{push}.
es: De este modo, la tercera cla@'usula se a@~nade a la lista con @code{push}.

source: Now for the second part of the @code{if} clause. This expression keeps the kill ring from growing too long. It looks like this:
es: Ahora para la segunda parte de la cla@'usula @code{if}. Esta expresi@'on deja el kill ring desde lo creciente demasiado largo. Eso se ve de la siguiente manera:

source: The code checks whether the length of the kill ring is greater than the maximum permitted length. This is the value of @code{kill-ring-max} (which is 60, by default). If the length of the kill ring is too long, then this code sets the last element of the kill ring to @code{nil}. It does this by using two functions, @code{nthcdr} and @code{setcdr}.
es: El c@'odigo chequea si el tama@~no del anillo de la muerte @emph{kill ring} es m@'as grande que el m@'aximo tama@~no permitido. Este es el valor de @code{kill-ring-max} (que es 60, por defecto). Si el tama@~no del anillo de la muerte @emph{kill ring} es demasiado largo, entonces este c@'odigo asigna el @'ultimo elemento del anillo de la muerte @emph{kill ring} a @code{nil}. Eso hace esto usando dos funciones, @code{nthcdr} y @code{setcdr}.

source: We looked at @code{setcdr} earlier (@pxref{setcdr, , @code{setcdr}}). It sets the @sc{cdr} of a list, just as @code{setcar} sets the @sc{car} of a list. In this case, however, @code{setcdr} will not be setting the @sc{cdr} of the whole kill ring; the @code{nthcdr} function is used to cause it to set the @sc{cdr} of the next to last element of the kill ring---this means that since the @sc{cdr} of the next to last element is the last element of the kill ring, it will set the last element of the kill ring.
es: Nosotros vemos que @code{setcdr} temprano (@pxref{setcdr, , @code{setcdr}}). Eso asigna el @sc{cdr} de una lista, solo como @code{setcar} asigna el @sc{car} de una lista. En este caso, sin embargo, @code{setcdr} no estar@'a configurando el @sc{cdr} del kill ring completo; la funci@'on @code{nthcdr} es usada para causarlo para asignar el @sc{cdr} del siguiente al @'ultimo elemento del kill ring --- esto significa que desde el @sc{cdr} del siguiente al @'ultimo elemnto del kill ring @emph{anillo de la muerte}, eso asignar@'a el @'ultimo elemento del kill ring @emph{anillo de la muerte}.

source: nthcdr, @r{example}
es: nthcdr, @r{ejemplo}

source: The @code{nthcdr} function works by repeatedly taking the @sc{cdr} of a list---it takes the @sc{cdr} of the @sc{cdr} of the @sc{cdr} @dots{} It does this @var{N} times and returns the results. (@xref{nthcdr, , @code{nthcdr}}.)
es: La funci@'on @code{nthcdr} funciona repetidamente tomando el @sc{cdr} de una lista --- eso toma el @sc{cdr} del @sc{cdr} del @sc{cdr} @dots{}. Eso hace esto @var{N} veces y devuelve los resultados. (@xref{nthcdr, , @code{nthcdr}}.)

source: setcdr, @r{example}
es: setcdr, @r{ejemplo}

source: Thus, if we had a four element list that was supposed to be three elements long, we could set the @sc{cdr} of the next to last element to @code{nil}, and thereby shorten the list. (If you set the last element to some other value than @code{nil}, which you could do, then you would not have shortened the list. @xref{setcdr, , @code{setcdr}}.)
es: De este modo, si teniamos una lista de cuatro elemento que era supuestamente de tres elementos, se podr@'{@dotless{i}}a asignar el @sc{cdr} del siguiente al @'ultimo elemento a @code{nil}, y por eso se ordena la lista. (Si se asigna el @'ultimo elemento a alg@'un otro valor a @code{nil}, que se podr@'{@dotless{i}}a hacer, entonces no se habr@'{@dotless{i}}a ordenado la lista. @xref{setcdr, , @code{setcdr}}.)

source: You can see shortening by evaluating the following three expressions in turn. First set the value of @code{trees} to @code{(maple oak pine birch)}, then set the @sc{cdr} of its second @sc{cdr} to @code{nil} and then find the value of @code{trees}:
es: Se puede ver ordenando la evaluaci@'on de las siguientes tres expresiones en turno. Primero asigna el valor de @code{arboles} a @code{(arce encina pino abedul)} entonces asigna el @sc{cdr} de su segundo @sc{cdr} y entonces encuentra el valor de @code{arboles}.

source: (setq trees '(maple oak pine birch)) @result{} (maple oak pine birch)
es: (setq arboles '(arce encina pino abedul)) @result{} (arce encina pino abedul)

source: (setcdr (nthcdr 2 trees) nil) @result{} nil
es: (setcdr (nthcdr 2 arboles) nil) @result{} nil

source: trees @result{} (maple oak pine)
es: @'arboles @result{} (arce encina pino)

source: (The value returned by the @code{setcdr} expression is @code{nil} since that is what the @sc{cdr} is set to.)
es: (El valor devuelto por la expresi@'on @code{setcdr} es @code{nil} desde que es que el @sc{cdr} es asignado.)

source: To repeat, in @code{kill-new}, the @code{nthcdr} function takes the @sc{cdr} a number of times that is one less than the maximum permitted size of the kill ring and @code{setcdr} sets the @sc{cdr} of that element (which will be the rest of the elements in the kill ring) to @code{nil}. This prevents the kill ring from growing too long.
es: Para repetir, en @code{kill-new}, la funci@'on @code{nthcdr} toma el @sc{cdr} un n@'umero de veces que es uno menos que el tama@~no m@'aximo permitido del anillo de la muerte @emph{kill ring} y @code{setcdr} asigna el @sc{cdr} de este elemento (que ser@'a el resto de los elementos en el anillo muerte) para @code{nil}. Esto previene el anillo de la muerte @emph{kill ring} desde lo que crece demasiado largo.
