Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: This introduction to @cite{Programming in Emacs Lisp} has a companion document,
es: Esta introducci@'on de @cite{Programaci@'on en Emacs Lisp} viene acompa@~nada de un documento complementario.

source: @cite{The GNU Emacs Lisp Reference Manual}.
es: @cite{El Manual de Referencia de GNU Emacs}.

source: @ref{Top, , The GNU Emacs Lisp Reference Manual, elisp, The GNU Emacs Lisp Reference Manual}.
es: @ref{Arriba, , El Manual de Referencia de GNU Emacs Lisp, El Manual de Referencia de GNU Emacs Lisp}.

source: The reference manual has more detail than this introduction. In the reference manual, all the information about one topic is concentrated in one place. You should turn to it if you are like the programmer quoted above. And, of course, after you have read this @cite{Introduction}, you will find the @cite{Reference Manual} useful when you are writing your own programs.
es: El manual de referencia tiene m@'as detalles que esta introducci@'on. En el manual de referencia, toda la informaci@'on sobre un asunto est@'a concentrada en un lugar. Se debe cambiar si es como el programador citado arriba. Y, por supuesto, despu@'es de haber leido esta @cite{Introducci@'on}, ser@'a muy @'util consultar el @cite{Manual de Referencia} al escribir programas propios.

source: Lisp History
es: Historia de Lisp

source: Lisp history
es: Historia de Lisp

source: Lisp was first developed in the late 1950s at the Massachusetts Institute of Technology for research in artificial intelligence. The great power of the Lisp language makes it superior for other purposes as well, such as writing editor commands and integrated environments.
es: Lisp fu@'e originariamente desarrollado en los 50 en el Instituto Tecnol@'ogico de Massachusetts para investigar en inteligencia artificial. El gran poder del lenguaje Lisp lo hace superior para otros prop@'ositos tambi@'en, tal como escribir comandos de edici@'on y entornos integrados.

source: GNU Emacs Lisp is largely inspired by Maclisp, which was written at MIT in the 1960s. It is somewhat inspired by Common Lisp, which became a standard in the 1980s. However, Emacs Lisp is much simpler than Common Lisp. (The standard Emacs distribution contains an optional extensions file, @file{cl.el}, that adds many Common Lisp features to Emacs Lisp.)
es: GNU Emacs Lisp est@'a fuertemente inspirado en Maclisp, que est@'a escrito en el MIT en los sesenta. Est@'a en cierto modo inspirado en Common Lisp, que llega a ser un est@'andar en los 80. Sin embargo, Emacs Lisp es mucho m@'as simple que Common Lisp. (La distribuci@'on est@'andar de Emacs contiene un fichero de extensiones opcional, @file{cl.el}, que a@~nade muchas funcionalidades a Emacs Lisp.)

source: A Note for Novices
es: Una nota para principiantes

source: If you don't know GNU Emacs, you can still read this document profitably. However, I recommend you learn Emacs, if only to learn to move around your computer screen. You can teach yourself how to use Emacs with the on-line tutorial. To use it, type @kbd{C-h t}. (This means you press and release the @key{CTRL} key and the @kbd{h} at the same time, and then press and release @kbd{t}.)
es: Aunque no se conozca GNU Emacs, este documento puede resultar @'util. Sin embargo, es mejor aprender Emacs, al menos aprender a moverse alrededor de la pantalla del ordenador. Uno puede aprender de manera autodidacta c@'omo usar Emacs con el tutorial on-line. Para usarlo, se debe escribir @kbd{C-h t}. (Esto significa que se presione la tecla @key{CTRL} y la @kbd{h} al mismo tiempo, y despu@'es se presiona @kbd{t}).

source: Also, I often refer to one of Emacs's standard commands by listing the keys which you press to invoke the command and then giving the name of the command in parentheses, like this: @kbd{M-C-\} (@code{indent-region}). What this means is that the @code{indent-region} command is customarily invoked by typing @kbd{M-C-\}. (You can, if you wish, change the keys that are typed to invoke the command; this is called @dfn{rebinding}. @xref{Keymaps, , Keymaps}.) The abbreviation @kbd{M-C-\} means that you type your @key{META} key, @key{CTRL} key and @key{\} key all at the same time. (On many modern keyboards the @key{META} key is labeled @key{ALT}.) Sometimes a combination like this is called a keychord, since it is similar to the way you play a chord on a piano. If your keyboard does not have a @key{META} key, the @key{ESC} key prefix is used in place of it. In this case, @kbd{M-C-\} means that you press and release your @key{ESC} key and then type the @key{CTRL} key and the @key{\} key at the same time. But usually @kbd{M-C-\} means press the @key{CTRL} key along with the key that is labeled @key{ALT} and, at the same time, press the @key{\} key.
es: Con frecuencia, tambi@'en aludo a uno de los comandos de Emacs est@'andar listando las teclas que se presionan para invocar el comando y, luego dar el nombre del comando entre par@'entesis, asi: @kbd{M-C-\} (@code{indent-region}). Esto significa invocar el comando @code{indent-region} presionando @kbd{M-C-\}.(Si lo desea, se pueden cambiar las teclas que son escritas para invocar el comando; esto se llama @dfn{rebinding}. @xref{Mapas de teclado, , Mapas de Teclado}.) La abreviaci@'on @kbd{M-C-\} significa que se presiona la tecla @key{META}, @key{CTRL}, y @key{\} todo al mismo tiempo. (En muchos teclados modernos la tecla @key{META} es etiquetada con @key{ALT}.) Algunas veces una combinaci@'on como esta se llama @emph{keychord}, puesto que es similar a tocar un acorde en un piano. Si el teclado no tiene una tecla @key{META}, en su lugar se usa la tecla @key{ESC} como prefijo. En este caso @kbd{M-C-\} significa que se presiona y libera @key{ESC} y luego presiona la tecla @key{CTRL} y la tecla @key{\} al mismo tiempo. Pero normalmente @kbd{M-C-\} significa presionar la tecla @key{CTRL} junto a la tecla que est@'a etiquetada @key{ALT} y, al mismo tiempo, presionar la tecla @key{\}.

source: In addition to typing a lone keychord, you can prefix what you type with @kbd{C-u}, which is called the `universal argument'. The @kbd{C-u} keychord passes an argument to the subsequent command. Thus, to indent a region of plain text by 6 spaces, mark the region, and then type @w{@kbd{C-u 6 M-C-\}}. (If you do not specify a number, Emacs either passes the number 4 to the command or otherwise runs the command differently than it would otherwise.) @xref{Arguments, , Numeric Arguments, emacs, The GNU Emacs Manual}.
es: Adem@'as de pulsar una sola combinaci@'on de teclas, se puede prefijar lo que se escribe con @kbd{C-u}, que es llamado el `argumento universal'. El atajo @kbd{C-u} pasa a ser un argumento para el comando subsiguiente. De este modo, para indentar una regi@'on de texto plano a 6 espacios, se marca la regi@'on, y entonces se presiona @w{@kbd{C-u 6 M-C-\}}. (Si no se especifica un n@'umero, Emacs pasa el n@'umero 4 al comando o de otra manera ejecuta el comando de manera diferente). @xref{Argumentos, , Argumentos Num@'ericos, emacs, El Manual de GNU Emacs}.

source: If you are reading this in Info using GNU Emacs, you can read through this whole document just by pressing the space bar, @key{SPC}. (To learn about Info, type @kbd{C-h i} and then select Info.)
es: Si se est@'a leyendo esto en Info usando GNU Emacs, se puede avanzar a trav@'es de este documento completo solo presionando la barra de espacio, @key{SPC}. (Para aprender acerca de Info, presiona @kbd{C-h i} y luego selecciona Info.)

source: A note on terminology: when I use the word Lisp alone, I often am referring to the various dialects of Lisp in general, but when I speak of Emacs Lisp, I am referring to GNU Emacs Lisp in particular.
es: Una nota en terminolog@'{@dotless{i}}a: cuando uso la palabra Lisp sola, con frecuencia me estoy refiriendo a los dialectos de Lisp en general, pero cuando hablo de Emacs Lisp, me estoy refiriendo a GNU Emacs Lisp en particular.

source: My thanks to all who helped me with this book. My especial thanks to @r{Jim Blandy}, @r{Noah Friedman}, @w{Jim Kingdon}, @r{Roland McGrath}, @w{Frank Ritter}, @w{Randy Smith}, @w{Richard M. Stallman}, and @w{Melissa Weisshaus}. My thanks also go to both @w{Philip Johnson} and @w{David Stampe} for their patient encouragement. My mistakes are my own.
es: Estoy agradecido a todas las personas que me ayudaron con este libro. Especialmente agradecido a @r{Jim Blandy}, @r{Noah Friedman}, @w{Jim Kingdon}, @r{Roland McGrath}, @w{Frank Ritter}, @w{Randy Smith}, @w{Richard M. Stallman}, y @w{Melissa Weisshaus}. Gracias tambi@'en a @w{Philip Johnson} y @w{David Stampe} por su @'animo paciente. Mis errores son m@'{@dotless{i}}os.

source: To the untutored eye, Lisp is a strange programming language. In Lisp code there are parentheses everywhere. Some people even claim that the name stands for `Lots of Isolated Silly Parentheses'. But the claim is unwarranted. Lisp stands for LISt Processing, and the programming language handles @emph{lists} (and lists of lists) by putting them between parentheses. The parentheses mark the boundaries of the list. Sometimes a list is preceded by a single apostrophe or quotation mark, @samp{'}@footnote{The single apostrophe or quotation mark is an abbreviation for the function @code{quote}; you need not think about functions now; functions are defined in @ref{Making Errors, , Generate an Error Message}.} Lists are the basis of Lisp.
es: Para el ojo inexperto, Lisp es un lenguaje de programaci@'on extra@~no. En c@'odigo Lisp hay par@'entesis por todas partes. Algunas personas incluso reclaman que el nombre signfica `Lots of Isolated Silly Parentheses' (`Montones de Par@'entesis Aislados Est@'upidos'). Pero la protesta no tiene fundamento. Lisp es para procesamiento de listas, y el lenguaje de programaci@'on maneja @emph{listas} (y listas de listas) poni@'endolas entre par@'entesis. Los par@'entesis marcan los l@'{@dotless{i}}mites de la lista. Algunas veces una lista va precedida por un ap@'ostrofe simple o una marca de cita, @samp{'}@footnote{El ap@'ostrofo o comilla es una abreviaci@'on para la funci@'on @code{quote}; no necesitas pensar acerca de funciones ahora; las funciones se definen en @ref{Creando errores, , Generar un mensaje de error}.} Las listas son el fundamento de Lisp.

source: In Lisp, a list looks like this: @code{'(rose violet daisy buttercup)}. This list is preceded by a single apostrophe. It could just as well be written as follows, which looks more like the kind of list you are likely to be familiar with:
es: En Lisp, una lista como esta: @code{'(rosa violeta margarita bot@'ondeoro)}. Esta lista es precedida por una comilla. Bien, podr@'{@dotless{i}}a estar escrita de la siguente manera, que se parece m@'as al tipo de lista con la que se est@'a familiarizado:

source: '(rose violet daisy buttercup)
es: '(rosa violeta margarita bot@'ondeoro)

source: The elements of this list are the names of the four different flowers, separated from each other by whitespace and surrounded by parentheses, like flowers in a field with a stone wall around them.
es: Los elementos de esta lista son los nombres de 4 flores diferentes, separados por espacios en blanco y rodeados de par@'entesis, como flores en un campo con un muro de piedras alrededor de ellas.

source: Flowers in a field
es: Flores en un campo

source: Numbers, Lists inside of Lists
es: N@'umeros, listas dentro de listas

source: Lists can also have numbers in them, as in this list: @code{(+ 2 2)}. This list has a plus-sign, @samp{+}, followed by two @samp{2}s, each separated by whitespace.
es: Las listas pueden tambi@'en tener n@'umeros dentro, como en esta lista: @code{(+ 2 2)}. Esta lista tiene un signo m@'as, @samp{+}, seguido por dos @samp{2}, cada uno separado por espacios en blanco.

source: In Lisp, both data and programs are represented the same way; that is, they are both lists of words, numbers, or other lists, separated by whitespace and surrounded by parentheses. (Since a program looks like data, one program may easily serve as data for another; this is a very powerful feature of Lisp.) (Incidentally, these two parenthetical remarks are @emph{not} Lisp lists, because they contain @samp{;} and @samp{.} as punctuation marks.)
es: En Lisp, tanto datos como programas est@'an representados de la misma manera; es decir, s@'on a la vez listas de palabras, n@'umeros, u otras listas, separadas por espacios en blanco y rodeadas de par@'entesis. (Puesto que un programa son datos, un programa puede f@'acilmente servir datos a otros programas; esta es una funcionalidad muy poderosa de Lisp.) (Incidentalmente, estas dos marcas de par@'entesis @emph{no} son listas Lisp, porque contienen @samp{;} y @samp{.} como marcas de puntuaci@'on.)

source: Here is another list, this time with a list inside of it:
es: Aqu@'{@dotless{i}} hay otra lista, esta vez con una lista dentro:

source: '(this list has (a list inside of it))
es: '(esta lista tiene (una lista dentro de ella))

source: The components of this list are the words @samp{this}, @samp{list}, @samp{has}, and the list @samp{(a list inside of it)}. The interior list is made up of the words @samp{a}, @samp{list}, @samp{inside}, @samp{of}, @samp{it}.
es: Los componentes de esta lista son las palabras @samp{esta}, @samp{lista}, @samp{tiene}, y la lista @samp{(una lista dentro de ella)}. La lista interior se construye con las palabras @samp{una}, @samp{lista}, @samp{dentro}, @samp{de}, @samp{ella}.

source: In Lisp, what we have been calling words are called @dfn{atoms}. This term comes from the historical meaning of the word atom, which means `indivisible'. As far as Lisp is concerned, the words we have been using in the lists cannot be divided into any smaller parts and still mean the same thing as part of a program; likewise with numbers and single character symbols like @samp{+}. On the other hand, unlike an ancient atom, a list can be split into parts. (@xref{car cdr & cons, , @code{car} @code{cdr} & @code{cons} Fundamental Functions}.)
es: En Lisp, lo que hemos estado llamando palabras son en realidad @dfn{@'atomos}. Este t@'ermino viene del significado hist@'orico de la palabra @'atomo, que significa `indivisible'. En lo que a Lisp concierne, las palabras que hemos estado usando en las listas no pueden ser divididas en peque@~nas partes, sin perder su significado dentro del programa; lo mismo ocurre con n@'umeros y s@'{@dotless{i}}mbolos de un caracterer como @samp{+}. Por otro lado, a diferencia de un @'atomo, una lista puede ser dividida en peque@~nas partes. Ver @ref{Car cdr y cons, , @code{car}, @code{cdr} y @code{cons}, Funciones Fundamentales}.

source: In a list, atoms are separated from each other by whitespace. They can be right next to a parenthesis.
es: En una lista, los @'atomos se separan unos de otros por espacios en blanco. Pueden ir pegados a un par@'entesis.

source: @samp{empty list} defined
es: @samp{lista vac@'{@dotless{i}}a} definida

source: Technically speaking, a list in Lisp consists of parentheses surrounding atoms separated by whitespace or surrounding other lists or surrounding both atoms and other lists. A list can have just one atom in it or have nothing in it at all. A list with nothing in it looks like this: @code{()}, and is called the @dfn{empty list}. Unlike anything else, an empty list is considered both an atom and a list at the same time.
es: T@'ecnicamente hablando, una lista en Lisp consiste de par@'entesis alrededor de @'atomos separados por espacios en blanco o alrededor de otras lista o alrededor de ambos @'atomos u otras listas. Una lista puede tener solo un @'atomo o no tener absolutamente nada en ella. Una lista con nada dentro se ve as@'{@dotless{i}}: @code{()}, y se llama @dfn{lista vac@'{@dotless{i}}a}. A diferencia de cualquier otra cosa, una lista vac@'{@dotless{i}}a es tanto un @'atomo, como una lista al mismo tiempo.

source: Symbolic expressions, introduced
es: Expresiones simb@'olicas, introducidas

source: @samp{expression} defined
es: @samp{expresi@'on} definida

source: @samp{form} defined
es: @samp{forma} definida

source: The printed representation of both atoms and lists are called @dfn{symbolic expressions} or, more concisely, @dfn{s-expressions}. The word @dfn{expression} by itself can refer to either the printed representation, people use the term @dfn{expression} indiscriminately. (Also, in many texts, the word @dfn{form} is used as a synonym for expression.)
es: La representaci@'on impresa de @'atomos y listas se llama @dfn{expresiones simb@'olicas} o, m@'as concisamente, @dfn{s-expresiones}. La palabra @dfn{expresi@'on} por s@'{@dotless{i}} misma puede referir o bien a la representaci@'on impresa, o al @'atomo o a la lista como se maneja internamente en el ordenador. Con frecuencia, las personas usan el t@'ermino @dfn{expresi@'on} indiscriminadamente. (Tambi@'en, en muchos textos, la palabra @dfn{forma} se usa como un sin@'onimo para la expresi@'on.)

source: Incidentally, the atoms that make up our universe were named such when they were thought to be indivisible; but it has been found that physical atoms are not indivisible. Parts can split off an atom or it can fission into two parts of roughly equal size. Physical atoms were named prematurely, before their truer nature was found. In Lisp, certain kinds of atom, such as an array, can be separated into parts; but the mechanism for doing this is different from the mechanism for splitting a list. As far as list operations are concerned, the atoms of a list are unsplittable.
es: Por cierto, los @'atomos que componen nuestro universo fueron nombrados as@'i cuando se pensaba que eran indivisibles; pero pero se ha encontrado que los @'atomos fisicos no son indivisibles. Las partes pueden dividir un @'atomo o puede fisionarse en 2 partes de igual tama@~no. Los @'atomos f@'{@dotless{i}}sicos se nombraron prematuramente, antes de que su verdadera naturaleza fuese encontrada. En Lisp, ciertos tipos de @'atomos, como un array, pueden ser separados en partes; pero el mecanismo de hacer esto es diferente de el mecanismo para dividir una lista. En lo que se refiere a operaciones de lista, los @'atomos de una lista son indivisibles.

source: As in English, the meanings of the component letters of a Lisp atom are different from the meaning the letters make as a word. For example, the word for the South American sloth, the @samp{ai}, is completely different from the two words, @samp{a}, and @samp{i}.
es: Como en español, el significado de las letras que componen un @'atomo Lisp difiere del significado de las letras compuestas como una palabra. Por ejemplo, la expresi@'on @samp{ay}, es completamente diferente de las dos palabras @samp{a}, e @samp{y}.

source: There are many kinds of atom in nature but only a few in Lisp: for example, @dfn{numbers}, such as 37, 511, or 1729, and @dfn{symbols}, such as @samp{+}, @samp{foo}, or @samp{forward-line}. The words we have listed in the examples above are all symbols. In everyday Lisp conversation, the word ``atom'' is not often used, because programmers usually try to be more specific about what kind of atom they are dealing with. Lisp programming is mostly about symbols (and sometimes numbers) within lists. (Incidentally, the preceding three word parenthetical remark is a proper list in Lisp, since it consists of atoms, which in this case are symbols, separated by whitespace and enclosed by parentheses, without any non-Lisp punctuation.)
es: Hay muchos tipos de @'atomos en la naturaleza, pero solo unos pocos en Lisp: por ejemplo, @dfn{n@'umeros}, tales como 37, 511, o 1729, y @dfn{s@'{@dotless{i}}mbolos}, tales como @samp{+}, @samp{foo}, o @samp{forward-line}. Las palabras que hemos listado en los ejemplos anteriores son todos s@'{@dotless{i}}mbolos. En una conversaci@'on cotidiana de Lisp, la palabra ``@'atomo'' no se usa con frecuencia, porque los programadores normalmente intentan ser m@'as espec@'{@dotless{i}}ficos acerca de que tipo de @'atomo est@'an tratando. La programaci@'on Lisp es sobre todo de s@'{@dotless{i}}mbolos (y algunas veces n@'umeros) con listas. (De ese modo, tres palabras rodeadas de par@'entesis son una apropiada lista en Lisp, ya que consiste de @'atomos, que en este caso son s@'{@dotless{i}}mbolos, separados por espacios en blanco y cerrados por par@'entesis, sin ninguna puntuaci@'on no Lisp.)

source: Text between double quotation marks---even sentences or paragraphs---is also an atom. Here is an example:
es: Texto entre comillas---incluso frases o p@'arrafos---son tambi@'en un @'atomo. Aqu@'{@dotless{i}} hay un ejemplo:

source: Text between double quotation marks
es: Texto entre comillas

source: '(this list includes "text between quotation marks.")
es: '(esta lista incluye "texto entre comillas.")

source: @samp{string} defined
es: @samp{cadena} definida

source: In Lisp, all of the quoted text including the punctuation mark and the blank spaces is a single atom. This kind of atom is called a @dfn{string} (for `string of characters') and is the sort of thing that is used for messages that a computer can print for a human to read. Strings are a different kind of atom than numbers or symbols and are used differently.
es: En Lisp, todo el texto citado incluyendo la marca de puntuaci@'on y los espacios en blanco son un solo @'atomo. Este tipo de @'atomo es llamado @dfn{string} (por `cadena de caracteres') y es el tipo de cosa que es usada para mensajes que un ordenador puede imprimir para que un humano lea. Las cadenas son un tipo de @'atomo diferente a los n@'umeros, o s@'{@dotless{i}}mbolos y se usan de manera diferente.

source: Whitespace in lists
es: Espacio en blanco en listas

source: The amount of whitespace in a list does not matter. From the point of view of the Lisp language,
es: La cantidad de espacios en blanco en una lista no importa. Desde el punto de vista del lenguaje Lisp,

source: '(this list looks like this)
es: '(esta lista parece esto)

source: is exactly the same as this:
es: es exactamente lo mismo que esto:

source: '(this list looks like this)
es: '(esta lista parece esto)

source: Both examples show what to Lisp is the same list, the list made up of the symbols @samp{this}, @samp{list}, @samp{looks}, @samp{like}, and @samp{this} in that order.
es: Ambos ejemplos muestran que en Lisp es la misma lista, la lista hecha de los s@'{@dotless{i}}mbolos @samp{esta}, @samp{lista}, @samp{parece}, y @samp{esto} en este orden.

source: Extra whitespace and newlines are designed to make a list more readable by humans. When Lisp reads the expression, it gets rid of all the extra whitespace (but it needs to have at least one space between atoms in order to tell them apart.)
es: Los espacios en blanco adicionales y los saltos de l@'inea est@'an dise@~nados para crear una lista m@'as legible por humanos. Cuando Lisp lee la expresi@'on, asimila los espacios en blanco extra (pero necesita tener al menos un espacio entre @'atomos en orden para contarlos aparte.)
