Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: (defun triangle (number) ; @r{Second version.} "Return sum of numbers 1 through NUMBER inclusive." (let ((total 0)) (while (> number 0) (setq total (+ total number)) (setq number (1- number))) total))
es: (defun triangle (number) ; @r{Segunda versi@'on.} "Devuelve la suma de n@'umeros 1 a trav@'es de NUMBER inclusive." (let ((total 0)) (while (> number 0) (setq total (+ total number)) (setq number (1- number))) total))

source: In brief, a properly written @code{while} loop will consist of three parts:
es: En breve, un bucle @code{while} apropiadamente escrito consistir@'a de tres partes:

source: A test that will return false after the loop has repeated itself the correct number of times.
es: Un test que devuelva falso despu@'es de que el bucle ha repetido por s@'{@dotless{i}} mismo el n@'umero de veces correcto.

source: An expression the evaluation of which will return the value desired after being repeatedly evaluated.
es: Una expresi@'on de la evaluaci@'on de que devolver@'a el valor deseado despu@'es de ser repetidamente evaluado.

source: An expression to change the value passed to the true-or-false-test so that the test returns false after the loop has repeated itself the right number of times.
es: Una expresi@'on para cambiar el valor pasado al true-or-false-test as@'{@dotless{i}} el test devuelve falso despu@'es de que el bucle se ha repetido por s@'{@dotless{i}} mismo el n@'umero de veces correcto.

source: dolist dotimes
es: Dolist y dotimes

source: In addition to @code{while}, both @code{dolist} and @code{dotimes} provide for looping. Sometimes these are quicker to write than the equivalent @code{while} loop. Both are Lisp macros. (@xref{Macros, , Macros, elisp, The GNU Emacs Lisp Reference Manual}. )
es: Adem@'as de @code{while}, tanto @code{dolist} como @code{dotimes} proveen un bucle. Algunas veces estos son r@'apidos para escribir el bucle equivalente @code{while}. Ambos son macros Lisp. (@xref{Macros, , Macros, elisp, El Manual de Referencia GNU Emacs Lisp}.)

source: @code{dolist} works like a @code{while} loop that `@sc{cdr}s down a list': @code{dolist} automatically shortens the list each time it loops---takes the @sc{cdr} of the list---and binds the @sc{car} of each shorter version of the list to the first of its arguments.
es: @code{dolist} funciona como un bucle @code{while} con `@sc{cdr}s que bajan la lista': @code{dolist} autom@'aticamente ordena la lista cada vez que la lista hace bucles --- toma la @sc{cdr} de la lista --- y asocia el @sc{car} de cada versi@'on ordenada de la lista al primero de sus argumentos.

source: @code{dotimes} loops a specific number of times: you specify the number.
es: @code{dotimes} repite el bucle un n@'umero espec@'{@dotless{i}}fico de veces: tu especificas el n@'umero.

source: The @code{dolist} Macro
es: La macro @code{dolist}

source: Suppose, for example, you want to reverse a list, so that ``first'' ``second'' ``third'' becomes ``third'' ``second'' ``first''.
es: Sup@'on, por ejemplo, que quieres invertir una lista, as@'{@dotless{i}} que ``primero'', ``segundo'', ``tercero'' llega a ser ``tercero'', ``segundo'', ``primero''.

source: In practice, you would use the @code{reverse} function, like this:
es: En la pr@'actica, usar@'{@dotless{i}}as la funci@'on @code{reverse}, como esta:

source: (reverse animals)
es: (reverse animales)

source: Here is how you could reverse the list using a @code{while} loop:
es: Aqu@'{@dotless{i}} se ve c@'omo se podr@'{@dotless{i}}a invertir la lista usando un bucle @code{while}:

source: (defun reverse-list-with-while (list) "Using while, reverse the order of LIST." (let (value) ; make sure list starts empty (while list (setq value (cons (car list) value)) (setq list (cdr list))) value))
es: (defun reverse-list-with-while (list) "Usando while, invierte el orden de LIST." (let (value) ; asegura que la lista comienza vac@'{@dotless{i}}a (while list (setq value (cons (car list) value)) (setq list (cdr list))) value))

source: (reverse-list-with-while animals)
es: (reverse-list-with-while animales)

source: And here is how you could use the @code{dolist} macro:
es: Y aqu@'{@dotless{i}} se ve c@'omo podr@'{@dotless{i}}a usarse la macro @code{dolist}:

source: (defun reverse-list-with-dolist (list) "Using dolist, reverse the order of LIST." (let (value) ; make sure list starts empty (dolist (element list value) (setq value (cons element value)))))
es: (defun reverse-list-with-dolist (list) "Usando dolist, reverse, la orden de la LISTA." (let (value) ; asegura que la lista empieza vac@'{@dotless{i}}a (dolist (element list value) (setq value (cons element value)))))

source: In Info, you can place your cursor after the closing parenthesis of each expression and type @kbd{C-x C-e}; in each case, you should see
es: En Info, se puede localizar su cursor despu@'es de cerrar par@'entesis de cada expresi@'on y escribir @kbd{C-x C-e}; en cada caso, se ver@'{@dotless{i}}a

source: (tiger lion giraffe gazelle)
es: (tigre leon jirafa gacela)

source: in the echo area.
es: en el @'area echo.

source: For this example, the existing @code{reverse} function is obviously best. The @code{while} loop is just like our first example (@pxref{Loop Example, , A @code{while} Loop and a List}). The @code{while} first checks whether the list has elements; if so, it constructs a new list by adding the first element of the list to the existing list (which in the first iteration of the loop is @code{nil}). Since the second element is prepended in front of the first element, and the third element is prepended in front of the second element, the list is reversed.
es: Para este ejemplo, la funci@'on @code{reverse} existente es obviamente la mejor. El bucle @code{while} es solo como nuestro primer ejemplo (@pxref{Ejemplo de bucle, , Un bucle @code{while} y una lista}). El @code{while} primero chequea si la lista tiene elementos; si es as@'{@dotless{i}}, eso construye una nueva lista a@~nadiendo el primer elemento de la lista a la lista existente (que en la primera iteraci@'on del bucle es @code{nil}). Puesto que el segundo elemento est@'a asignado en frente del segundo elemento, la lista es inversa.

source: In the expression using a @code{while} loop, the @w{@code{(setq list (cdr list))}} expression shortens the list, so the @code{while} loop eventually stops. In addition, it provides the @code{cons} expression with a new first element by creating a new and shorter list at each repetition of the loop.
es: En la expresi@'on que usa el bucle @code{while}, la expresi@'on @w{@code{(setq list (cdr list))}} ordena la lista, as@'{@dotless{i}} el bucle @code{while} finalmente para. Adem@'as, se proporciona la expresi@'on @code{cons} con un nuevo primer elemento creando una nueva lista y se ordena en cada repetici@'on del bucle.

source: The @code{dolist} expression does very much the same as the @code{while} expression, except that the @code{dolist} macro does some of the work you have to do when writing a @code{while} expression.
es: La expresi@'on @code{dolist} hace lo mismo que la expresi@'on @code{while}, excepto que la macro @code{dolist} hace algo del trabajo que se tiene que hacer cuando se escribe una expresi@'on @code{while}.

source: Like a @code{while} loop, a @code{dolist} loops. What is different is that it automatically shortens the list each time it loops---it `@sc{cdr}s down the list' on its own---and it automatically binds the @sc{car} of each shorter version of the list to the first of its arguments.
es: Al igual que el bucle @code{while}, tenemos el bucle @code{dolist}. Lo que es diferente es que autom@'aticamente ordena la lista cada vez que se repite --- eso es `recorrer los @sc{cdr}s de la lista' en s@'{@dotless{i}} --- y eso autom@'aticamente asocia el @sc{car} de cada versi@'on ordenada de la lista al primero de sus argumentos.

source: In the example, the @sc{car} of each shorter version of the list is referred to using the symbol @samp{element}, the list itself is called @samp{list}, and the value returned is called @samp{value}. The remainder of the @code{dolist} expression is the body.
es: En el ejemplo, el @sc{car} de cada versi@'on ordenada de la lista se refiere a usar el s@'{@dotless{i}}mbolo @samp{element}, la lista en s@'{@dotless{i}} se llama @samp{list}, y el valor devuelto se llama @samp{value}. El resto de la expresi@'on @code{dolist} es el cuerpo.

source: The @code{dolist} expression binds the @sc{car} of each shorter version of the list to @code{element} and then evaluates the body of the expression; and repeats the loop. The result is returned in @code{value}.
es: La expresi@'on @code{dolist} asocia el @sc{car} de cada versi@'on ordenada de la lista al @code{element} y entonces eval@'ua el cuerpo de la expresi@'on y repite el bucle. El resultado es devuelto en @code{value}.

source: The @code{dotimes} Macro
es: La macro @code{dotimes}

source: The @code{dotimes} macro is similar to @code{dolist}, except that it loops a specific number of times.
es: La macro @code{dotimes} es similar a @code{dolist}, excepto que el bucle se repite un n@'umero espec@'{@dotless{i}}fico de veces.

source: The first argument to @code{dotimes} is assigned the numbers 0, 1, 2 and so forth each time around the loop, and the value of the third argument is returned. You need to provide the value of the second argument, which is how many times the macro loops.
es: El primer argumento @code{dotimes} se asigna a los n@'umeros 0, 1, 2 y as@'{@dotless{i}} vuelve al bucle, y el valor del tercer argumento se devuelve. Se necesita proveer el valor del segundo argumento, que es cu@'antas veces la macro hace el bucle.

source: For example, the following binds the numbers from 0 up to, but not including, the number 3 to the first argument, @var{number}, and then constructs a list of the three numbers. (The first number is 0, the second number is 1, and the third number is 2; this makes a total of three numbers in all, starting with zero as the first number.)
es: Por ejemplo, lo siguiente asocia los n@'umeros de 0 en adelante, pero no incluyendo, el n@'umero 3 al primer argumento, @var{n@'umero}, y entonces construye una lista de los tres n@'umeros. (El primer n@'umero es 0, el segundo n@'umero es 1, y el tercer n@'umero es 2; esto crea un total de tres n@'umeros en todo, empezando con cero como el primer n@'umero.)

source: (let (value) ; otherwise a value is a void variable (dotimes (number 3 value) (setq value (cons number value))))
es: (let (value) ; de otro modo un valor es una variable vac@'{@dotless{i}}a (dotimes (number 3 value) (setq value (cons number value))))

source: @code{dotimes} returns @code{value}, so the way to use @code{dotimes} is to operate on some expression @var{number} number of times and then return the result, either as a list or an atom.
es: @code{dotimes} devuelve @code{value}, as@'{@dotless{i}} el camino para usar @code{dotimes} es para operar en alguna expresi@'on el n@'umero de veces @var{number} y entonces devolver el resultado, como una lista o un @'atomo.

source: Here is an example of a @code{defun} that uses @code{dotimes} to add up the number of pebbles in a triangle.
es: Aqu@'{@dotless{i}} hay un ejemplo de una @code{defun} que usa @code{dotimes} para a@~nadir el n@'umero de asteriscos en un tri@'angulo.

source: (defun triangle-using-dotimes (number-of-rows) "Using dotimes, add up the number of pebbles in a triangle." (let ((total 0)) ; otherwise a total is a void variable (dotimes (number number-of-rows total) (setq total (+ total (1+ number))))))
es: (defun triangle-using-dotimes (number-of-rows) "Usando dotimes, a@~nade el n@'umero de asteriscos en un tri@'angulo." (let ((total 0)) ; de otro modo un total es una variable vac@'{@dotless{i}}a (dotimes (number number-of-rows total) (setq total (+ total (1+ number))))))

source: A recursive function contains code that tells the Lisp interpreter to call a program that runs exactly like itself, but with slightly different arguments. The code runs exactly the same because it has the same name. However, even though the program has the same name, it is not the same entity. It is different. In the jargon, it is a different `instance'.
es: Una funci@'on recursiva contiene c@'odigo que hace que el int@'erprete Lisp llame a un programa que ejecute el c@'odigo en s@'{@dotless{i}}, pero con argumentos ligeramente diferentes. El c@'odigo ejecuta exactamente lo mismo porque eso tiene el mismo nombre. Sin embargo, incluso aunque el programa tenga el mismo nombre, no es la misma entidad. Eso es diferente. En la jerga, se dice es una `instancia' diferente.

source: Eventually, if the program is written correctly, the `slightly different arguments' will become sufficiently different from the first arguments that the final instance will stop.
es: Finalmente, si el programa se escribe correctamente, los `argumentos ligeramente diferentes' llegan a ser suficientemente diferentes puesto que los primeros argumentos de la instancia final se parar@'an.

source: Building Robots: Extending the Metaphor
es: Construyendo robots: Extendiendo la met@'afora

source: Building robots
es: Construyendo robots

source: Robots, building
es: Robots, construyendo

source: It is sometimes helpful to think of a running program as a robot that does a job. In doing its job, a recursive function calls on a second robot to help it. The second robot is identical to the first in every way, except that the second robot helps the first and has been passed different arguments than the first.
es: Algunas veces es @'util pensar en un programa en ejecuci@'on como un robot que hace un trabajo. Haciendo su trabajo, una funci@'on recursiva llama a un segundo robot para que le ayude. El segundo robot es id@'entico al primero en cada paso, excepto que el segundo robot ayuda al primero y se han pasado diferentes argumentos en vez del primero.

source: In a recursive function, the second robot may call a third; and the third may call a fourth, and so on. Each of these is a different entity; but all are clones.
es: En una funci@'on recursiva, el segundo robot puede llamar a un tercero; y el tercero puede llamar a un cuarto, y as@'{@dotless{i}}. Cada una de estos es una entidad diferente; pero todos son clones.

source: Since each robot has slightly different instructions---the arguments will differ from one robot to the next---the last robot should know when to stop.
es: Desde que cada robot tiene instrucciones ligeramente diferentes --- los argumentos diferir@'an desde un robot al siguiente --- el @'ultimo robot conocer@'{@dotless{i}}a cuando pare.

source: Let's expand on the metaphor in which a computer program is a robot.
es: Permite expandir la met@'afora en el que un programa de ordenador es un robot.

source: A function definition provides the blueprints for a robot. When you install a function definition, that is, when you evaluate a @code{defun} special form, you install the necessary equipment to build robots. It is as if you were in a factory, setting up an assembly line. Robots with the same name are built according to the same blueprints. So they have, as it were, the same `model number', but a different `serial number'.
es: Una definici@'on de funci@'on provee impresiones para un robot. Cuando se instala una definici@'on de funci@'on, que es, cuando se eval@'ua una forma especial @code{defun}, se instala el equipamiento para construir robots. Eso es como si tu estuvieras en una f@'abrica, configurando una l@'{@dotless{i}}nea de ensamblaje. Los robots con el mismo nombre son construidos de acuerdo a las mismas impresiones. As@'{@dotless{i}} ellos tienen, como estaban, el mismo `n@'umero de modelo', pero un diferente `n@'umero de serie'.

source: We often say that a recursive function `calls itself'. What we mean is that the instructions in a recursive function cause the Lisp interpreter to run a different function that has the same name and does the same job as the first, but with different arguments.
es: Nosotros con frecuencia decimos que una funci@'on recursiva `se llama as@'{@dotless{i}} misma'. Esto significa que las instrucciones en una funci@'on recursiva causa que el int@'erprete de Lisp ejecute una funci@'on diferente que tiene el mismo nombre y hace el mismo trabajo que el primero, pero con diferentes argumentos.

source: It is important that the arguments differ from one instance to the next; otherwise, the process will never stop.
es: Es importante que los argumentos difieran desde una instancia a la siguiente; de otro modo, el proceso nunca parar@'a.

source: The Parts of a Recursive Definition
es: Las partes de una definici@'on recursiva

source: Parts of a Recursive Definition
es: Partes de una Definici@'on Recursiva

source: A recursive function typically contains a conditional expression which has three parts:
es: Una funci@'on recursiva t@'{@dotless{i}}picamente contiene una expresi@'on condicional que tiene tres partes:

source: A true-or-false-test that determines whether the function is called again, here called the @dfn{do-again-test}.
es: Un true-or-false-test que determina si la funci@'on se llama de nuevo, aqu@'{@dotless{i}} se llama el @dfn{do-again-test}.

source: The name of the function. When this name is called, a new instance of the function---a new robot, as it were---is created and told what to do.
es: El nombre de la funci@'on. Cuando este nombre se llama, es una nueva instancia de la funci@'on --- un nuevo robot, as@'{@dotless{i}} --- se crea y se dice qu@'e hacer.

source: An expression that returns a different value each time the function is called, here called the @dfn{next-step-expression}. Consequently, the argument (or arguments) passed to the new instance of the function will be different from that passed to the previous instance. This causes the conditional expression, the @dfn{do-again-test}, to test false after the correct number of repetitions.
es: Una expresi@'on que devuelve un valor diferente cada vez que la funci@'on se llama, aqu@'{@dotless{i}} llamada la @dfn{next-step-expression}. Consecuentemente, el argumento (o argumentos) pasados a la nueva instancia de la funci@'on ser@'an diferentes puesto que se pasa a la instancia previa. Esto causa la expresi@'on condicional, que el @dfn{do-again-test}, devuelva falso despu@'es del n@'umero correcto de repeticiones.

source: Recursive functions can be much simpler than any other kind of function. Indeed, when people first start to use them, they often look so mysteriously simple as to be incomprehensible. Like riding a bicycle, reading a recursive function definition takes a certain knack which is hard at first but then seems simple.
es: Las funciones recursivas pueden ser m@'as simples que cualquier otro tipo de funciones. De manera profunda, cuando la gente empieza a usarlas, con frecuencia se miran as@'{@dotless{i}} misteriosamente de manera tan simple como incompresible. Como montar en bicicleta, leer una funci@'on recursiva es duro al principio, pero despu@'es es simple.

source: There are several different common recursive patterns. A very simple pattern looks like this:
es: Hay varios patrones recursivos diferentes. Un patr@'on muy simple se parece a:

source: Each time a recursive function is evaluated, a new instance of it is created and told what to do. The arguments tell the instance what to do.
es: Cada vez que una funci@'on recursiva es evaluada, una nueva instancia se crea y se dice qu@'e hacer. Los argumentos le dicen a la instancia qu@'e hacer.

source: An argument is bound to the value of the next-step-expression. Each instance runs with a different value of the next-step-expression.
es: Un argumento se empareja al valor de la next-step-expresion. Cada instancia se ejecuta con un valor diferente de la next-step-expression.

source: The value in the next-step-expression is used in the do-again-test.
es: El valor en la next-step-expression es usado en la do-again-test.

source: The value returned by the next-step-expression is passed to the new instance of the function, which evaluates it (or some transmogrification of it) to determine whether to continue or stop. The next-step-expression is designed so that the do-again-test returns false when the function should no longer be repeated.
es: El valor devuelto por la next-step-expression es pasada a las nuevas instancias de la funci@'on, que lo eval@'ua (o alguna transformaci@'on de eso) para determinar si continuar o parar. El next-step-expression est@'a dise@~nado as@'{@dotless{i}} que el do-again-test devuelve falso cuando la funci@'on no se repetir@'{@dotless{i}}a mucho.

source: The do-again-test is sometimes called the @dfn{stop condition}, since it stops the repetitions when it tests false.
es: El do-again-test es algunas veces llamado la @dfn{condici@'on de parar}, puesto que sirve para parar las repeticiones cuando se devuelve falso.

source: Recursion with a List
es: Recursi@'on con una lista

source: The example of a @code{while} loop that printed the elements of a list of numbers can be written recursively. Here is the code, including an expression to set the value of the variable @code{animals} to a list.
es: El ejemplo de un bucle @code{while} que imprimi@'o los elementos de una lista de n@'umeros puede ser escrito recursivamente. Aqu@'{@dotless{i}} est@'a el c@'odigo, incluyendo una expresi@'on para asignar el valor de la variable @code{animales} a una lista.

source: If you are reading this in Info in Emacs, you can evaluate this expression directly in Info. Otherwise, you must copy the example to the @file{*scratch*} buffer and evaluate each expression there. Use @kbd{C-u C-x C-e} to evaluate the @code{(print-elements-recursively animals)} expression so that the results are printed in the buffer; otherwise the Lisp interpreter will try to squeeze the results into the one line of the echo area.
es: Si est@'a leyendo esto en el Info de Emacs, se puede evaluar esta expresi@'on directamente en Info. De otro modo, se debe copiar el ejemplo al b@'uffer @file{*scratch*} y eval@'ua cada expresi@'on aqu@'{@dotless{i}}. Usa @kbd{C-u C-x C-e} para evaluar la expresi@'on @code{(print-elements-recursively animals)} as@'{@dotless{i}} que los resultado se imprimen en el b@'uffer; de otro modo el int@'erprete Lisp intentar@'a presionar los resultados dentro de una l@'{@dotless{i}}nea del @'area echo.

source: Also, place your cursor immediately after the last closing parenthesis of the @code{print-elements-recursively} function, before the comment. Otherwise, the Lisp interpreter will try to evaluate the comment.
es: Tambi@'en, posiciona tu cursor inmediatamente despu@'es del @'ultimo par@'entesis que cierra la funci@'on @code{print-elements-recursively}, antes del comentario. De otro modo, el int@'erprete Lisp intentar@'a evaluar el comentario.

source: (defun print-elements-recursively (list) "Print each element of LIST on a line of its own. Uses recursion." (when list ; @r{do-again-test} (print (car list)) ; @r{body} (print-elements-recursively ; @r{recursive call} (cdr list)))) ; @r{next-step-expression}
es: (defun print-elements-recursively (list) "Imprime cada elemento de la LISTA de la l@'{@dotless{i}}nea en s@'{@dotless{i}}. Usa recursi@'on." (when list ; @r{do-again-test} (print (car list)) ; @r{body} (print-elements-recursively ; @r{recursive call} (cdr list)))) ; @r{next-step-expression}

source: (print-elements-recursively animals)
es: (print-elements-recursively animales)
