Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: On the other hand, if the value of @code{height} is not a multiple of five, we want to reset the value to the next higher multiple of five. This is straightforward arithmetic using functions with which we are already familiar. First, we divide the value of @code{height} by five to determine how many times five goes into the number. Thus, five goes into twelve twice. If we add one to this quotient and multiply by five, we will obtain the value of the next multiple of five that is larger than the height. Five goes into twelve twice. Add one to two, and multiply by five; the result is fifteen, which is the next multiple of five that is higher than twelve. The Lisp expression for this is:
es: Por otro lado, si el valor de @code{height} no es un m@'ultiplo de cinco, nosotros queremos resetear el valor al siguiente m@'ultiplo de cinco. Esta es la aritm@'etica sencilla usando funciones con las que ya se est@'a familiarizado. Primero, se divide el valor de @code{height} por cinco para determinar cuantas veces cinco va dentro del n@'umero. De este modo, cinco va dentro doce veces. Si se a@~nade uno a este cociente y se multiplica por cinco, obtendremos el valor del siguiente m@'ultiplo de cinco que es m@'as largo que el mayor. Cinco va dentro de doce dos veces. A@~nade uno a dos, y multiplica por cinco; el resultado es quince, que es el siguiente m@'ultiplo de cinco que es mayor de doce. La expresi@'on Lisp para esto es:

source: For example, if you evaluate the following, the result is 15:
es: Por ejemplo, si se eval@'ua lo siguiente, el resultado es 15:

source: All through this discussion, we have been using `five' as the value for spacing labels on the Y axis; but we may want to use some other value. For generality, we should replace `five' with a variable to which we can assign a value. The best name I can think of for this variable is @code{Y-axis-label-spacing}.
es: Todo a trav@'es de esta discusi@'on, se ha estado usando `cinco' como el valor para las etiquetas espaciadas en el eje Y; pero se puede querer usar alg@'un otro valor. Generalmente, reemplazar@'{@dotless{i}}a `cinco' con una variable a la que poder asignar un valor. El mejor nombre que puedo pensar para esta variable es @code{Y-axis-label-spacing}.

source: Using this term, and an @code{if} expression, we produce the following:
es: Usando este t@'ermino, y una expresi@'on @code{if}, se produce lo siguiente:

source: This expression returns the value of @code{height} itself if the height is an even multiple of the value of the @code{Y-axis-label-spacing} or else it computes and returns a value of @code{height} that is equal to the next higher multiple of the value of the @code{Y-axis-label-spacing}.
es: Esta expresi@'on devuelve el valor de @code{height} en s@'{@dotless{i}} si la altura es incluso un m@'ultiplo del valor del @code{Y-axis-label-spacing} o lo dem@'as computa y devuelve un valor de @code{height} que es igual al siguiente m@'ultiplo mayor del valor del @code{Y-axis-label-spacing}.

source: We can now include this expression in the @code{let} expression of the @code{print-graph} function (after first setting the value of @code{Y-axis-label-spacing}):
es: Se puede ahora incluir esta expresi@'on en la expresi@'on @code{let} de la funci@'on @code{print-graph} (despu@'es de la primera configuraci@'on del valor de @code{Y-axis-label-spacing}):

source: (defvar Y-axis-label-spacing 5 "Number of lines from one Y axis label to next.")
es: (defvar Y-axis-label-spacing 5 "N@'umero de l@'{@dotless{i}}neas desde una etiqueta del eje Y al siguiente.")

source: (Note use of the @code{let*} function: the initial value of height is computed once by the @code{(apply 'max numbers-list)} expression and then the resulting value of @code{height} is used to compute its final value. @xref{fwd-para let, , The @code{let*} expression}, for more about @code{let*}.)
es: (Note que el uso de la funci@'on @code{let*}: el valor inicial de la altura es calculada una vez por la expresi@'on @code{(apply 'max numbers-list)} y entonces el valor resultado de @code{height} es usado para computar su valor final. @xref{fwd-para let, , La expresi@'on @code{let*}}, para m@'as acerca de @code{let*}.)

source: Construct a Y Axis Element
es: Construye un elemento del eje Y

source: When we print the vertical axis, we want to insert strings such as @w{@samp{5 -}} and @w{@samp{10 - }} every five lines. Moreover, we want the numbers and dashes to line up, so shorter numbers must be padded with leading spaces. If some of the strings use two digit numbers, the strings with single digit numbers must include a leading blank space before the number.
es: Cuando se imprime el eje vertical, se quieren insertar cadenas tales como @w{@samp{5 -}} y @w{@samp{10 - }} cada cinco l@'{@dotless{i}}neas. M@'as all@'a, se quieren los n@'umeros agitados para alinear, as@'{@dotless{i}} pocos n@'umeros deben ser acu@~nados con espacios de gu@'{@dotless{i}}a. Si alguna de las cadenas usan dos d@'{@dotless{i}}gitos, las cadenas con un simple d@'{@dotless{i}}gito deben incluir una gu@'{@dotless{i}}a en blanco antes del n@'umero.

source: To figure out the length of the number, the @code{length} function is used. But the @code{length} function works only with a string, not with a number. So the number has to be converted from being a number to being a string. This is done with the @code{number-to-string} function. For example,
es: Para figurarse el tama@~no del n@'umero, se usa la funci@'on @code{length}. Pero la funci@'on @code{length} funciona solo con una cadena, no con un n@'umero. As@'{@dotless{i}} el n@'umero tiene que ser convertido desde un n@'umero a una cadena. Esto se hace con la funci@'on @code{number-to-string}. Por ejemplo,

source: (@code{number-to-string} is also called @code{int-to-string}; you will see this alternative name in various sources.)
es: (@code{number-to-string} se llama @code{int-to-string}; se ver@'a este nombre alternativo en varias fuentes.)

source: In addition, in each label, each number is followed by a string such as @w{@samp{ - }}, which we will call the @code{Y-axis-tic} marker. This variable is defined with @code{defvar}:
es: Adem@'as, en cada etiqueta, cada n@'umero es seguido por una cadena tal como @w{@samp{ - }}, que llamar@'a al marcador @code{Y-axis-tic}. Esta variable est@'a definida con @code{defvar}:

source: (defvar Y-axis-tic " - " "String that follows number in a Y axis label.")
es: (defvar Y-axis-tic " - " "La Cadena que sigue el n@'umero en una etiqueta del eje Y.")

source: The length of the Y label is the sum of the length of the Y axis tic mark and the length of the number of the top of the graph.
es: El tama@~no de la etiqueta Y es la suma del tama@~no del eje Y y el tama@~no del n@'umero del alto del grafo.

source: This value will be calculated by the @code{print-graph} function in its varlist as @code{full-Y-label-width} and passed on. (Note that we did not think to include this in the varlist when we first proposed it.)
es: Este valor ser@'a calculado por la funci@'on @code{print-graph} en su varlist como @code{full-Y-label-width} y se pasa dentro. (Note que no se pensaba en incluir esto en el varlist cuando se propuso.)

source: To make a complete vertical axis label, a tic mark is concatenated with a number; and the two together may be preceded by one or more spaces depending on how long the number is. The label consists of three parts: the (optional) leading spaces, the number, and the tic mark. The function is passed the value of the number for the specific row, and the value of the width of the top line, which is calculated (just once) by @code{print-graph}.
es: Para crear un eje vertical completo, una marca de tic es concatenada con un n@'umero; y los dos juntos pueden ser precedidos por uno o m@'as espacios dependiendo de c@'omo de largo es el n@'umero. La etiqueta consiste de tres partes: los espacios que se lideran (opcional), el n@'umero, y la marca tic. La funci@'on se pasa al valor del n@'umero para la fila espec@'{@dotless{i}}fica, y el valor del ancho de la l@'{@dotless{i}}nea de arriba, que es calculada (solo una vez) por @code{print-graph}.

source: (defun Y-axis-element (number full-Y-label-width) "Construct a NUMBERed label element. A numbered element looks like this ` 5 - ', and is padded as needed so all line up with the element for the largest number."
es: (defun Y-axis-element (number full-Y-label-width) "Construye una etiqueta NUMERADA Un elemento numerado se parece a esto ` 5 - ', y est@'a tan acu@~nado como se necesita as@'{@dotless{i}} todo se alinea con el elemento para el n@'umero mayor."

source: The @code{Y-axis-element} function concatenates together the leading spaces, if any; the number, as a string; and the tic mark.
es: La funci@'on @code{Y-axis-element} concatena junto los espacios que se lideran si cualquiera; el n@'umero, como una cadena; y la marca tic.

source: To figure out how many leading spaces the label will need, the function subtracts the actual length of the label---the length of the number plus the length of the tic mark---from the desired label width.
es: Para imaginarnos cuantos espacios gu@'{@dotless{i}}a la etiqueta necesita, la funci@'on sustrae el tama@~no de la etiqueta --- el tama@~no del n@'umero m@'as el tama@~no de la marca tic --- desde el ancho de la etiqueta deseada.

source: Blank spaces are inserted using the @code{make-string} function. This function takes two arguments: the first tells it how long the string will be and the second is a symbol for the character to insert, in a special format. The format is a question mark followed by a blank space, like this, @samp{? }. @xref{Character Type, , Character Type, elisp, The GNU Emacs Lisp Reference Manual}, for a description of the syntax for characters. (Of course, you might want to replace the blank space by some other character @dots{} You know what to do.)
es: Los espacios en blanco se insertan usando la funci@'on @code{make-string}. Esta funci@'on tiene dos argumentos: lo primero cuenta como de larga ser@'a a cadena y el segundo es un s@'{@dotless{i}}mbolo para el caracter a insertar, en un formato espcial. El formato es una marca de pregunta seguida por un espacio en blanco, como este, @samp{?}. @xref{Tipo de Caracter, , Tipo de Caracter, elisp, El Manual de Referencia Emacs Lisp}, para una descripci@'on de la sintaxis para caracteres. (De acuerdo, se podr@'{@dotless{i}}a querer reemplazar el espacio en blanco por alg@'un otro caracter @dots{}. Tu sabes qu@'e hacer.)

source: The @code{number-to-string} function is used in the concatenation expression, to convert the number to a string that is concatenated with the leading spaces and the tic mark.
es: La funci@'on @code{number-to-string} es usada en la expresi@'on de concatenaci@'on, para convertir el n@'umero a una cadena que es concatenada con los espacios que se lideran y la marca de tic.

source: Create a Y Axis Column
es: Crea un eje de la columna Y

source: The preceding functions provide all the tools needed to construct a function that generates a list of numbered and blank strings to insert as the label for the vertical axis:
es: Las funciones precedentes proporcionan todas las herramientas necesarias para construir una funci@'on que genera una lista de cadenas enumeradas y en blanco para inserta como la etiqueta para el eje vertical:

source: (defun Y-axis-column (height width-of-label) "Construct list of Y axis labels and blank strings. For HEIGHT of line above base and WIDTH-OF-LABEL." (let (Y-axis)
es: (defun Y-axis-column (height width-of-label) "Construye la lista de ejes Y etiquetadas y cadenas en blanco. Para height @emph{la altura} de la l@'{@dotless{i}}nea de debajo y width-of-label." (let (Y-axis)

source: (while (> height 1) (if (zerop (% height Y-axis-label-spacing)) ;; @r{Insert label.} (setq Y-axis (cons (Y-axis-element height width-of-label) Y-axis))
es: (while (> height 1) (if (zerop (% height Y-axis-label-spacing)) ;; @r{Insertar etiqueta.} (setq Y-axis (cons (Y-axis-element height width-of-label) Y-axis))

source: ;; @r{Else, insert blanks.} (setq Y-axis (cons (make-string width-of-label ? ) Y-axis))) (setq height (1- height))) ;; @r{Insert base line.} (setq Y-axis (cons (Y-axis-element 1 width-of-label) Y-axis)) (nreverse Y-axis)))
es: ;; @r{Else, insertar blancos.} (setq Y-axis (cons (make-string width-of-label ? ) Y-axis))) (setq height (1- height))) ;; @r{Insertar la l@'{@dotless{i}}nea base.} (setq Y-axis (cons (Y-axis-element 1 width-of-label) Y-axis)) (nreverse Y-axis)))

source: In this function, we start with the value of @code{height} and repetitively subtract one from its value. After each subtraction, we test to see whether the value is an integral multiple of the @code{Y-axis-label-spacing}. If it is, we construct a numbered label using the @code{Y-axis-element} function; if not, we construct a blank label using the @code{make-string} function. The base line consists of the number one followed by a tic mark.
es: En esta funci@'on, nosotros empezamos con el valor de @code{height} y repetitivamente sustrae uno desde su valor. Despu@'es de cada sustraci@'on, se chequea para ver si el valor es una integral m@'ultiple del @code{Y-axis-label-spacing}. Si eso es, se construye una etiqueta numerada usando la funci@'on @code{Y-axis-element}; si no, se construye una etiqueta blanca usando la funci@'on @code{make-string}. La l@'{@dotless{i}}nea base consiste del n@'umero uno seguido por una marca tic.

source: The Not Quite Final Version of @code{print-Y-axis}
es: La versi@'on no demasiado final de @code{print-Y-axis}

source: The list constructed by the @code{Y-axis-column} function is passed to the @code{print-Y-axis} function, which inserts the list as a column.
es: La lista construida por la funci@'on @code{Y-axis-column} est@'a pasada a la funci@'on @code{print-Y-axis}, que inserta la lista como una columna.

source: (defun print-Y-axis (height full-Y-label-width) "Insert Y axis using HEIGHT and FULL-Y-LABEL-WIDTH. Height must be the maximum height of the graph. Full width is the width of the highest label element." ;; Value of height and full-Y-label-width ;; are passed by `print-graph'.
es: (defun print-Y-axis (height full-Y-label-width) "Inserta el eje Y usando HEIGHT y FULL-Y-LABEL-WIDTH. La altura debe ser la m@'axima altura del grafo. El ancho completo es el ancho del mayor elemento de la etiqueta" ;; El valor del alto y full-Y-label-width ;; son pasadas por `print-graph'.

source: (let ((start (point))) (insert-rectangle (Y-axis-column height full-Y-label-width)) ;; @r{Place point ready for inserting graph.} (goto-char start) ;; @r{Move point forward by value of} full-Y-label-width (forward-char full-Y-label-width)))
es: (let ((start (point))) (insert-rectangle (Y-axis-column height full-Y-label-width)) ;; @r{Posiciona el punto listo para inserta el grafo.} (goto-char start) ;; @r{Mueve el punto hacia adelante por valor de} full-Y-label-width (forward-char full-Y-label-width)))

source: The @code{print-Y-axis} uses the @code{insert-rectangle} function to insert the Y axis labels created by the @code{Y-axis-column} function. In addition, it places point at the correct position for printing the body of the graph.
es: El @code{print-Y-axis} usa la funci@'on @code{insert-rectangle} para inserta el eje Y creado por la funci@'on @code{Y-axis-column}. Adem@'as, eso emplaza el punto en la posici@'on correcta para imprimir el cuerpo del grafo.

source: You can test @code{print-Y-axis}:
es: Se puede chequear @code{print-Y-axis}:

source: Switch to the @file{*scratch*} buffer and place the cursor where you want the axis labels to start.
es: Cambia al b@'uffer @file{*scratch*} y emplaza el cursor donde se quiere el eje etiquetado para empezar.

source: Press @key{RET} to evaluate the expression.
es: Presiona @key{RET} para evaluar la expresi@'on

source: Emacs will print labels vertically, the top one being @w{@samp{10 -@w{ }}}. (The @code{print-graph} function will pass the value of @code{height-of-top-line}, which in this case will end up as 15, thereby getting rid of what might appear as a bug.)
es: Emacs imprimir@'a etiquetas verticalmente, el primero siendo @w{@samp{10 -@w{ }}}. (La funci@'on @code{print-graph} pasar@'a el valor de @code{height-of-top-line}, que en este caso finalizar@'a en 15, por esto lo que se obtiene podr@'{@dotless{i}}a aparecer como un error.)

source: Axis, print horizontal
es: Ejes, imprime horizontal

source: X axis printing
es: imprimiendo eje X

source: Print horizontal axis
es: Imprime eje horizontal

source: Horizontal axis printing
es: Imprimiendo eje horizontal

source: X axis labels are much like Y axis labels, except that the ticks are on a line above the numbers. Labels should look like this:
es: Las etiquetas del eje X son como las etiquetas del eje Y, excepto que los ticks son un l@'{@dotless{i}}nea debajo de los n@'umeros. Las etiquetas se parece como esto:

source: The first tic is under the first column of the graph and is preceded by several blank spaces. These spaces provide room in rows above for the Y axis labels. The second, third, fourth, and subsequent ticks are all spaced equally, according to the value of @code{X-axis-label-spacing}.
es: El primer tic est@'a bajo la primera columna del grafo y est@'a precedido por varios espacios en blanco. Estos espacios proporcionan la habitaci@'on en filas de debajo para las etiquetas del eje Y. El segundo, tercer, cuarto, y subsiguientes ticks son todos espaciados igualmente, de acuerdo al valor de @code{X-axis-label-spacing}.

source: The second row of the X axis consists of numbers, preceded by several blank spaces and also separated according to the value of the variable @code{X-axis-label-spacing}.
es: La segunda fila del eje X consiste de n@'umeros, precedidos por varios espacios en blanco y tambi@'en separado de acuerdo al valor de la variable @code{X-axis-label-spacing}.

source: The value of the variable @code{X-axis-label-spacing} should itself be measured in units of @code{symbol-width}, since you may want to change the width of the symbols that you are using to print the body of the graph without changing the ways the graph is labeled.
es: El valor de la variable @code{X-axis-label-spacing} ser@'{@dotless{i}}a medido en unidades de @code{symbol-width}, puesto que se puede querer cambiar el ancho de los s@'{@dotless{i}}mbolos que est@'as usando para imprimir el cuerpo del grafo sin cambiar los caminos del grafo que est@'a etiquetado.

source: Similarities and differences
es: Similaridades y diferencias

source: The @code{print-X-axis} function is constructed in more or less the same fashion as the @code{print-Y-axis} function except that it has two lines: the line of tic marks and the numbers. We will write a separate function to print each line and then combine them within the @code{print-X-axis} function.
es: La funci@'on @code{print-X-axis} est@'a construida m@'as o menos del mismo modo como que la funci@'on @code{print-Y-axis} excepto que tiene dos l@'{@dotless{i}}neas: la l@'{@dotless{i}}nea de marcas tic y los n@'umeros. Nosotros escribiremos una funci@'on separado a imprimir cada l@'{@dotless{i}}nea y entonces combinarlo con la funci@'on @code{print-X-axis}.

source: This is a three step process:
es: Esto es un proceso de tres pasos:

source: Write a function to print the X axis tic marks, @code{print-X-axis-tic-line}.
es: Escribe una funci@'on para imprimir el eje X marca tic, @code{print-X-axis-tic-line}.

source: Write a function to print the X numbers, @code{print-X-axis-numbered-line}.
es: Escribe una funci@'on imprime los n@'umeros X, @code{print-X-axis-numbered-line}.

source: Write a function to print both lines, the @code{print-X-axis} function, using @code{print-X-axis-tic-line} and @code{print-X-axis-numbered-line}.
es: Escribe una funci@'on para imprimir ambas l@'{@dotless{i}}neas, la funci@'on @code{print-X-axis}, usando @code{print-X-axis-tic-line} y @code{print-X-axis-numbered-line}.

source: The first function should print the X axis tic marks. We must specify the tic marks themselves and their spacing:
es: La primera funci@'on imprimir@'{@dotless{i}}a las marcas de tic del eje X. Se deben especificar las marcas en s@'{@dotless{i}} y su espacio:

source: (defvar X-axis-label-spacing (if (boundp 'graph-blank) (* 5 (length graph-blank)) 5) "Number of units from one X axis label to next.")
es: (defvar X-axis-label-spacing (if (boundp 'graph-blank) (* 5 (length graph-blank)) 5) "N@'umeros de unidades desde un eje X al siguiente.")

source: (Note that the value of @code{graph-blank} is set by another @code{defvar}. The @code{boundp} predicate checks whether it has already been set; @code{boundp} returns @code{nil} if it has not. If @code{graph-blank} were unbound and we did not use this conditional construction, in a recent GNU Emacs, we would enter the debugger and see an error message saying @samp{@w{Debugger entered--Lisp error:} @w{(void-variable graph-blank)}}.)
es: (Note que el valor de @code{graph-blank} est'a asignado por otro @code{defvar}. El predicado @code{boundp} chequea si ya ha sido asignado; @code{boundp} devuelve @code{nil} si no lo tiene. Si @code{graph-blank} fuera disociado y no usara esta construcci@'on condicional, en un GNU Emacs reciente, se introducir@'{@dotless{i}}a el depurador y mirar@'a un mensaje de error diciendo @samp{@w{Debugger entered--Lisp error:} @w{(void-variable graph-blank)}}

source: Here is the @code{defvar} for @code{X-axis-tic-symbol}:
es: Aqu@'{@dotless{i}} est@'a el @code{defvar} para @code{X-axis-tic-symbol}:

source: (defvar X-axis-tic-symbol "|" "String to insert to point to a column in X axis.")
es: (defvar X-axis-tic-symbol "|" "Cadena para insertar para apuntar a una columna en el eje X.")

source: The goal is to make a line that looks like this:
es: El objetivo es crear una l@'{@dotless{i}}nea que se parece a esto:

source: The first tic is indented so that it is under the first column, which is indented to provide space for the Y axis labels.
es: El primer tic es indentado as@'{@dotless{i}} que est@'a bajo la primera columna, que es indentado para proveer espacio para las etiquetas del eje Y.

source: A tic element consists of the blank spaces that stretch from one tic to the next plus a tic symbol. The number of blanks is determined by the width of the tic symbol and the @code{X-axis-label-spacing}.
es: Un elemento tic consiste en espacios en blanco que se extienden desde un tic al siguiente m@'as un s@'{@dotless{i}}mbolo tic. El n@'umero de espacios en blanco se determinan por el ancho del s@'{@dotless{i}}mbolo tic y el @code{X-axis-label-spacing}.

source: ;;; X-axis-tic-element @dots{} (concat (make-string ;; @r{Make a string of blanks.} (- (* symbol-width X-axis-label-spacing) (length X-axis-tic-symbol)) ? ) ;; @r{Concatenate blanks with tic symbol.} X-axis-tic-symbol) @dots{}
es: ;;; X-axis-tic-element @dots{} (concat (make-string ;; @r{Crea una cadena de blancos.} (- (* symbol-width X-axis-label-spacing) (length X-axis-tic-symbol)) ? ) ;; @r{Concatena blancos con s@'{@dotless{i}}mbolos.} X-axis-tic-symbol) @dots{}

source: Next, we determine how many blanks are needed to indent the first tic mark to the first column of the graph. This uses the value of @code{full-Y-label-width} passed it by the @code{print-graph} function.
es: Lo siguiente, determina cuantos espacios en blanco son necesarios para indentar la primera marca tic a la primera del grafo. Esto usa el valor de @code{full-Y-label-width} pasaba por la funci@'on @code{print-graph}.

source: The code to make @code{X-axis-leading-spaces} looks like this:
es: El c@'odigo para crear @code{X-axis-leading-spaces} se parece a esto:
