Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Clearly, if the value returned by evaluating the first argument to @code{while} is always true, the body following will be evaluated again and again @dots{} and again @dots{} forever. Conversely, if the value returned is never true, the expressions in the body will never be evaluated. The craft of writing a @code{while} loop consists of choosing a mechanism such that the true-or-false-test returns true just the number of times that you want the subsequent expressions to be evaluated, and then have the test return false.
es: Claramente, si el valor devuelto evaluando el primer argumento para @code{while} es siempre cierto, el cuerpo siguiente ser@'a evaluado una y otra vez @dots{} y @dots{} para siempre. Rec@'{@dotless{i}}procamente, si el valor devuelto nunca es cierto, las expresiones en el cuerpo nunca ser@'an evaluadas. La fortaleza de escribir un bucle @code{while} consiste de elegir un mecanismo tal que el true-or-false-test devuelva cierto solo el n@'umero de veces que requieren las subsiguientes expresiones para ser evaluadas, y entonces tener el test devuelto a falso.

source: The value returned by evaluating a @code{while} is the value of the true-or-false-test. An interesting consequence of this is that a @code{while} loop that evaluates without error will return @code{nil} or false regardless of whether it has looped 1 or 100 times or none at all. A @code{while} expression that evaluates successfully never returns a true value! What this means is that @code{while} is always evaluated for its side effects, which is to say, the consequences of evaluating the expressions within the body of the @code{while} loop. This makes sense. It is not the mere act of looping that is desired, but the consequences of what happens when the expressions in the loop are repeatedly evaluated.
es: El valor devuelto evaluando @code{while} es el valor del true-or-false-test. Una consecuencia interesante de esto es que un bucle @code{while} que eval@'ua sin errores devolver@'a @code{nil} o falso sin dignidad de si eso ha girado 1 o 100 veces o ninguna. @exclamdown{}Una expresi@'on @code{while} que se eval@'ua de manera exitosa nunca devuelve un valor cierto! Lo que esto significa es que @code{while} es siempre evaluado por sus efectos laterales, que es decir, las consecuencias de evaluar las expresiones con el cuerpo del bucle @code{while}. Esto tiene sentido. Eso no es el mero acto del bucle que es deseado, pero las consecuencias de lo que ocurre cuando las expresiones en el bucle son repetidamente evaluadas.

source: A @code{while} Loop and a List
es: Un bucle @code{while} y una lista

source: A common way to control a @code{while} loop is to test whether a list has any elements. If it does, the loop is repeated; but if it does not, the repetition is ended. Since this is an important technique, we will create a short example to illustrate it.
es: Un camino com@'un para controlar un bucle @code{while} es chequear si una lista tiene cualquier elemento. Si eso se hace, el bucle se repite; pero si no, la repetici@'on se finaliza. Puesto que esto es una t@'ecnica importante, se crear@'a un breve ejemplo para ilustrarlo.

source: A simple way to test whether a list has elements is to evaluate the list: if it has no elements, it is an empty list and will return the empty list, @code{()}, which is a synonym for @code{nil} or false. On the other hand, a list with elements will return those elements when it is evaluated. Since Emacs Lisp considers as true any value that is not @code{nil}, a list that returns elements will test true in a @code{while} loop.
es: Un camino simple para chequear si una lista tiene elementos es evaluar la lista: si eso no tiene elementos, si es una lista vac@'{@dotless{i}}a y devuelve la lista vac@'{@dotless{i}}a, @code{()}, que es un sin@'onimo para @code{nil} o falso. Por otro lado, una lista con elementos devolver@'a estos elementos cuando eso se eval@'ua. Puesto que Emacs Lisp considera como cierto cualquier valor que no es @code{nil}, una lista que devuelve elementos chequear@'a cierto en un bucle @code{while}.

source: For example, you can set the variable @code{empty-list} to @code{nil} by evaluating the following @code{setq} expression:
es: Por ejemplo, se puede asignar la variable @code{empty-list} a @code{nil} para evaluar la siguiente expresi@'on @code{setq}:

source: (setq empty-list ())
es: (setq lista-vacia ())

source: After evaluating the @code{setq} expression, you can evaluate the variable @code{empty-list} in the usual way, by placing the cursor after the symbol and typing @kbd{C-x C-e}; @code{nil} will appear in your echo area:
es: Despu@'es de evaluar la expresi@'on @code{setq}, se puede evaluar la variable @code{lista-vacia} es el camino normal, posicionando el cursor despu@'es del s@'{@dotless{i}}mbolo y escribiendo @kbd{C-x C-e}; @code{nil} aparecer@'a en tu @'area echo:

source: empty-list
es: lista-vacia

source: On the other hand, if you set a variable to be a list with elements, the list will appear when you evaluate the variable, as you can see by evaluating the following two expressions:
es: Por otro lado, si se asigna una variable para ser una lista con elementos, la lista aparecer@'a cuando se eval@'ue la variable, como se puede ver evaluando las siguientes dos expresiones:

source: (setq animals '(gazelle giraffe lion tiger))
es: (setq animales '(gacela jirafa leon tigre))

source: animals
es: animales

source: Thus, to create a @code{while} loop that tests whether there are any items in the list @code{animals}, the first part of the loop will be written like this:
es: De este modo, para un bucle @code{while} que chequea si hay cualquier @'{@dotless{i}}tem en la lista @code{animales}, la primera parte del bucle ser@'a escrito as@'{@dotless{i}}:

source: (while animals @dots{}
es: (while animales @dots{}

source: When the @code{while} tests its first argument, the variable @code{animals} is evaluated. It returns a list. So long as the list has elements, the @code{while} considers the results of the test to be true; but when the list is empty, it considers the results of the test to be false.
es: Cuando el @code{while} chequea su primer argumento, la variable @code{animales} se eval@'ua. Eso devuelve una lista. Mientras la lista tiene elementos, el @code{while} considera los resultados del test para ser verdadero; pero cuando la lista es vac@'{@dotless{i}}a, eso considera los resultados del test para ser falso.

source: To prevent the @code{while} loop from running forever, some mechanism needs to be provided to empty the list eventually. An oft-used technique is to have one of the subsequent forms in the @code{while} expression set the value of the list to be the @sc{cdr} of the list. Each time the @code{cdr} function is evaluated, the list will be made shorter, until eventually only the empty list will be left. At this point, the test of the @code{while} loop will return false, and the arguments to the @code{while} will no longer be evaluated.
es: Para prevenir que el bucle @code{while} se ejecute siempre, se necesita proporcionar alg@'un mecanismo. Una t@'ecnica usada con frecuencia es tener una de las subsiguientes formas en la expresi@'on @code{while} que asigna el valor de la lista para ser el @sc{cdr} de la lista. Cada vez que la funci@'on @code{cdr} se eval@'ua, se va reduciendo, hasta que finalmente solo queda la lista vac@'{@dotless{i}}a. En este punto, el test del bucle @code{while} devolver@'a falso, y los argumentos para el @code{while} no se evaluar@'an.

source: For example, the list of animals bound to the variable @code{animals} can be set to be the @sc{cdr} of the original list with the following expression:
es: Por ejemplo, la lista de animales asociada a la variable @code{animals} se puede asignar a ser el @sc{cdr} de la lista original con la siguiente expresi@'on:

source: If you have evaluated the previous expressions and then evaluate this expression, you will see @code{(giraffe lion tiger)} appear in the echo area. If you evaluate the expression again, @code{(lion tiger)} will appear in the echo area. If you evaluate it again and yet again, @code{(tiger)} appears and then the empty list, shown by @code{nil}.
es: Si se han evaluado las expresiones previas y entonces se eval@'ua esta expresi@'on, se ver@'a @code{(jirafa leon tigre)} que aparecer@'a en el @'area echo. Si se eval@'ua la expresi@'n de nuevo, @code{(leon tigre)} aparecer@'a en el @'area echo. Si se eval@'ua de nuevo, @code{(tigre)} y todav@'{@dotless{i}}a de nuevo aparecer@'a la lista vac@'{@dotless{i}}a y se mostrar@'a como @code{nil}.

source: A template for a @code{while} loop that uses the @code{cdr} function repeatedly to cause the true-or-false-test eventually to test false looks like this:
es: Una plantilla para un bucle @code{while} usa la funci@'on @code{cdr} repetidamente para causar el true-or-false-test finalmente para chequear la veracidad y se parece a esto:

source: This test and use of @code{cdr} can be put together in a function that goes through a list and prints each element of the list on a line of its own.
es: Este chequeo y uso de @code{cdr} puede ser puesto junto a una funci@'on que va a trav@'es de una lista e imprime cada elemento de la lista en una l@'{@dotless{i}}nea de s@'{@dotless{i}} misma.

source: An Example: @code{print-elements-of-list}
es: Un ejemplo: @code{imprimir-elementos-de-la-lista}

source: The @code{print-elements-of-list} function illustrates a @code{while} loop with a list.
es: La funci@'on @code{imprimir-elementos-de-la-lista} ilustra un bucle @code{while} con una lista.

source: The function requires several lines for its output. If you are reading this in a recent instance of GNU Emacs, you can evaluate the following expression inside of Info, as usual.
es: La funci@'on requiere varias l@'{@dotless{i}}neas por su salida. Si est@'as leyendo esto en una instancia reciente de GNU Emacs, se puede evaluar la siguiente expresi@'on dentro de Info, de normal.

source: If you are using an earlier version of Emacs, you need to copy the necessary expressions to your @file{*scratch*} buffer and evaluate them there. This is because the echo area had only one line in the earlier versions.
es: Si se est@'a usando una versi@'on antigua de Emacs, es necesario copiar las expresiones necesarias para el b@'uffer @file{*scratch*} y evaluarlas all@'{@dotless{i}}. Esto es porque el @'area echo ten@'{@dotless{i}}a solo una l@'{@dotless{i}}nea en las versiones antiguas.

source: You can copy the expressions by marking the beginning of the region with @kbd{C-@key{SPC}} (@code{set-mark-command}), moving the cursor to the end of the region and then copying the region using @kbd{M-w} (@code{kill-ring-save}, which calls @code{copy-region-as-kill} and then provides visual feedback). In the @file{*scratch*} buffer, you can yank the expressions back by typing @kbd{C-y} (@code{yank}).
es: Se pueden copiar las expresiones marcando el principio de la regi@'on con @kbd{C-@key{SPC}} (@code{set-mark-command}), moviendo el cursor al fin de la regi@'on y entonces copiando la regi@'on usando @kbd{M-w} (@code{kill-ring-save}, que llama a @code{copy-region-as-kill} y entonces provee realimentaci@'on visual). En el b@'uffer @file{*scratch*}, se pueden copiar las expresiones escribiendo @kbd{C-y} (@code{yank}).

source: After you have copied the expressions to the @file{*scratch*} buffer, evaluate each expression in turn. Be sure to evaluate the last expression, @code{(print-elements-of-list animals)}, by typing @kbd{C-u C-x C-e}, that is, by giving an argument to @code{eval-last-sexp}. This will cause the result of the evaluation to be printed in the @file{*scratch*} buffer instead of being printed in the echo area. (Otherwise you will see something like this in your echo area: @code{^Jgazelle^J^Jgiraffe^J^Jlion^J^Jtiger^Jnil}, in which each @samp{^J} stands for a `newline'.)
es: Despu@'es de haber copiado las expresiones al b@'uffer @file{*scratch*}, se eval@'ua cada expresi@'on en orden. Aseg@'urese de evaluar la @'ultima expresi@'on, @code{(imprimir-elementos-de-la-lista animales)}, escribiendo @kbd{C-u C-x C-e}, que es, dando un argumento para @code{eval-last-sexp}. Esto causar@'a el resultado de la evaluaci@'on para ser impreso en el b@'uffer @file{*scratch*} en vez de siendo impreso en el @'area echo. (De otro modo se ver@'a alguna cosa como esto en tu @'area echo: @code{^Jgacela^J^Jjirafa^J^Jleon^J^Jtigre^Jnulo}, en cada @samp{^J} se estructura una `nueva l@'{@dotless{i}}nea'.)

source: In a recent instance of GNU Emacs, you can evaluate these expressions directly in the Info buffer, and the echo area will grow to show the results.
es: En una instancia de GNU Emacs reciente, se pueden evaluar estas expresiones directamente en el b@'uffer Info, y el @'area echo crecer@'a para mostrar los resultados.

source: (defun print-elements-of-list (list) "Print each element of LIST on a line of its own." (while list (print (car list)) (setq list (cdr list))))
es: (defun imprimir-elementos-de-la-lista (list) "Imprime cada elemento de LIST en una l@'{@dotless{i}}nea." (while list (print (car list)) (setq list (cdr list))))

source: (print-elements-of-list animals)
es: (imprimir-elementos-de-la-lista animales)

source: When you evaluate the three expressions in sequence, you will see this:
es: Cuando se eval@'uan las tres expresiones en secuencia, se ver@'a esto:

source: gazelle
es: gacela

source: giraffe
es: jirafa

source: lion
es: leon

source: tiger nil
es: tigre nil

source: Each element of the list is printed on a line of its own (that is what the function @code{print} does) and then the value returned by the function is printed. Since the last expression in the function is the @code{while} loop, and since @code{while} loops always return @code{nil}, a @code{nil} is printed after the last element of the list.
es: Cada elemento de la lista se imprime en una l@'{@dotless{i}}nea en s@'{@dotless{i}} (que es lo que la funci@'on @code{print} hace) y entonces el valor devuelto por la funci@'on se imprime. Desde que la @'ultima expresi@'on en la funci@'on es el bucle @code{while}, y desde que el bucle @code{while} siempre devuelve @code{nil}, un @code{nil} se imprime despu@'es del @'ultimo elemento de la lista.

source: A Loop with an Incrementing Counter
es: Un bucle con un contaje incremental

source: A loop is not useful unless it stops when it ought. Besides controlling a loop with a list, a common way of stopping a loop is to write the first argument as a test that returns false when the correct number of repetitions are complete. This means that the loop must have a counter---an expression that counts how many times the loop repeats itself.
es: Un bucle no es @'util a menos que pare cuando debe. Bajo el control de un bucle con una lista, un camino com@'un de parar un bucle es escribir el primer argumento como un test que devuelve falso cuando el n@'umero correcto de repeticiones es completo. Esto significa que el bucle debe tener un contador --- una expresi@'on que cuenta cu@'antas veces el bucle se repite a s@'{@dotless{i}} mismo.

source: Incrementing Loop Details
es: Incrementando los detalles de los bucles

source: The test for a loop with an incrementing counter can be an expression such as @code{(< count desired-number)} which returns @code{t} for true if the value of @code{count} is less than the @code{desired-number} of repetitions and @code{nil} for false if the value of @code{count} is equal to or is greater than the @code{desired-number}. The expression that increments the count can be a simple @code{setq} such as @code{(setq count (1+ count))}, where @code{1+} is a built-in function in Emacs Lisp that adds 1 to its argument. (The expression @w{@code{(1+ count)}} has the same result as @w{@code{(+ count 1)}}, but is easier for a human to read.)
es: El test para un bucle con un contador de incremento puede ser una expresi@'on tal como @code{(< contador numero-deseado)} que devuelve @code{t} para verdad si el valor de @code{contador} es menor que el @code{numero-deseado} de repeticiones y @code{nil} para falso si el valor de @code{contador} es igual a o es mayor que el @code{numero-deseado}. La expresi@'on que incrementa el contador puede ser un simple @code{setq} tal como @code{(setq contador (1+ contador))}, donde @code{1+} es una funci@'on construida en Emacs Lisp que a@~nade 1 a su argumento. (La expresi@'on @w{@code{(1+ contador)}} tiene el mismo resultado que @w{@code{(+ contador 1)}}, que es f@'acil de leer para un humano.)

source: The template for a @code{while} loop controlled by an incrementing counter looks like this:
es: La plantilla para un bucle @code{while} controlado por un contador que se incrementa se parece a esto:

source: @var{set-count-to-initial-value} (while (< count desired-number) ; @r{true-or-false-test} @var{body}@dots{} (setq count (1+ count))) ; @r{incrementer}
es: @var{asignar-contador-al-valor-inicial} (while (< contador numero-deseado) ; @r{true-or-false-test} @var{body}@dots{} (setq contador (1+ contador))) ; @r{incremento}

source: Note that you need to set the initial value of @code{count}; usually it is set to 1.
es: Note que se necesita asignar el valor inicial de @code{contador}; normalmente asignado a 1.

source: Example with incrementing counter
es: Ejemplo con contador incremental

source: Suppose you are playing on the beach and decide to make a triangle of pebbles, putting one pebble in the first row, two in the second row, three in the third row and so on, like this:
es: Sup@'on que est@'as jugando en la playa y decides crear un tri@'angulo de asteriscos, poniendo un asterisco en la primera fila, dos en la segunda fila, tres en la tercera fila y as@'{@dotless{i}}:

source: (About 2500 years ago, Pythagoras and others developed the beginnings of number theory by considering questions such as this.)
es: (Hace 2500 a@~nos, Pit@'agoras y otras desarrollaron los principios de la teor@'{@dotless{i}}a de n@'umeros considerando preguntas como esta.)

source: Suppose you want to know how many pebbles you will need to make a triangle with 7 rows?
es: Sup@'on que quieres saber cu@'antos asteriscos necesitar@'as crear para un tri@'angulo con 7 filas

source: Clearly, what you need to do is add up the numbers from 1 to 7. There are two ways to do this; start with the smallest number, one, and add up the list in sequence, 1, 2, 3, 4 and so on; or start with the largest number and add the list going down: 7, 6, 5, 4 and so on. Because both mechanisms illustrate common ways of writing @code{while} loops, we will create two examples, one counting up and the other counting down. In this first example, we will start with 1 and add 2, 3, 4 and so on.
es: Claramente, lo que necesitas hacer es a@~nadir los n@'umeros de 1 a 7. Hay dos caminos para hacer esto; se puede comenzar con los n@'umeros m@'as peque@~nos, uno, y a@~nadir la lista en secuencia, 1, 2, 3, 4 y as@'{@dotless{i}}; o empieza con el n@'umero m@'as largo y a@~nade la lista bajando: 7, 6, 5, 4 y as@'{@dotless{i}}. Porque ambos mecanismos ilustran caminos comunes de escribir el bucle @code{while}, crearemos dos ejemplos, uno contando hacia arriba y el otro contando hacia abajo. En este primer ejemplo, empezaremos con 1 y a@~nadimos 2, 3, 4 y as@'{@dotless{i}}.

source: If you are just adding up a short list of numbers, the easiest way to do it is to add up all the numbers at once. However, if you do not know ahead of time how many numbers your list will have, or if you want to be prepared for a very long list, then you need to design your addition so that what you do is repeat a simple process many times instead of doing a more complex process once.
es: Si se quiere sumar toda una lista de n@'umeros, el camino m@'as f@'acil para hacer eso es sumar todos los n@'umeros a la vez. Sin embargo, si no se sabe cu@'antos n@'umeros tendr@'a la lista, o si se requiere estar preparado para una lista muy larga, entonces se necesita dise@~nar la adici@'on, esto es, repetir un proceso simple muchas veces en vez de hacer un proceso m@'as complejo.

source: For example, instead of adding up all the pebbles all at once, what you can do is add the number of pebbles in the first row, 1, to the number in the second row, 2, and then add the total of those two rows to the third row, 3. Then you can add the number in the fourth row, 4, to the total of the first three rows; and so on.
es: Por ejemplo, en vez de a@~nadir todos los asteriscos a la vez, lo que se puede hacer es a@~nadir el n@'umero de asteriscos en la primera fila, 1, para el n@'umero en la segunda fila, 2, y entonces a@~nadir el total de estas dos filas a la tercera fila, 3. Entonces se puede a@~nadir el n@'umero en la cuarta fila, 4, al total de las primeras tres filas; y as@'{@dotless{i}}.

source: The critical characteristic of the process is that each repetitive action is simple. In this case, at each step we add only two numbers, the number of pebbles in the row and the total already found. This process of adding two numbers is repeated again and again until the last row has been added to the total of all the preceding rows. In a more complex loop the repetitive action might not be so simple, but it will be simpler than doing everything all at once.
es: La caracter@'{@dotless{i}}stica cr@'{@dotless{i}}tica del proceso es que cada acci@'on repetitiva sea simple. En este caso, en cada paso nosotros a@~nadimos solo dos n@'umeros, el n@'umero de asteriscos en la fila y el total ya encontrado. Este proceso de a@~nadir dos n@'umeros es repetido de nuevo y de nuevo hasta la @'ultima fila que ha sido a@~nadida al total de todas las filas precedentes. En un bucle m@'as complejo la acci@'on repetitiva podr@'{@dotless{i}}a no ser tan simple, pero ser@'a tan simple como hacer todo a la vez.

source: The parts of the function definition
es: Las partes de la definici@'on de funci@'on

source: The preceding analysis gives us the bones of our function definition: first, we will need a variable that we can call @code{total} that will be the total number of pebbles. This will be the value returned by the function.
es: El an@'alisis precedente nos da los bonos de nuestra definici@'on de funci@'on: primero, necesitaremos una variable que podemos llamar @code{total} que ser@'a el n@'umero total de asteriscos. Esto ser@'a el valor devuelto por la funci@'on.

source: Second, we know that the function will require an argument: this argument will be the total number of rows in the triangle. It can be called @code{number-of-rows}.
es: Segundo, sabemos que la funci@'on requerir@'a un argumento: este argumento ser@'a el n@'umero de filas en el tri@'angulo. Eso puede llamarse @code{number-of-rows}.

source: Finally, we need a variable to use as a counter. We could call this variable @code{counter}, but a better name is @code{row-number}. That is because what the counter does in this function is count rows, and a program should be written to be as understandable as possible.
es: Finalmente, se necesita una variable para usarse como contador. Se podr@'{@dotless{i}}a llamar a esta variable @code{counter}, pero un nombre mejor es @code{row-number}. Debido a que lo que el contador hace en esta funci@'on es contar filas, y un programa deber@'{@dotless{i}}a escribirse para ser comprendido en la medida de lo posible.
