Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: This is how Lisp works. Simple. There are added complications which we will get to in a minute, but these are the fundamentals. Of course, to write Lisp programs, you need to know how to write function definitions and attach them to names, and how to do this without confusing either yourself or the computer.
es: As@'{@dotless{i}} es como Lisp trabaja. Simple. Hay complicaciones a@~nadidas que veremos en un minuto, pero estos son los fundamentos. Claro est@'a, para escribir programas Lisp, se necesita conocer como escribir definiciones de funci@'on y vincularlas a nombres, y como hacer esto sin confundirnos a nosotros mismos o al ordenador.

source: Now, for the first complication. In addition to lists, the Lisp interpreter can evaluate a symbol that is not quoted and does not have parentheses around it. The Lisp interpreter will attempt to determine the symbol's value as a @dfn{variable}. This situation is described in the section on variables. (@xref{Variables}.)
es: Ahora, una primera complicaci@'on. Adem@'as de las listas, el int@'erprete Lisp puede evaluar un s@'{@dotless{i}}mbolo no citado que no tiene par@'entesis en torno a el. El int@'erprete Lisp intentar@'a determinar el valor del s@'{@dotless{i}}mbolo como una @dfn{variable}. Esta situaci@'on es descrita en el apartado de las variablesla. (Ver @ref{Variables}.)

source: Special form
es: Forma Especial

source: The second complication occurs because some functions are unusual and do not They are used for special jobs, like defining a function, and there are not many of them. In the next few chapters, you will be introduced to several of the more important special forms.
es: La segunda complicaci@'on ocurre debido a que algunas funciones son inusuales y no funcionan de la manera habitual. Estas son llamadas @dfn{formas especiales}. Son usadas para trabajos especiales, como definir una funci@'on, y no son muchas de ellas. En los siguientes cap@'{@dotless{i}}tulos, se introducir@'an varias de las formas especiales m@'as importantes.

source: The third and final complication is this: if the function that the Lisp interpreter is looking at is not a special form, and if it is part of a list, the Lisp interpreter looks to see whether the list has a list inside of it. If there is an inner list, the Lisp interpreter first figures out what it should do with the inside list, and then it works on the outside list. If there is yet another list embedded inside the inner list, it works on that one first, and so on. It always works on the innermost list first. The interpreter works on the innermost list first, to evaluate the result of that list. The result may be used by the enclosing expression.
es: La tercera y final complicaci@'on es la siguiente: si la funci@'on que el int@'erprete Lisp est@'a buscando no es una forma especial, y si es parte de una lista, el int@'erprete Lisp mira si la lista tiene una lista dentro de ella. Si hay una lista dentro, el int@'erprete Lisp primero descubre qu@'e hacer con la lista interior, y luego trabaja en la lista exterior. Si a@'un hay otra lista embebida dentro de la lista interna, trabaja en esta primero, y as@'{@dotless{i}}. Siempre se trabaja en la lista m@'as interna primero. El int@'erprete trabaja en la lista más interana primero, para evaluar el resultado de esta lista. El resultado puede ser usado por la expresi@'on entre par@'entesis.

source: Otherwise, the interpreter works left to right, from one expression to the next.
es: Por lo dem@'as, el int@'erprete trabaja de izquierda a derecha, desde una expresi@'on a la siguiente.

source: Byte compiling
es: Compilando Byte

source: One other aspect of interpreting: the Lisp interpreter is able to interpret two kinds of entity: humanly readable code, on which we will focus exclusively, and specially processed code, called @dfn{byte compiled} code, which is not humanly readable. Byte compiled code runs faster than humanly readable code.
es: Otro aspecto de interpretaci@'on: el int@'erprete Lisp es capaz de interpretar dos tipos de entidad: c@'odigo humanamente legible, en el que nos centraremos exclusivamente, y c@'odigo especialmente procesado, llamado @dfn{byte compilado}, que no es humanamente legible. El c@'odigo m@'aquina compilado se ejecuta m@'as r@'apido que el c@'odigo humanamente legible.

source: You can transform humanly readable code into byte compiled code by running one of the compile commands such as @code{byte-compile-file}. Byte compiled code is usually stored in a file that ends with a @file{.elc} extension rather than a @file{.el} extension. You will see both kinds of file in the @file{emacs/lisp} directory; the files to read are those with @file{.el} extensions.
es: Tu puedes transformar c@'odigo legible por humanos en c@'odigo compilado ejecutando uno de los comandos de compilacion como @code{byte-compile-file}. El c@'odigo compilado es normalmente almacenado en un fichero que finaliza con una extensi@'on @file{.elc} en vez de una extensi@'on @file{.el}. Ver@'as ambos tipos de ficheros en el directorio @file{emacs/lisp}; los ficheros para leer estos tienen la extensi@'on @file{.el}.

source: As a practical matter, for most things you might do to customize or extend Emacs, you do not need to byte compile; and I will not discuss the topic here. @xref{Byte Compilation, , Byte Compilation, elisp, The GNU Emacs Lisp Reference Manual}, for a full description of byte compilation.
es: Como una cuesti@'on pr@'actica, para hacer la mayor@'{@dotless{i}}a de las cosas como personalizar o extender Emacs, no necesitas compilar byte; y no comentare el asunto aqu@'{@dotless{i}}. Ver @ref{Compilaci@'on de Byte, , Compilaci@'on de Byte, elisp, El Manual de Referencia de GNU Emacs}, para una completa descripci@'on sobre compilar c@'odigo.

source: When the Lisp interpreter works on an expression, the term for the activity is called @dfn{evaluation}. We say that the interpreter `evaluates the expression'. I've used this term several times before. The word comes from its use in everyday language, `to ascertain the value or amount of; to appraise', according to @cite{Webster's New Collegiate Dictionary}.
es: Cuando el int@'erprete Lisp trabaja en una expresi@'on, el t@'ermino para la actividad es llamada @dfn{evaluaci@'on}. Decimos que el int@'erprete `eval@'ua la expresi@'on'. Yo he usado este t@'ermino varias veces antes. La palabra proviene de su uso en el lenguaje cotidiano, `para determinar el valor o la cantidad de; para estimar' de acuerdo a @cite{Webster's New Collegiate Dictionary}.

source: How the Lisp Interpreter Acts
es: C@'omo el int@'erprete act@'ua

source: @samp{returned value} explained
es: @samp{valor devuelto} explicado

source: After evaluating an expression, the Lisp interpreter will most likely @dfn{return} the value that the computer produces by carrying out the instructions it found in the function definition, or perhaps it will give up on that function and produce an error message. (The interpreter may also find itself tossed, so to speak, to a different function or it may attempt to repeat continually what it is doing for ever and ever in what is called an `infinite loop'. These actions are less common; and we can ignore them.) Most frequently, the interpreter returns a value.
es: Despu@'es de evaluar una expresi@'on, el int@'erprete Lisp normalmente @dfn{devuelve} el valor que el ordenador produce al llevar a cabo las instrucciones encontradas en la definici@'on de la funci@'on, o quiz@'as dar@'a esta funci@'on y producir@'a un mensaje de error. (El int@'erprete puede tambi@'en quedarse colgado, por as@'{@dotless{i}} decirlo, a una funci@'on diferente o puede intentar repetir continuamente lo que est@'a haciendo y para siempre en lo que se llama un `bucle infinito'. Estas acciones son menos comunes; y pueden ignorarse). M@'as frecuentemente, el int@'erprete devuelve un valor.

source: @samp{side effect} defined
es: @samp{efecto lateral} definido

source: At the same time the interpreter returns a value, it may do something else as well, such as move a cursor or copy a file; this other kind of action is called a @dfn{side effect}. Actions that we humans think are important, such as printing results, are often ``side effects'' to the Lisp interpreter. The jargon can sound peculiar, but it turns out that it is fairly easy to learn to use side effects.
es: Al mismo tiempo el int@'erprete devuelve un valor, puede hacer cualquier cosa m@'as tambi@'en, tal como mover un cursor o copiar un fichero; este otro tipo de acci@'on es llamado @dfn{efecto secundario}. Acciones que los humanos creen que son importantes tales como imprimir resultados, con frecuencia son, ``efectos secundarios'' del int@'erprete Lisp. La jerga puede sonar peculiar, pero resulta que es bastante f@'acil aprender a utilazar los efectos secundarios.

source: In summary, evaluating a symbolic expression most commonly causes the Lisp interpreter to return a value and perhaps carry out a side effect; or else produce an error.
es: En resumen, evaluar una expresi@'on simb@'olica normalmente causa que el int@'erprete devuelva un valor y tal vez llevar a cabo un efecto secundario; o al menos produce un error.

source: Inner list evaluation
es: Evaluaci@'on de listas internas

source: Evaluating inner lists
es: Evaluando listas internas

source: If evaluation applies to a list that is inside another list, the outer list may use the value returned by the first evaluation as information when the outer list is evaluated. This explains why inner expressions are evaluated first: the values they return are used by the outer expressions.
es: Si la evaluaci@'on se aplica a una lista que est@'a dentro de una lista, la lista externa puede usar el valor devuelto por la primera evaluaci@'on como informaci@'on cuando la lista externa es evaluada. Esto explica por qu@'e las expresiones internas son evaluadas primero: los valores devueltos son usados por las expresiones externas.

source: We can investigate this process by evaluating another addition example. Place your cursor after the following expression and type @kbd{C-x C-e}:
es: Nosotros podemos investigar este proceso evaluando otro ejemplo adicional. Coloca tu cursor despu@'es de la siguiente expresi@'on y presiona @kbd{C-x C-e}:

source: The number 8 will appear in the echo area.
es: El n@'umero 8 aparecer@'a en el @'area echo.

source: What happens is that the Lisp interpreter first evaluates the inner expression, @code{(+ 3 3)}, for which the value 6 is returned; then it evaluates the outer expression as if it were written @code{(+ 2 6)}, which returns the value 8. Since there are no more enclosing expressions to evaluate, the interpreter prints that value in the echo area.
es: Lo que ocurre es que el int@'erprete Lisp primero eval@'ua la expresi@'on interna, @code{(+ 3 3)}, para que el valor 6 se devuelva; a continuaci@'on eval@'ua la expresi@'on externa como si fuera escrita @code{(+ 2 6)}, que devuelve el valor 8. Puesto que no hay m@'as expresiones entre parentesis a evaluar el int@'erprete imprime este valor en el @'area echo.

source: Now it is easy to understand the name of the command invoked by the keystrokes @kbd{C-x C-e}: the name is @code{eval-last-sexp}. The letters @code{sexp} are an abbreviation for `symbolic expression', and @code{eval} is an abbreviation for `evaluate'. The command means `evaluate last symbolic expression'.
es: Ahora es f@'acil comprender el nombre del comando invocado por el atajo @kbd{C-x C-e}: el nombre es @code{eval-last-sexp}. Las letras @code{sexp} son una abreviaci@'on para `expresi@'on simb@'olica', y @code{eval} es una abreviaci@'on para `evaluar'. El comando significa `evaluar la @'ultima expresi@'on simb@'olica'.

source: As an experiment, you can try evaluating the expression by putting the cursor at the beginning of the next line immediately following the expression, or inside the expression.
es: Como un experimento, puedes intentar evaluar la expresi@'on poniendo el cursor al principio de la siguiente l@'{@dotless{i}}nea inmediatamente despu@'es de la expresi@'on, o dentro de la expresi@'on.

source: Here is another copy of the expression:
es: Aqu@'{@dotless{i}} hay otra copia de la expresi@'on:

source: If you place the cursor at the beginning of the blank line that immediately follows the expression and type @kbd{C-x C-e}, you will still get the value 8 printed in the echo area. Now try putting the cursor inside the expression. If you put it right after the next to last parenthesis (so it appears to sit on top of the last parenthesis), you will get a 6 printed in the echo area! This is because the command evaluates the expression @code{(+ 3 3)}.
es: Si se posiciona el cursor al principio de la l@'{@dotless{i}}nea en blanco que sigue inmediatamente a la expresi@'on y presionas @kbd{C-x C-e}, todav@'{@dotless{i}}a se obtendr@'a el valor 8 impreso en el @'area echo. Ahora intenta poner el cursor dentro de la expresi@'on. Si lo coloca justo despu@'es del penultimo par@'entesis (dara la impresi@'on de situarse sobre el @'ultimo par@'entesis), @exclamdown{}obtendr@'a un 6 impreso en el @'area echo! Esto es porque el comando eval@'ua la expresi@'on @code{(+ 3 3)}.

source: Now put the cursor immediately after a number. Type @kbd{C-x C-e} and you will get the number itself. In Lisp, if you evaluate a number, you get the number itself---this is how numbers differ from symbols. If you evaluate a list starting with a symbol like @code{+}, you will get a value returned that is the result of the computer carrying out the instructions in the function definition attached to that name. If a symbol by itself is evaluated, something different happens, as we will see in the next section.
es: Ahora coloque el cursor inmediatamente despu@'es de un n@'umero. Presiona @kbd{C-x C-e} y obtendr@'a el n@'umero en s@'{@dotless{i}}. En Lisp, si eval@'uas un n@'umero, obtienes el n@'umero en s@'{@dotless{i}}---as@'i es c@'omo los n@'umeros difieren de los s@'{@dotless{i}}mbolos. Si se eval@'ua una lista que inicia con un s@'{@dotless{i}}mbolo como @code{+}, tendr@'as un valor devuelto que es el resultado del ordenador tras ejecutar las instrucciones que aparecen en la definici@'on de la funci@'on adjunta a este nombre. Si un s@'{@dotless{i}}mbolo por s@'{@dotless{i}} mismo es evaluado, algo diferente sucede, como veremos en la siguiente secci@'on.

source: In Emacs Lisp, a symbol can have a value attached to it just as it can have a function definition attached to it. The two are different. The function definition is a set of instructions that a computer will obey. A value, on the other hand, is something, such as number or a name, that can vary (which is why such a symbol is called a variable). The value of a symbol can be any expression in Lisp, such as a symbol, number, list, or string. A symbol that has a value is often called a @dfn{variable}.
es: En Emacs Lisp, un s@'{@dotless{i}}mbolo puede estar ligado a un valor como a una definici@'on de funci@'on. Las dos son diferentes. La definici@'on de funci@'on es un conjunto de instrucciones que el ordenador ejecuta. Un valor, por otro lado, es algo, como un n@'umero o un nombre, que puede variar (es por ello, que tal s@'{@dotless{i}}mbolo es llamado variable). El valor de un s@'{@dotless{i}}mbolo puede ser cualquier expresi@'on en Lisp, por ejemplo un s@'{@dotless{i}}mbolo, n@'umero, lista, o cadena. Un s@'{@dotless{i}}mbolo que tiene un valor es con frecuencia llamado una @dfn{variable}.

source: A symbol can have both a function definition and a value attached to it at the same time. Or it can have just one or the other. The two are separate. This is somewhat similar to the way the name Cambridge can refer to the city in Massachusetts and have some information attached to the name as well, such as ``great programming center''.
es: Un s@'{@dotless{i}}mbolo puede tener ambos, una definici@'on de funci@'on y un valor adjunto al mismo tiempo. O puede tener solo uno u otro. Los dos son independientes. Esto es algo similar a la forma en que el nombre Cambridge puede referirse a la ciudad en Massachusetts y tener alguna informaci@'on ligada al nombre, por ejemplo, un ``gran centro de programaci@'on''.

source: Another way to think about this is to imagine a symbol as being a chest of drawers. The function definition is put in one drawer, the value in another, and so on. What is put in the drawer holding the value can be changed without affecting the contents of the drawer holding the function definition, and vice-verse.
es: Otra forma de pensar en esto es imaginar un s@'imbolo como un mueble con cajones. La definici@'on de funci@'on se pone en un caj@'on, el valor en otro, y asi sucesivamente. Lo que se pone en el cajón que contiene el valor puede ser cambiado sin afectar los contenidos del caj@'on que almacena la definici@'on de funci@'on, y viceversa.

source: fill-column Example
es: Ejemplo de rellenar columna

source: @code{fill-column}, an Example Variable
es: @code{fill-column}, un ejemplo de variable

source: fill-column, @r{an example variable}
es: fill-column, @r{una variable de ejemplo}

source: Example variable, @code{fill-column}
es: Variable de Ejemplo, @code{fill-column}

source: Variable, example of, @code{fill-column}
es: Variable, ejemplo de, @code{fill-column}

source: The variable @code{fill-column} illustrates a symbol with a value attached to it: in every GNU Emacs buffer, this symbol is set to some value, usually 72 or 70, but sometimes to some other value. To find the value of this symbol, evaluate it by itself. If you are reading this in Info inside of GNU Emacs, you can do this by putting the cursor after the symbol and typing @kbd{C-x C-e}:
es: La variable @code{fill-column} ilustra un s@'{@dotless{i}}mbolo con un valor adjunto: en cada buffer de GNU Emacs, este s@'{@dotless{i}}mbolo se establece a alg@'un valor, normalmente 72 o 70, pero algunas veces a alg@'un otro valor. Para encontrar el valor de este s@'{@dotless{i}}mbolo, eval@'ualo por s@'{@dotless{i}} mismo. Si est@'a leyendo esto en Info dentro de GNU Emacs, puedes hacer esto poniendo el cursor despu@'es del s@'{@dotless{i}}mbolo y pulsar @kbd{C-x C-e}:

source: After I typed @kbd{C-x C-e}, Emacs printed the number 72 in my echo area. This is the value for which @code{fill-column} is set for me as I write this. It may be different for you in your Info buffer. Notice that the value returned as a variable is printed in exactly the same way as the value returned by a function carrying out its instructions. From the point of view of the Lisp interpreter, a value returned is a value returned. What kind of expression it came from ceases to matter once the value is known.
es: Despu@'es de presionar @kbd{C-x C-e}, Emacs imprimi@'o el n@'umero 72 en mi @'area echo. Este es el valor que he establecido para @code{fill-column} mientras escribo esto. Puede ser diferente para ti en tu b@'uffer Info. Observe que el valor devuelto como una variable es impreso exactamente de la misma forma que el valor devuelto por una funci@'on tras ejecutar sus instrucciones. Desde el punto de vista del int@'erprete Lisp, un valor devuelto es un valor devuelto. Que tipo de expresi@'on sea, deja de importar una vez que el valor se conoce.

source: A symbol can have any value attached to it or, to use the jargon, we can @dfn{bind} the variable to a value: to a number, such as 72; to a string, @code{"such as this"}; to a list, such as @code{(spruce pine oak)}; we can even bind a variable to a function definition.
es: Un s@'{@dotless{i}}mbolo puede tener cualquier valor ligado a él o, siendo tecnicos, se puede @dfn{bind} (asociar) la variable a un valor: a un n@'umero, por ejemplo 72; a una cadena, @code{\"como esta\"}; a una lista, como @code{(abeto pino roble)}; podemos incluso asociar una variable a una definici@'on de funci@'on.

source: A symbol can be bound to a value in several ways. @xref{set & setq, , Setting the Value of a Variable}, for information about one way to do this.
es: Un s@'{@dotless{i}}mbolo puede vincularse a un valor de varias maneras. Ver @ref{set y setq, , Configurando el valor de una variable}, para obtener informaci@'on sobre una manera de hacer esto.

source: Error Message for a Symbol Without a Function
es: Mensaje de error de un s@'{@dotless{i}}mbolo sin una funci@'on

source: Symbol without function error
es: S@'{@dotless{i}}mbolo sin funci@'on de error

source: Error for symbol without function
es: Error para s@'{@dotless{i}}mbolo sin funci@'on

source: When we evaluated @code{fill-column} to find its value as a variable, we did not place parentheses around the word. This is because we did not intend to use it as a function name.
es: Cuando se eval@'ua @code{fill-column} para encontrar el valor de una variable, no se ponen par@'entesis alrededor de la palabra. Esto es porque no pretendemos usarlos como un nombre de funci@'on.

source: If @code{fill-column} were the first or only element of a list, the Lisp interpreter would attempt to find the function definition attached to it. But @code{fill-column} has no function definition. Try evaluating this:
es: Si @code{fill-column} fuese el primer o @'unico elemento de una lista, el int@'erprete de Lisp intentar@'{@dotless{i}}a encontrar la definici@'on de funci@'on adjunta. Pero @code{fill-column} no tiene una definici@'on de funci@'on. Prueba evaluando esto:

source: You will create a @file{*Backtrace*} buffer that says:
es: Se crear@'a un buffer @file{*Backtrace*} que dice:

source: (Remember, to quit the debugger and make the debugger window go away, type @kbd{q} in the @file{*Backtrace*} buffer.)
es: (Recuerda, para salir del depurador y hacer que la ventana del depurador desaparezca, presiona @kbd{q} en el buffer @file{*Backtrace*}.)

source: Symbol's function definition is void:@: fill-column
es: La definici@'on de s@'{@dotless{i}}mbolos de funci@'on:@: fill-column

source: Error Message for a Symbol Without a Value
es: Mensaje de error de un s@'{@dotless{i}}mbolo sin un valor

source: Symbol without value error
es: S@'{@dotless{i}}mbolo sin valor de error

source: Error for symbol without value
es: Error para s@'{@dotless{i}}mbolo sin valor

source: If you attempt to evaluate a symbol that does not have a value bound to it, you will receive an error message. You can see this by experimenting with our 2 plus 2 addition. In the following expression, put your cursor right after the @code{+}, before the first number 2, type @kbd{C-x C-e}:
es: Si se intenta evaluar un s@'{@dotless{i}}mbolo que no tiene un valor asociado, recibir@'a un mensaje de error. Esto se puede ver experimentando con nuestra suma 2 m@'as 2. En la siguiente expresi@'on, pon el cursor correcto despu@'es del @code{+}, antes del primer n@'umero 2, presiona @kbd{C-x C-e}:

source: In GNU Emacs 22, you will create a @file{*Backtrace*} buffer that says:
es: En GNU Emacs 24, se crear@'a un buffer @file{*Backtrace*} que dice:

source: (Again, you can quit the debugger by typing @kbd{q} in the @file{*Backtrace*} buffer.)
es: (De nuevo, se puede salir del depurador pulsando @kbd{q} en el b@'uffer @file{*Backtrace*}.)

source: This backtrace is different from the very first error message we saw, which said, @samp{Debugger entered--Lisp error: (void-function this)}. In this case, the function does not have a value as a variable; while in the other error message, the function (the word `this') did not have a definition.
es: Esta traza es diferente del primer mensaje de error que vimos, que dijimos, @samp{Debugger entered--Lisp error: (void-function esto)}. En este caso, la funci@'on no tiene una valor como una variable; mientras en el otro mensaje de error, la funci@'on (la palabra `esto') no tuvo una definici@'on.
