Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: But when the list has at least one element, @itemize @minus @item act on the beginning of the list (the @sc{car} of the list), @item and make a recursive call on the rest (the @sc{cdr}) of the list. @end itemize
es: Pero cuando la lista tiene al menos un elemento, @itemize @item act@'ua al principio de la lista (el @sc{car} de la lista), @item y crea una llamada recursiva en el resto (el @sc{cdr} de la lista). @end itemize

source: Accumulate
es: Acumular

source: Recursive Pattern: @emph{accumulate}
es: Patr@'on recursivo: @emph{accumulate}

source: Accumulate, type of recursive pattern
es: Acumular, tipo de patr@'on recursivo

source: Recursive pattern: accumulate
es: Patr@'on recursivo: acumular

source: Another recursive pattern is called the @code{accumulate} pattern. In the @code{accumulate} recursive pattern, an action is performed on every element of a list and the result of that action is accumulated with the results of performing the action on the other elements.
es: Otro patr@'on recursivo es llamado el patr@'on @code{accumulate}. En el patr@'on recursivo @code{accumulate}, se realiza una acci@'on en cada elemento de una lista y el resultado de esta acci@'on se acumula con los resultados de desarrollar la acci@'on en otros elementos.

source: This is very like the `every' pattern using @code{cons}, except that @code{cons} is not used, but some other combiner.
es: Esto es como `cada' patr@'on usando @code{cons}, excepto que este @code{cons} no se est@'e usando, pero que alg@'un otro combine.

source: The pattern is:
es: El patr@'on es:

source: If a list be empty, return zero or some other constant.
es: Si una lista est@'a vac@'{@dotless{i}}a, devuelve cero o alguna otra constante.

source: Else, act on the beginning of the list (the @sc{car} of the list), @itemize @minus @item and combine that acted-on element, using @code{+} or some other combining function, with @item a recursive call by the function on the rest (the @sc{cdr}) of the list. @end itemize
es: Lo dem@'as, act@'ua al principio de la lista (el @sc{car} de la lista), @itemize @item y combinar este elemento que act@'ua, usando @code{+} o alguna otra funci@'on de combinaci@'on, con @item una llamada recursiva por la funci@'on en el resto (el @sc{cdr}) de la lista. @end itemize

source: Here is an example:
es: Aqu@'{@dotless{i}} hay un ejemplo:

source: (defun add-elements (numbers-list) "Add the elements of NUMBERS-LIST together." (if (not numbers-list) 0 (+ (car numbers-list) (add-elements (cdr numbers-list)))))
es: (defun add-elements (numbers-list) "A@~nade los elementos de NUMBERS-LIST juntos." (if (not numbers-list) 0 (+ (car numbers-list) (add-elements (cdr numbers-list)))))

source: @xref{Files List, , Making a List of Files}, for an example of the accumulate pattern.
es: @xref{Listar ficheros, , Creando una lista de ficheros}, para un ejemplo del patr@'on acumulado.

source: Recursive Pattern: @emph{keep}
es: Patr@'on recursivo: @emph{keep}

source: Keep, type of recursive pattern
es: Keep, el tipo de patr@'on recursivo

source: Recursive pattern: keep
es: Patr@'on recursivo: keep

source: A third recursive pattern is called the @code{keep} pattern. In the @code{keep} recursive pattern, each element of a list is tested; the element is acted on and the results are kept only if the element meets a criterion.
es: Un tercer patr@'on es llamado el patr@'on @code{keep}. En el patr@'on recursivo @code{keep}, se chequea cada elemento de una lista; se act@'ua en el elemento y los resultados se guardan solo si el elemento encuentra un criterio.

source: Again, this is very like the `every' pattern, except the element is skipped unless it meets a criterion.
es: De nuevo, esto se parece al patr@'on `every', excepto que el elemento se descarta a menos que se encuentre un criterio.

source: The pattern has three parts:
es: El patr@'on tiene tres partes:

source: Else, if the beginning of the list (the @sc{car} of the list) passes a test @itemize @minus @item act on that element and combine it, using @code{cons} with @item a recursive call by the function on the rest (the @sc{cdr}) of the list. @end itemize
es: Lo dem@'as, si el principio de la lista (el @sc{car} de la lista) pasa un test @itemize @item actua en este elemento y lo combina, usando @code{cons} con @item una llamada recursiva por la funci@'on en el resto (el @sc{cdr} de la lista. @end itemize

source: Otherwise, if the beginning of the list (the @sc{car} of the list) fails the test @itemize @minus @item skip on that element, @item and, recursively call the function on the rest (the @sc{cdr}) of the list. @end itemize
es: De otro modo, si el principio de la lista (el @sc{car} de la lista) falla el test @itemize @item para en este elemento, @item y, recursivamente llama la funci@'on al resto (el @sc{cdr}) de la lista. @end itemize

source: Here is an example that uses @code{cond}:
es: Aqu@'{@dotless{i}} hay un ejemplo que usa @code{cond}:

source: (defun keep-three-letter-words (word-list) "Keep three letter words in WORD-LIST." (cond ;; First do-again-test: stop-condition ((not word-list) nil)
es: (defun manten-tres-letras (lista-palabras) "Guarda 3 palabras en WORD-LIST." (cond ;; Primero do-again-test: stop-condition ((not lista-palabras) nil)

source: ;; Second do-again-test: when to act ((eq 3 (length (symbol-name (car word-list)))) ;; combine acted-on element with recursive call on shorter list (cons (car word-list) (keep-three-letter-words (cdr word-list))))
es: ;; Segundo do-again-test: cuando actuar ((eq 3 (length (symbol-name (car lista-palabras)))) ;; combina el elemento que act@'ua con la llamada recursiva en la ;; lista ordenada (cons (car lista-palabras) (manten-tres-letras (cdr lista-palabras))))

source: ;; Third do-again-test: when to skip element; ;; recursively call shorter list with next-step expression (t (keep-three-letter-words (cdr word-list)))))
es: ;; Tercero do-again-test: cuando se descarte el elemento; ;; llama recursivamente a la lista ordenada con la next-step expression (t (manten-tres-letras (cdr lista-palabras)))))

source: (keep-three-letter-words '(one two three four five six)) @result{} (one two six)
es: (manten-tres-letras '(uno dos tres cuatro cinco seis)) @result{} (uno dos)

source: It goes without saying that you need not use @code{nil} as the test for when to stop; and you can, of course, combine these patterns.
es: Eso va sin decir que no se necesita usar @code{nil} como si el test para cuando para; y se puede, de acuerdo, combinar estos patrones.

source: Recursion without Deferments
es: Recursi@'on sin diferir

source: Deferment in recursion
es: Diferir en recursi@'on

source: Let's consider again what happens with the @code{triangle-recursively} function. We will find that the intermediate calculations are deferred until all can be done.
es: Permita considerar de nuevo qu@'e ocurre con la funci@'on @code{triangle-recursively}. Nosotros encontraremos que los c@'alculos difieran hasta que todo pueda ser hecho.

source: Here is the function definition:
es: Aqu@'{@dotless{i}} est@'a la definici@'on de funci@'on:

source: (defun triangle-recursively (number) "Return the sum of the numbers 1 through NUMBER inclusive. Uses recursion." (if (= number 1) ; @r{do-again-test} 1 ; @r{then-part} (+ number ; @r{else-part} (triangle-recursively ; @r{recursive call} (1- number))))) ; @r{next-step-expression}
es: (defun triangle-recursively (number) "Devuelve la suma de los n@'umeros 1 a trav@'es de NUMBER inclusive Usa recursi@'on." (if (= number 1) ; @r{do-again-test} 1 ; @r{then-part} (+ number ; @r{else-part} (triangle-recursively ; @r{recursive call} (1- number))))) ; @r{next-step-expression}

source: What happens when we call this function with a argument of 7?
es: @questiondown{}Qu@'e ocurre cuando se llama a esta funci@'on con un argumento de 7?

source: The first instance of the @code{triangle-recursively} function adds the number 7 to the value returned by a second instance of @code{triangle-recursively}, an instance that has been passed an argument of 6. That is to say, the first calculation is:
es: La primera instancia de la funci@'on @code{triangle-recursively} a@~nade el n@'umero 7 al valor devuelto por una segunda instancia de @code{triangle-recursively}, una instancia que ha pasado un argumento de 6. As@'{@dotless{i}}, el primer c@'alculo es:

source: The first instance of @code{triangle-recursively}---you may want to think of it as a little robot---cannot complete its job. It must hand off the calculation for @code{(triangle-recursively 6)} to a second instance of the program, to a second robot. This second individual is completely different from the first one; it is, in the jargon, a `different instantiation'. Or, put another way, it is a different robot. It is the same model as the first; it calculates triangle numbers recursively; but it has a different serial number.
es: La primera instancia de @code{triangle-recursively} --- se puede querer pensar como un peque@~no robot --- no puede completar su trabajo. Eso debe manejar el c@'alculo para @code{(triangle-recursively 6)} a una segunda instancia del programa, a un segundo robot. Este segundo individuo es completamente diferente desde el primero; eso es, en la jerga, una `diferente instanciaci@'on'. O, poner otro camino, eso es un diferente robot. Eso es el mismo modelo como el primero; eso calcula n@'umeros de tri@'angulo recursivamente; pero eso tiene un n@'umero de serie diferente.

source: And what does @code{(triangle-recursively 6)} return? It returns the number 6 added to the value returned by evaluating @code{triangle-recursively} with an argument of 5. Using the robot metaphor, it asks yet another robot to help it.
es: @questiondown{}Y qu@'e hace @code{(triangle-recursively 6)} devuelve? Eso devuelve el n@'umero 6 a@~nadido al valor devuelto para evaluar @code{triangle-recursively} con un argumento de 5. Usando la met@'afora del robot, eso cuestiona todav@'{@dotless{i}}a otro robot para ayudarle.

source: Now the total is:
es: Ahora el total es:

source: And what happens next?
es: @questiondown{}Y qu@'e ocurre despu@'es?

source: Each time @code{triangle-recursively} is called, except for the last time, it creates another instance of the program---another robot---and asks it to make a calculation.
es: Cada vez que @code{triangle-recursively} es llamado, excepto por la @'ultima vez, eso crea otra instancia del programa --- otro robot --- y pregunta para crear un c@'alculo.

source: Eventually, the full addition is set up and performed:
es: Finalmente, la adici@'on completa es de la siguiente manera:

source: This design for the function defers the calculation of the first step until the second can be done, and defers that until the third can be done, and so on. Each deferment means the computer must remember what is being waited on. This is not a problem when there are only a few steps, as in this example. But it can be a problem when there are more steps.
es: Este dise@~no para la funci@'on difiere el c@'alculo del primer paso hasta el segundo puede ser hecho, y difiere esto hasta que el tercero puede ser hecho, y as@'{@dotless{i}}. Cada defermento significa el ordenador debe recordar que est@'a siendo esperado dentro. Esto no es un problema cuando hay solo unos pocos pasos, como en este ejemplo. Pero eso puede ser un problema cuando hay m@'as pasos.

source: No Deferment Solution
es: No hay soluci@'on pospuesta

source: Defermentless solution
es: Sin posponer la soluci@'on

source: Solution without deferment
es: Soluci@'on no pospuesta

source: The solution to the problem of deferred operations is to write in a manner that does not defer operations@footnote{The phrase @dfn{tail recursive} is used to describe such a process, one that uses `constant space'.}. This requires writing to a different pattern, often one that involves writing two function definitions, an `initialization' function and a `helper' function.
es: La soluci@'on al problema de operaciones pospuestas es para escribir en una manera que no posponga operaciones@footnote{La frase @dfn{cola recursiva} es usado para describir tal proceso, uno que usa `espacio constante'.}. Esto requiere escribir a un patr@'on diferente, con frecuencia uno que involucra escribiendo dos definiciones de funci@'on, una funci@'on de `inicializaci@'on' y una funci@'on `ayuda'.

source: The `initialization' function sets up the job; the `helper' function does the work.
es: La funci@'on `inicializacion' configura el trabajo; la funci@'on `ayudante' hace el trabajo.

source: Here are the two function definitions for adding up numbers. They are so simple, I find them hard to understand.
es: Aqu@'{@dotless{i}} hay dos definiciones para a@~nadir n@'umeros. Son as@'{@dotless{i}} de simple, aunque se encuentre duro de comprender.

source: (defun triangle-initialization (number) "Return the sum of the numbers 1 through NUMBER inclusive. This is the `initialization' component of a two function duo that uses recursion." (triangle-recursive-helper 0 0 number))
es: (defun triangle-initialization (number) "Devuelve la suma de los n@'umeros 1 a trav@'es de NUMBER inclusive. Este es el componente de `inicializaci@'on' de una funci@'on d@'uo que usa recursi@'on" (triangle-recursive-helper 0 0 number))

source: (defun triangle-recursive-helper (sum counter number) "Return SUM, using COUNTER, through NUMBER inclusive. This is the `helper' component of a two function duo that uses recursion." (if (> counter number) sum (triangle-recursive-helper (+ sum counter) ; @r{sum} (1+ counter) ; @r{counter} number))) ; @r{number}
es: (defun triangle-recursive-helper (sum counter number) "Devuelve SUM, usando COUNTER, a trav@'es de NUMBER inclusive. Este es el componente `helper' de unas dos funciones que usan recursi@'on." (if (> counter number) sum (triangle-recursive-helper (+ sum counter) ; @r{suma} (1+ counter) ; @r{contador} number))) ; @r{n@'umero}

source: Install both function definitions by evaluating them, then call @code{triangle-initialization} with 2 rows:
es: Instalar ambas definiciones de funci@'on por evaluarlo, entonces llama a @code{triangle-initialization} con 2 filas:

source: The `initialization' function calls the first instance of the `helper' function with three arguments: zero, zero, and a number which is the number of rows in the triangle.
es: La funci@'on `inicializaci@'on' llama la primera instancia de la funci@'on `ayudante' con tres argumentos: cero, cero, y un n@'umero que es el n@'umero de filas en el tri@'angulo.

source: The first two arguments passed to the `helper' function are initialization values. These values are changed when @code{triangle-recursive-helper} invokes new instances.@footnote{The jargon is mildly confusing: @code{triangle-recursive-helper} uses a process that is iterative in a procedure that is recursive. The process is called iterative because the computer need only record the three values, @code{sum}, @code{counter}, and @code{number}; the procedure is recursive because the function `calls itself'. On the other hand, both the process and the procedure used by @code{triangle-recursively} are called recursive. The word `recursive' has different meanings in the two contexts.}
es: Los primeros dos argumentos pasaron a la funci@'on `ayuda' son valores de inicializaci@'on. Estos valores son cambiados cuando @code{triangle-recursive-helper} invocan nuevas instancias.@footnote{La jerga es medianamente confusa: @code{triangle-recursive-helper} usa un proceso que es iterativo en un procedimiento que es recursivo. El proceso se llama iterativo porque el ordenador necesita solo grabar los tres valores, @code{suma}, @code{contador}, y @code{n@'umero}: el procedimiento es recursivo porque la funci@'on `llama a s@'{@dotless{i}} mismo'. Por otro lado, ambos el proceso y el procedimiento usado por @code{triangle-recursively} son llamados recursivos. La palabra `recursivo' tiene diferentes significados en los dos contextos.}

source: Let's see what happens when we have a triangle that has one row. (This triangle will have one pebble in it!)
es: Perm@'{@dotless{i}}tase ver que ocurre cuando tenemos un tri@'angulo que tiene una fila. (@exclamdown{}Este tri@'angulo tendr@'a un asterisco dentro!)

source: @code{triangle-initialization} will call its helper with the arguments @w{@code{0 0 1}}. That function will run the conditional test whether @code{(> counter number)}:
es: @code{triangle-initialization} llamar@'a su ayudante con los argumentos @w{@code{0 0 1}}. Esta funci@'on ejecutar@'a el test condicional si @code{(> counter number)}:

source: and find that the result is false, so it will invoke the else-part of the @code{if} clause:
es: y encuentra que el resultado es falso, as@'{@dotless{i}} invocar@'a la else-part de la cla@'usula @code{if}:

source: (triangle-recursive-helper (+ sum counter) ; @r{sum plus counter} @result{} @r{sum} (1+ counter) ; @r{increment counter} @result{} @r{counter} number) ; @r{number stays the same}
es: (triangle-recursive-helper (+ sum counter) ; @r{sum m@'as counter} @result{} @r{sum} (1+ counter) ; @r{incrementa counter} @result{} @r{counter} number) ; @r{number parece lo mismo}

source: which will first compute:
es: que computar@'a primero:

source: which is:
es: que es:

source: Again, @code{(> counter number)} will be false, so again, the Lisp interpreter will evaluate @code{triangle-recursive-helper}, creating a new instance with new arguments.
es: De nuevo, @code{(> counter number)} ser@'a falso, as@'{@dotless{i}} de nuevo, el int@'erprete Lisp evaluar@'a @code{triangle-recursive-helper}, creando una nueva instancia con nuevos argumentos.

source: This new instance will be;
es: Esta nueva instancia ser@'a;

source: (triangle-recursive-helper (+ sum counter) ; @r{sum plus counter} @result{} @r{sum} (1+ counter) ; @r{increment counter} @result{} @r{counter} number) ; @r{number stays the same}
es: (triangle-recursive-helper (+ sum counter) ; @r{suma m@'as contador} @result{} @r{sum} (1+ counter) ; @r{incrementar contador} @result{} @r{contador} number) ; @r{n@'umero empieza lo mismo}

source: In this case, the @code{(> counter number)} test will be true! So the instance will return the value of the sum, which will be 1, as expected.
es: En este caso, el test @code{(> counter number)} @exclamdown{}ser@'a cierto! As@'{@dotless{i}} la instancia devolver@'a el valor de la suma, que ser@'a 1, como se espera.

source: Now, let's pass @code{triangle-initialization} an argument of 2, to find out how many pebbles there are in a triangle with two rows.
es: Ahora, permite pasar @code{triangle-initialization} un argumento de 2, para encontrar cu@'antos asterisco hay en un tri@'angulo con dos filas.

source: That function calls @code{(triangle-recursive-helper 0 0 2)}.
es: Esta funci@'on llama @code{(triangle-recursive-helper 0 0 2)}.

source: In stages, the instances called will be:
es: En fases, las instancias llamadas ser@'an:

source: @r{sum counter number} (triangle-recursive-helper 0 1 2)
es: @r{suma contador n@'umero} (triangle-recursive-helper 0 1 2)

source: When the last instance is called, the @code{(> counter number)} test will be true, so the instance will return the value of @code{sum}, which will be 3.
es: Cuando la @'ultima instancia se llama, el @code{(> counter number)} se chequea si ser@'a cierto, as@'{@dotless{i}} la instancia devolver@'a el valor de @code{sum}, que ser@'a 3.

source: This kind of pattern helps when you are writing functions that can use many resources in a computer.
es: Este tipo de patr@'on ayuda cuando est@'as escribiendo funciones que puede usar recursos en un ordenador.

source: Looping Exercise
es: Ejercicio de bucles

source: Write a function similar to @code{triangle} in which each row has a value which is the square of the row number. Use a @code{while} loop.
es: Escribe una funci@'on similar a @code{triangle} en el que cada fila tiene un valor que es la ra@'{@dotless{i}}z del n@'umero de la fila. Usa un bucle @code{while}.

source: Write a function similar to @code{triangle} that multiplies instead of adds the values.
es: Escribe una funci@'on similar para @code{triangle} que multiplique en vez de a@~nadir los valores.

source: Rewrite these two functions recursively. Rewrite these functions using @code{cond}.
es: Reescribe estas dos funciones recursivamente. Reescribe estas funciones usando @code{cond}.

source: Write a function for Texinfo mode that creates an index entry at the beginning of a paragraph for every @samp{@@dfn} within the paragraph. (In a Texinfo file, @samp{@@dfn} marks a definition. This book is written in Texinfo.)
es: Escribe una funci@'on para el modo Texinfo que crea una entrada @'{@dotless{i}}ndice al principio de un p@'arrafo para cada @samp{@@dfn} con el p@'arrafo. (En un fichero Texinfo, @samp{@@dfn} marca una definici@'on. El libro es escrito en Texinfo.)

source: Many of the functions you will need are described in two of the previous chapters, @ref{Cutting & Storing Text, , Cutting and Storing Text}, and @ref{Yanking, , Yanking Text Back}. If you use @code{forward-paragraph} to put the index entry at the beginning of the paragraph, you will have to use @w{@kbd{C-h f}} (@code{describe-function}) to find out how to make the command go backwards.
es: Muchas de las funciones necesitar@'an ser descritas en dos de los cap@'{@dotless{i}}tulos, @ref{Cortando y almacenando texto, , Cortando y almacenando texto} y @ref{Pegando, , Pegando texto}. Si usas @code{forward-paragraph} para poner la entrada @'{@dotless{i}}ndice al principio del p@'arrafo, tendr@'a que usar @w{@kbd{C-h f}} (@code{describe-function}) para encontrar c@'omo conseguir que el comando vaya hacia atr@'as.

source: For more information, see
es: Para m@'as informaci@'on, ver

source: @ref{Indicating, , Indicating Definitions, texinfo}.
es: @ref{Indicando Definiciones, texinfo}.

source: @ref{Indicating, , Indicating, texinfo, Texinfo Manual}, which goes to a Texinfo manual in the current directory. Or, if you are on the Internet, see @uref{http://www.gnu.org/software/texinfo/manual/texinfo/}
es: @ref{Indicando, , Indicando, texinfo, Manual de Texinfo}, que va al manual Texinfo en el actual directorio. O, si est@'as en Internet, mira @uref{http://www.gnu.org/software/texinfo/manual/texinfo/}

source: ``Indicating Definitions, Commands, etc.'' in @cite{Texinfo, The GNU Documentation Format}.
es: ``Indicando Definiciones, Comandos, etc.'' en @cite{Texinfo, el Formato de Documentaci@'on de GNU}.

source: Searches, illustrating
es: B@'usquedas, ilustrando

source: Regular expression searches
es: B@'usquedas de expresiones regulares

source: Patterns, searching for
es: Patrones, buscando por

source: Motion by sentence and paragraph
es: Mover frase y p@'arrafo

source: Sentences, movement by
es: Frases, movimiento por

source: Paragraphs, movement by
es: P@'arrafos, movimiento por

source: Regular expression searches are used extensively in GNU Emacs. The two functions, @code{forward-sentence} and @code{forward-paragraph}, illustrate these searches well. They use regular expressions to find where to move point. The phrase `regular expression' is often written as `regexp'.
es: Las b@'usquedas expresiones regulares son usadas extensivamente en GNU Emacs. Las dos funciones @code{forward-sentence} y @code{forward-paragraph}, ilustran estas b@'usquedas bien. Usan expresiones regulares para encontrar donde mover el punto. La frase `expresi@'on regular' es con frecuencia escrita como `regexp'.
