Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: We also need to determine the length of the horizontal axis, which is the length of the numbers list, and the number of ticks in the horizontal axis:
es: Tambi@'en necesita determinar el tama@~no del eje horizontal, que es el tama@~no de la lista de n@'umeros, y el n@'umero de ticks en el eje horizontal:

source: All this leads us directly to the function for printing the X axis tic line:
es: Todo esto lidera directamente a la funci@'on para imprimir el eje X:

source: (defun print-X-axis-tic-line (number-of-X-tics X-axis-leading-spaces X-axis-tic-element) "Print ticks for X axis." (insert X-axis-leading-spaces) (insert X-axis-tic-symbol) ; @r{Under first column.}
es: (defun print-X-axis-tic-line (number-of-X-tics X-axis-leading-spaces X-axis-tic-element) "Imprime ticks para el eje X." (insert X-axis-leading-spaces) (insert X-axis-tic-symbol) ; @r{En la primera columna.}

source: ;; @r{Insert second tic in the right spot.} (insert (concat (make-string (- (* symbol-width X-axis-label-spacing) ;; @r{Insert white space up to second tic symbol.} (* 2 (length X-axis-tic-symbol))) ? ) X-axis-tic-symbol))
es: ;; @r{Inserta el segundo tic en el lugar adecuado.} (insert (concat (make-string (- (* symbol-width X-axis-label-spacing) ;; @r{Inserta el espacio en blanco al segundo s@'{@dotless{i}}mbolo tic.} (* 2 (length X-axis-tic-symbol))) ? ) X-axis-tic-symbol))

source: ;; @r{Insert remaining ticks.} (while (> number-of-X-tics 1) (insert X-axis-tic-element) (setq number-of-X-tics (1- number-of-X-tics))))
es: ;; @r{Inserta los ticks que permanecen.} (while (> number-of-X-tics 1) (insert X-axis-tic-element) (setq number-of-X-tics (1- number-of-X-tics))))

source: The line of numbers is equally straightforward:
es: La l@'{@dotless{i}}nea de n@'umeros es igualmente simple:

source: First, we create a numbered element with blank spaces before each number:
es: Primero, creamos un elemento numerado con espacios en blanco antes de cada n@'umero:

source: (defun X-axis-element (number) "Construct a numbered X axis element." (let ((leading-spaces (- (* symbol-width X-axis-label-spacing) (length (number-to-string number))))) (concat (make-string leading-spaces ? ) (number-to-string number))))
es: (defun X-axis-element (number) "Construye un elemento del eje X numerado." (let ((leading-spaces (- (* symbol-width X-axis-label-spacing) (length (number-to-string number))))) (concat (make-string leading-spaces ? ) (number-to-string number))))

source: Next, we create the function to print the numbered line, starting with the number ``1'' under the first column:
es: Lo siguiente, se crea la funci@'on para imprimir la l@'{@dotless{i}}nea numerada, empezando con el n@'umero ``1'' para la primera columna:

source: (defun print-X-axis-numbered-line (number-of-X-tics X-axis-leading-spaces) "Print line of X-axis numbers" (let ((number X-axis-label-spacing)) (insert X-axis-leading-spaces) (insert "1")
es: (defun print-X-axis-numbered-line (number-of-X-tics X-axis-leading-spaces) "Imprime la l@'{@dotless{i}}neas de n@'umeros del eje X" (let ((number X-axis-label-spacing)) (insert X-axis-leading-spaces) (insert "1")

source: (insert (concat (make-string ;; @r{Insert white space up to next number.} (- (* symbol-width X-axis-label-spacing) 2) ? ) (number-to-string number)))
es: (insert (concat (make-string ;; @r{Inserta espacios en blanco al siguiente n@'umero.} (- (* symbol-width X-axis-label-spacing) 2) ? ) (number-to-string number)))

source: ;; @r{Insert remaining numbers.} (setq number (+ number X-axis-label-spacing)) (while (> number-of-X-tics 1) (insert (X-axis-element number)) (setq number (+ number X-axis-label-spacing)) (setq number-of-X-tics (1- number-of-X-tics)))))
es: ;; @r{Insertar n@'umeros.} (setq number (+ number X-axis-label-spacing)) (while (> number-of-X-tics 1) (insert (X-axis-element number)) (setq number (+ number X-axis-label-spacing)) (setq number-of-X-tics (1- number-of-X-tics)))))

source: Finally, we need to write the @code{print-X-axis} that uses @code{print-X-axis-tic-line} and @code{print-X-axis-numbered-line}.
es: Finalmente, se necesita escribir lo que @code{print-X-axis} que usa @code{print-X-axis-tic-line} y @code{print-X-axis-numbered-line}.

source: The function must determine the local values of the variables used by both @code{print-X-axis-tic-line} and @code{print-X-axis-numbered-line}, and then it must call them. Also, it must print the carriage return that separates the two lines.
es: La funci@'on debe determinar los valores locales de las variables usadas por @code{print-X-axis-tic-line} y @code{print-X-axis-numbered-line}, y entonces eso debe llamarlas. Tambi@'en, debe imprimir el retorno de carro que separe las dos l@'{@dotless{i}}neas.

source: The function consists of a varlist that specifies five local variables, and calls to each of the two line printing functions:
es: La funci@'on consiste de una varlist que especifica cinco variables locales, y llama cada una de las dos l@'{@dotless{i}}neas imprimiendo funciones:

source: (defun print-X-axis (numbers-list) "Print X axis labels to length of NUMBERS-LIST." (let* ((leading-spaces (make-string full-Y-label-width ? ))
es: (defun print-X-axis (numbers-list) "Imprime el eje X etique al tama@~no de NUMBERS-LIST." (let* ((leading-spaces (make-string full-Y-label-width ? ))

source: ;; symbol-width @r{is provided by} graph-body-print (tic-width (* symbol-width X-axis-label-spacing)) (X-length (length numbers-list))
es: ;; symbol-width @r{se provee por} graph-body-print (tic-width (* symbol-width X-axis-label-spacing)) (X-length (length numbers-list))

source: ;; @r{Make a string of blanks.} (- (* symbol-width X-axis-label-spacing) (length X-axis-tic-symbol)) ? )
es: ;; @r{Crea una cadena de espacios en blanco.} (- (* symbol-width X-axis-label-spacing) (length X-axis-tic-symbol)) ? )

source: ;; @r{Concatenate blanks with tic symbol.} X-axis-tic-symbol))
es: ;; @r{Concatena espacio en blanco con s@'{@dotless{i}}mbolos tic.} X-axis-tic-symbol))

source: You can test @code{print-X-axis}:
es: Se puede testear @code{print-X-axis}:

source: Install @code{X-axis-tic-symbol}, @code{X-axis-label-spacing}, @code{print-X-axis-tic-line}, as well as @code{X-axis-element}, @code{print-X-axis-numbered-line}, and @code{print-X-axis}.
es: Instale @code{X-axis-tic-symbol}, @code{X-axis-label-spacing}, @code{print-X-axis-tic-line}, tanto como @code{X-axis-element}, @code{print-X-axis-numbered-line}, y @code{print-X-axis}.

source: Yank the test expression into the minibuffer with @kbd{C-y} (@code{yank)}.
es: Pegue la expresi@'on de test dentro del minibuffer con @kbd{C-y} (@code{yank}).

source: Emacs will print the horizontal axis like this:
es: Emacs imprimir@'a el eje horizontal as@'{@dotless{i}}

source: Printing the whole graph
es: Imprimiendo el grafo entero

source: Whole graph printing
es: Imprimiendo el grafo entero

source: Graph, printing all
es: Grafo, imprimiendo todo

source: Now we are nearly ready to print the whole graph.
es: Ahora estamos listos para imprimir el grafo completo.

source: The function to print the graph with the proper labels follows the outline we created earlier (@pxref{Full Graph, , A Graph with Labeled Axes}), but with additions.
es: La funci@'on para imprimir el grafo con las etiquetas apropiadas sigue el esquema que creamos antes (@pxref{Grafo completo, , Un Grafo con Ejes Etiquetados}), pero con adiciones.

source: Here is the outline:
es: Aqu@'{@dotless{i}} est@'a el esquema:

source: Changes for the Final Version
es: Cambios para la versi@'on final

source: The final version is different from what we planned in two ways: first, it contains additional values calculated once in the varlist; second, it carries an option to specify the labels' increment per row. This latter feature turns out to be essential; otherwise, a graph may have more rows than fit on a display or on a sheet of paper.
es: La versi@'on final es diferente desde que se planea en dos caminos: primero, contiene los valores adicionales calculadas una vez que en la varlist; segundo, eso trae una opci@'on para espec@'{@dotless{i}}ficar las etiquetas se incrementa la fila. Esta @'ultima funcionalidad cambia a ser esencial; de otro modo, un grafo puede tener m@'as filas que ajustarse en una muestra o en una hoja de papel.

source: This new feature requires a change to the @code{Y-axis-column} function, to add @code{vertical-step} to it. The function looks like this:
es: Esta nueva funcionalidad requiere un cambio a la funci@'on @code{Y-axis-column}, para a@~nadir @code{vertical-step} para eso. Esta funci@'on es parece a esto:

source: Y-axis-column @r{Final version.}
es: Y-axis-column @r{Versi@'on Final.}

source: ;;; @r{Final version.} (defun Y-axis-column (height width-of-label &optional vertical-step) "Construct list of labels for Y axis. HEIGHT is maximum height of graph. WIDTH-OF-LABEL is maximum width of label. VERTICAL-STEP, an option, is a positive integer that specifies how much a Y axis label increments for each line. For example, a step of 5 means that each line is five units of the graph."
es: ;;; @r{Versi@'on Final.} (defun Y-axis-column (height width-of-label &optional vertical-step) "Construye una lista de etiquetas para el eje Y. HEIGHT es la m@'axima altura del grafo. WIDTH-OF-LABEL es el m@'aximo ancho de la etiqueta. VERTICAL-STEP, una opci@'on, es un entero positivo que especifica cuanto una etiqueta de eje Y incrementa cada l@'{@dotless{i}}nea. Por ejemplo, un paso de 5 significa que cada l@'{@dotless{i}}nea es cinco unidades del grafo."

source: ;; @r{Insert label.} (setq Y-axis (cons (Y-axis-element (* height number-per-line) width-of-label) Y-axis))
es: ;; @r{Inserta etiqueta.} (setq Y-axis (cons (Y-axis-element (* height number-per-line) width-of-label) Y-axis))

source: ;; @r{Else, insert blanks.} (setq Y-axis (cons (make-string width-of-label ? ) Y-axis))) (setq height (1- height)))
es: ;; @r{Else, inserta espacios en blanco.} (setq Y-axis (cons (make-string width-of-label ? ) Y-axis))) (setq height (1- height)))

source: ;; @r{Insert base line.} (setq Y-axis (cons (Y-axis-element (or vertical-step 1) width-of-label) Y-axis)) (nreverse Y-axis)))
es: ;; @r{Inserta l@'{@dotless{i}}nea base.} (setq Y-axis (cons (Y-axis-element (or vertical-step 1) width-of-label) Y-axis)) (nreverse Y-axis)))

source: The values for the maximum height of graph and the width of a symbol are computed by @code{print-graph} in its @code{let} expression; so @code{graph-body-print} must be changed to accept them.
es: Los valores para la m@'axima altura del grafo y el ancho de un s@'{@dotless{i}}mbolo se computan por @code{print-graph} es su expresi@'on @code{let}; as@'{@dotless{i}} @code{graph-body-print} debe ser cambiado para aceptarlos.

source: graph-body-print @r{Final version.}
es: graph-body-print @r{Versi@'on Final.}

source: ;;; @r{Final version.} (defun graph-body-print (numbers-list height symbol-width) "Print a bar graph of the NUMBERS-LIST. The numbers-list consists of the Y-axis values. HEIGHT is maximum height of graph. SYMBOL-WIDTH is number of each column."
es: ;;; @r{Versi@'on Final.} (defun graph-body-print (numbers-list height symbol-width) "Imprime una gr@'afica de barras del NUMBERS-LIST. El numbers-list consiste en los valores del eje Y. HEIGHT es la m@'axisma altura del grafo. SYMBOL-WIDTH es el n@'umero de cada columna."

source: ;; @r{Draw graph column by column.} (sit-for 0) (setq numbers-list (cdr numbers-list))) ;; @r{Place point for X axis labels.} (forward-line height) (insert "\n")))
es: ;; @r{Dibuja el grafo columna por columna.} (sit-for 0) (setq numbers-list (cdr numbers-list))) ;; @r{Posiciona el punto para las etiquetas del eje X.} (forward-line height) (insert "\n")))

source: Finally, the code for the @code{print-graph} function:
es: Finalmente, el c@'odigo para la funci@'on @code{print-graph}:

source: print-graph @r{Final version.}
es: print-graph @r{Versi@'on Final.}

source: ;;; @r{Final version.} (defun print-graph (numbers-list &optional vertical-step) "Print labeled bar graph of the NUMBERS-LIST. The numbers-list consists of the Y-axis values.
es: ;;; @r{Versi@'on Final.} (defun print-graph (numbers-list &optional vertical-step) "El gr@'afico de barras etiquetadas del NUMBERS-LIST. El numbers-list consiste en los valores de eje Y.

source: Optionally, VERTICAL-STEP, a positive integer, specifies how much a Y axis label increments for each line. For example, a step of 5 means that each row is five units."
es: Opcionalmente, VERTICAL-STEP, un entero positivo, especifica cuanto el eje Y incrementa cada l@'{@dotless{i}}nea. Por ejemplo, un paso de 5 significa que cada fila es de cinco unidades.

source: (let* ((symbol-width (length graph-blank)) ;; @code{height} @r{is both the largest number} ;; @r{and the number with the most digits.} (height (apply 'max numbers-list))
es: (let* ((symbol-width (length graph-blank)) ;; @code{height} @r{en ambos es el n@'umero m@'as largo} ;; @r{y el n@'umero con la mayor@'{@dotless{i}}a de los digitos.} (height (apply 'max numbers-list))

source: Testing @code{print-graph}
es: Testeando @code{print-graph}

source: We can test the @code{print-graph} function with a short list of numbers:
es: Se puede chequear la funci@'on @code{print-graph} con una lista ordenada de n@'umeros:

source: Install the final versions of @code{Y-axis-column}, @code{graph-body-print}, and @code{print-graph} (in addition to the rest of the code.)
es: Instala las versiones finales de @code{Y-axis-column}, @code{graph-body-print}, y @code{print-graph} (adem@'as del resto del c@'odigo.)

source: Emacs will print a graph that looks like this:
es: Emacs imprimir@'a un grafo que se parece a:

source: On the other hand, if you pass @code{print-graph} a @code{vertical-step} value of 2, by evaluating this expression:
es: Por otro lado, si se pasa a @code{print-graph} un @code{vertical-step} valor de 2, evaluando esta expresi@'on:

source: The graph looks like this:
es: El grafo se parece a esto:

source: (A question: is the `2' on the bottom of the vertical axis a bug or a feature? If you think it is a bug, and should be a `1' instead, (or even a `0'), you can modify the sources.)
es: (Una pregunta: ¿es el `2' debajo del eje vertical un error o una funcionalidad? Si se piensa que es un error, y ser@'{@dotless{i}}a un `1', (o incluso un `0'), se pueden modificar las fuentes.)

source: Graphing Numbers of Words and Symbols
es: Creando gr@'aficas de n@'umeros de palabras y s@'{@dotless{i}}mbolos

source: Now for the graph for which all this code was written: a graph that shows how many function definitions contain fewer than 10 words and symbols, how many contain between 10 and 19 words and symbols, how many contain between 20 and 29 words and symbols, and so on.
es: Ahora para el gr@'afico para el que todo este c@'odigo fu@'e escrito: un gr@'afico que muestra cuantas definiciones de funci@'on contienen unas pocas 10 palabras y s@'{@dotless{i}}mbolos, cuantas contienen entre 10 y 19 palabras y s@'{@dotless{i}}mbolos, cuantos contienen entre 20 y 29 palabras y s@'{@dotless{i}}mbolos, y as@'{@dotless{i}}.

source: This is a multi-step process. First make sure you have loaded all the requisite code.
es: Esto es un proceso de m@'ultiples pasos. Primero aseg@'urate que has cargado todo el requisito del c@'odigo.

source: It is a good idea to reset the value of @code{top-of-ranges} in case you have set it to some different value. You can evaluate the following:
es: Eso es una buena idea para eliminar el valor de @code{top-of-ranges} en caso de que has asignado a alg@'un valor diferente. Se puede evaluar lo siguiente:

source: Next create a list of the number of words and symbols in each range.
es: Lo siguiente crea una lista del n@'umero de palabras y s@'{@dotless{i}}mbolos en cada rango.

source: Evaluate the following:
es: Eval@'ua lo siguiente:

source: On my old machine, this took about an hour. It looked though 303 Lisp files in my copy of Emacs version 19.23. After all that computing, the @code{list-for-graph} had this value:
es: En mi vieja m@'aquina, esto lleva como una hora. Se parece a 303 ficheros Lisp en mi copia de Emacs version 19.23. Despu@'es de toda esta computaci@'on, el @code{list-for-graph} ten@'{@dotless{i}}a este valor:

source: This means that my copy of Emacs had 537 function definitions with fewer than 10 words or symbols in them, 1,027 function definitions with 10 to 19 words or symbols in them, 955 function definitions with 20 to 29 words or symbols in them, and so on.
es: Esto significa que mi copia de Emacs tiene 537 definiciones de funciones con poco menos de 10 palabras o s@'{@dotless{i}}mbolos en s@'{@dotless{i}}, 1027 definiciones de funci@'on con 10 a 19 palabras o s@'{@dotless{i}}mbolos dentro, 955 definiciones de funci@'on con 20 a 29 palabras o s@'{@dotless{i}}mbolos dentro, y as@'{@dotless{i}}.

source: Clearly, just by looking at this list we can see that most function definitions contain ten to thirty words and symbols.
es: Claramente, solo buscando esta lista se puede ver que la mayor@'{@dotless{i}}a de definiciones de funci@'on contienen de diez a treinta palabras y s@'{@dotless{i}}mbolos.

source: Now for printing. We do @emph{not} want to print a graph that is 1,030 lines high @dots{} Instead, we should print a graph that is fewer than twenty-five lines high. A graph that height can be displayed on almost any monitor, and easily printed on a sheet of paper.
es: Ahora para imprimir. Nosotros @emph{no} queremos imprimir un grafo que es de 1030 l@'{@dotless{i}}neas de alto @dots{}. En vez de eso, imprimir@'{@dotless{i}}a un grafo que es mejor que venticinco l@'{@dotless{i}}neas de alto. Un grafo cuya altura puede ser mostrada en casi cualquier monitor, y f@'acilmente impreso en una hoja de papel.

source: This means that each value in @code{list-for-graph} must be reduced to one-fiftieth its present value.
es: Esto significa que cada valor en @code{list-for-graph} debe ser reducido a un quinceavo de su valor presente.

source: Here is a short function to do just that, using two functions we have not yet seen, @code{mapcar} and @code{lambda}.
es: Aqu@'{@dotless{i}} hay una corta funci@'on para hacer esto, usando dos funciones que no se han visto todav@'{@dotless{i}}a, @code{mapcar} y @code{lambda}.

source: (defun one-fiftieth (full-range) "Return list, each number one-fiftieth of previous." (mapcar (lambda (arg) (/ arg 50)) full-range))
es: (defun one-fiftieth (full-range) "Devuelve la lista, con el cincuenteavo de cada elemento." (mapcar '(lambda (arg) (/ arg 50)) full-range))

source: A @code{lambda} Expression: Useful Anonymity
es: Una expresi@'on @code{lambda}: Anonimicidad @'util

source: Anonymous function
es: Funci@'on An@'onima

source: @code{lambda} is the symbol for an anonymous function, a function without a name. Every time you use an anonymous function, you need to include its whole body.
es: @code{lambda} es el s@'{@dotless{i}}mbolo para una funci@'on an@'onima, una funci@'on sin un nombre. Cada vez que se use una funci@'on an@'onima, se necesita incluir su cuerpo completo.

source: is a function definition that says `return the value resulting from dividing whatever is passed to me as @code{arg} by 50'.
es: es una definici@'on de funci@'on que dice `devuelve el valor resultante de dividir cualquier cosa que es pasada como @code{arg} por 50'.

source: Earlier, for example, we had a function @code{multiply-by-seven}; it multiplied its argument by 7. This function is similar, except it divides its argument by 50; and, it has no name. The anonymous equivalent of @code{multiply-by-seven} is:
es: Pronto, por ejemplo, se ten@'{@dotless{i}}a una funci@'on @code{multiply-by-seven}; se multiplica su argumento por 7. Esta funci@'on es similar, excepto que divide su argumento por 50; y, no tiene nombre. El equivalente an@'onimo de @code{multiply-by-seven} es:

source: (@xref{defun, , The @code{defun} Special Form}.)
es: (@xref{defun, , La forma especial @code{defun}}.)

source: If we want to multiply 3 by 7, we can write:
es: Si queremos multiplicar 3 por 7, podemos escribir:

source: (multiply-by-seven 3) \_______________/ ^ | | function argument
es: (multiply-by-seven 3) \_______________/ ^ | | funci@'on argumento

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/lambda-1.eps}} % \catcode`\@=0 %
es: %%%% el viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/lambda-1.eps}} % \catcode`\@=0 %

source: This expression returns 21.
es: Esta expresi@'on devuelve 21.

source: Similarly, we can write:
es: De manera similar, se puede escribir:

source: ((lambda (number) (* 7 number)) 3) \____________________________/ ^ | | anonymous function argument
es: ((lambda (number) (* 7 number)) 3) \____________________________/ ^ | | funci@'on an@'onima argumento

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/lambda-2.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/lambda-2.eps}} % \catcode`\@=0 %

source: If we want to divide 100 by 50, we can write:
es: Si queremos dividir 100 por 50, se puede escribir:

source: ((lambda (arg) (/ arg 50)) 100) \______________________/ \_/ | | anonymous function argument
es: ((lambda (arg) (/ arg 50)) 100) \______________________/ \_/ | | funci@'on an@'onima argumento

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/lambda-3.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/lambda-3.eps}} % \catcode`\@=0 %

source: This expression returns 2. The 100 is passed to the function, which divides that number by 50.
es: Esta expresi@'on devuelve 2. El 100 es pasado para la funci@'on, que divide este n@'umero por 50.

source: @xref{Lambda Expressions, , Lambda Expressions, elisp, The GNU Emacs Lisp Reference Manual}, for more about @code{lambda}. Lisp and lambda expressions derive from the Lambda Calculus.
es: @xref{Expresiones Lambda, , Expresiones Lambda, elisp, El Manual de Referencia GNU Emacs Lisp}, para m@'as acerca de @code{lambda}. Lisp y expresiones Lambda se derivan del C@'alculo Lambda.

source: The @code{mapcar} Function
es: La funci@'on @code{mapcar}

source: @code{mapcar} is a function that calls its first argument with each element of its second argument, in turn. The second argument must be a sequence.
es: @code{mapcar} es una funci@'on que llama a su primer argumento con cada elemento de su segundo argumento. El segundo argumento debe ser una secuencia.

source: The @samp{map} part of the name comes from the mathematical phrase, `mapping over a domain', meaning to apply a function to each of the elements in a domain. The mathematical phrase is based on the metaphor of a surveyor walking, one step at a time, over an area he is mapping. And @samp{car}, of course, comes from the Lisp notion of the first of a list.
es: La parte @samp{map} del nombre viene de la frase matem@'atica, `mapeando a trav@'es de un dominio', significa hace apply a una funci@'on a cada uno de los elementos en un dominio. La frase matem@'atica est@'a basada en la met@'afora de un superviviente paseando, un paso en un momento, a trav@'es de un @'area @'el est@'a mapeando. Y @samp{car}, de acuerdo, viene desde la noci@'on Lisp del primero de una lista.
