Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: In this variable definition, the variable is given an initial value of @code{nil}, which makes sense, since if you have saved nothing, you want nothing back if you give a @code{yank} command. The documentation string is written just like the documentation string of a @code{defun}. As with the documentation string of the @code{defun}, the first line of the documentation should be a complete sentence, since some commands, like @code{apropos}, print only the first line of documentation. Succeeding lines should not be indented; otherwise they look odd when you use @kbd{C-h v} (@code{describe-variable}).
es: En esta definici@'on de variable, la variable es dada un valor inicial de @code{nil}, que tiene sentido, desde que si no se ha guardado nada, no se quiere nada si se da un comando @code{yank}. La cadena de documentaci@'on es escrito solo como la cadena de documentaci@'on de un @code{defun}. Como con la cadena de documentaci@'on ser@'{@dotless{i}}a una frase completa, desde que algunos comandos, como @code{apropos}, imprime solo la primera l@'{@dotless{i}}nea de documentaci@'on. Las l@'{@dotless{i}}neas de exito no ser@'{@dotless{i}}an indentadas; de otro modo se mira cuando se usa @kbd{C-h v} (@code{describe-variable}).

source: @code{defvar} and an asterisk
es: @code{defvar} y un asterisco

source: defvar @r{for a user customizable variable}
es: defvar @r{para una variable personalizable}

source: defvar @r{with an asterisk}
es: defvar @r{con un asterisco}

source: In the past, Emacs used the @code{defvar} special form both for internal variables that you would not expect a user to change and for variables that you do expect a user to change. Although you can still use @code{defvar} for user customizable variables, please use @code{defcustom} instead, since that special form provides a path into the Customization commands. (@xref{defcustom, , Specifying Variables using @code{defcustom}}.)
es: En el pasado, Emacs usaba la forma especial @code{defvar} tanto para variables interna que no esperar@'{@dotless{i}}a que un usuario cambie y para variables que espera un usuario cambie. Aunque se puede todav@'{@dotless{i}}a usar @code{defvar} para variables personalizadas, por favor, usa @code{defcustom} en vez, desde que la forma especial provee una ruta dentro de los comando de Personalizaci@'on. (@xref{defcustom, , Especificando Variables usando @code{defcustom}}.)

source: When you specified a variable using the @code{defvar} special form, you could distinguish a variable that a user might want to change from others by typing an asterisk, @samp{*}, in the first column of its documentation string. For example:
es: Cuando se especifica una variable usando la forma especial @code{defvar}, se podr@'{@dotless{i}}a distinguir una variable que un usuario podr@'{@dotless{i}}a querer cambiar desde otros escribiendo, @samp{*}, en la primera columna de su cadena de documentaci@'on. Por ejemplo:

source: (defvar shell-command-default-error-buffer nil "*Buffer name for `shell-command' @dots{} error output. @dots{} ")
es: (defvar shell-command-default-error-buffer nil "*Nombre de buffer para `shell-command' @dots{} salir del error. @dots{} ")

source: You could (and still can) use the @code{set-variable} command to change the value of @code{shell-command-default-error-buffer} temporarily. However, options set using @code{set-variable} are set only for the duration of your editing session. The new values are not saved between sessions. Each time Emacs starts, it reads the original value, unless you change the value within your @file{.emacs} file, either by setting it manually or by using @code{customize}. @xref{Emacs Initialization, , Your @file{.emacs} File}.
es: Tu podr@'{@dotless{i}}as (y todav@'{@dotless{i}}a puedes) usar el comando @code{set-variable} para cambiar el valor de @code{shell-command-default-error-buffer} temporalmente. Sin embargo, las opciones configuradas usando @code{set-variable} no est@'an asignadas solo por la duraci@'on de tu sesi@'on de edici@'on. Los nuevos valores no est@'an guardados entre sesiones. Cada vez que Emacs empieza, lee el valor original, a menos que tu cambia el valor con tu fichero @file{.emacs}, si configur@'andolo manualmente o usando @code{customize}. @xref{Inicializaci@'on de Emacs, , Tu Fichero @file{.emacs}}.

source: For me, the major use of the @code{set-variable} command is to suggest variables that I might want to set in my @file{.emacs} file. There are now more than 700 such variables, far too many to remember readily. Fortunately, you can press @key{TAB} after calling the @code{M-x set-variable} command to see the list of variables. (@xref{Examining, , Examining and Setting Variables, emacs, The GNU Emacs Manual}.)
es: Para m@'{@dotless{i}}, el mayor uso del comando @code{set-variable} es sugerir variables que se podr@'{@dotless{i}}an querer asignar en mi fichero @file{.emacs}. Ahora hay m@'as de 700 variables, demasiadas para recordarlas f@'acilmente. Afortunadamente, se puede presionar @key{TAB} despu@'es de llamar al comando @code{M-x set-variable} para ver la lista de variables. (@xref{Examinando, , Examinando y Configurando Variables, emacs, El Manual de GNU Emacs}.)

source: cons & search-fwd Review
es: Revisi@'on de cons y search-fwd

source: Here is a brief summary of some recently introduced functions.
es: Aqu@'{@dotless{i}} hay un breve resumen de algunas funciones introducidas recientemente.

source: @code{car} returns the first element of a list; @code{cdr} returns the second and subsequent elements of a list.
es: @code{car} devuelve el primer elemento de una lista; @code{cdr} devuelve el segundo y subsiguientes elementos de una lista.

source: @code{cons} constructs a list by prepending its first argument to its second argument.
es: @code{cons} construye una lista enlazando su primer argumento a su segundo argumento.

source: @code{funcall} evaluates its first argument as a function. It passes its remaining arguments to its first argument.
es: @code{funcall} eval@'ua su primer argumento como una funci@'on. As@'{@dotless{i}} pasa los argumentos que permanecen a su primer argumento.

source: Return the result of taking @sc{cdr} `n' times on a list.
es: Devuelve el resultado de tomar @sc{cdr} `n' veces en una lista.

source: The `rest of the rest', as it were.
es: El `resto del resto', como estaba

source: @code{setcar} changes the first element of a list; @code{setcdr} changes the second and subsequent elements of a list.
es: @code{setcar} cambia el primer elemento de una lista; @code{setcdr} cambia el segundo y subsiguiente elementos de una lista.

source: Evaluate each argument in sequence and then return the value of the last.
es: Eval@'ua cada argumento en secuencia y entonces devuelve el valor del @'ultimo.

source: Record whatever narrowing is in effect in the current buffer, if any, and restore that narrowing after evaluating the arguments.
es: Graba siempre que encoger est@'e en efecto en el b@'uffer, si cualquiera, restaura este encogimiento despu@'es de evaluar los argumentos.

source: Search for a string, and if the string is found, move point. With a regular expression, use the similar @code{re-search-forward}. (@xref{Regexp Search, , Regular Expression Searches}, for an explanation of regular expression patterns and searches.)
es: Buscar una cadena, y si la cadena es encontrada, mueve el punto. Con una expresi@'on regular, usa algo similar a @code{re-search-forward}. (@xref{Buscar regexp, B@'usquedas de Expresiones Regulares}, para una explicaci@'on de expresiones regulares patrones y b@'usquedas.)

source: @code{search-forward} and @code{re-search-forward} take four arguments:
es: @code{search-forward} y @code{re-search-forward} tiene cuatro argumentos:

source: The string or regular expression to search for.
es: La cadena o la expresi@'on regular para buscar.

source: Optionally, the limit of the search.
es: Opcionalmente, el l@'{@dotless{i}}mite de la b@'usqueda.

source: Optionally, what to do if the search fails, return @code{nil} or an error message.
es: Opcionalmente, que haces si la b@'usqueda falla, devuelve @code{nil} o un mensaje de error.

source: Optionally, how many times to repeat the search; if negative, the search goes backwards.
es: Opcionalmente, cu@'antas veces se puede repetir la b@'usqueda; si es negativa, la b@'usqueda va hacia atr@'as.

source: @code{kill-region} cuts the text between point and mark from the buffer and stores that text in the kill ring, so you can get it back by yanking.
es: @code{kill-region} corta el texto entre punto y marca desde el b@'uffer y almacena ese texto en el anillo de la muerte @emph{kill ring}, as@'{@dotless{i}} se puede obtener peg@'andolo.

source: @code{copy-region-as-kill} copies the text between point and mark into the kill ring, from which you can get it by yanking. The function does not cut or remove the text from the buffer.
es: @code{copy-region-as-kill} copia el texto entre punto y marca dentro del anillo de la muerte @emph{kill ring}, que se puede obtener peg@'andolo. La funci@'on no corta o borra el texto desde el b@'uffer.

source: @code{delete-and-extract-region} removes the text between point and mark from the buffer and throws it away. You cannot get it back. (This is not an interactive command.)
es: @code{delete-and-extract-region} elimina el texto entre el punto y marca desde el b@'uffer y a trav@'es. No se puede volver. Esto no es un comando interactivo.)

source: Searching Exercises
es: Buscando ejercicios

source: Write an interactive function that searches for a string. If the search finds the string, leave point after it and display a message that says ``Found!''. (Do not use @code{search-forward} for the name of this function; if you do, you will overwrite the existing version of @code{search-forward} that comes with Emacs. Use a name such as @code{test-search} instead.)
es: Escribe una funci@'on interactiva que busca una cadena. Si la b@'usqueda encuentra la cadena, deja el punto despu@'es y muestra un mensaje que dice ``@exclamdown{}Encontrado!''. (No use @code{search-forward} como nombre de esta funci@'on; si se hace, se sobreescribir@'a la versi@'on existente @code{search-forward} que viene con Emacs. Use un nombre tal como @code{test-search} en vez de eso.

source: Write a function that prints the third element of the kill ring in the echo area, if any; if the kill ring does not contain a third element, print an appropriate message.
es: Escribe una funci@'on que imprime el tercer elemento del kill ring @emph{anillo de la muerte} en el @'area echo, si cualquiera; si el kill ring @emph{anillo de la muerte} no contiene un tercer elemento, imprime un mensaje apropiado.

source: Lists in a computer
es: Listas en un ordenador

source: In Lisp, atoms are recorded in a straightforward fashion; if the implementation is not straightforward in practice, it is, nonetheless, straightforward in theory. The atom @samp{rose}, for example, is recorded as the four contiguous letters @samp{r}, @samp{o}, @samp{s}, @samp{e}. A list, on the other hand, is kept differently. The mechanism is equally simple, but it takes a moment to get used to the idea. A list is kept using a series of pairs of pointers. In the series, the first pointer in each pair points to an atom or to another list, and the second pointer in each pair points to the next pair, or to the symbol @code{nil}, which marks the end of the list.
es: En Lisp, los @'atomos se graban de manera simple, si la implementaci@'on no es sencilla en la pr@'actica, no es, nada sencilla en la teor@'{@dotless{i}}a. El @'atomo @samp{rosa}, por ejemplo, se graba como las cuatro letras contiguas @samp{r}, @samp{o}, @samp{s}, @samp{a}. Una lista, por otro lado, se guarda de manera diferente. El mecanismo es igualmente simple, pero toma un momento para tener usada la idea. Una lista se guarda usando una serie de pares de punteros. En las series, el primer puntero en cada par de puntos a un @'atomo o a otra lista, y el segundo puntero en cada par al siguiente par, o al s@'{@dotless{i}}mbolo @code{nil}, que marca el fin de la lista.

source: A pointer itself is quite simply the electronic address of what is pointed to. Hence, a list is kept as a series of electronic addresses.
es: Un puntero por s@'{@dotless{i}} mismo es poco simple a la direcci@'on electr@'onica de la que est@'a apuntada. Aqu@'{@dotless{i}}, una lista se guarda como una serie de direcciones electr@'onicas.

source: Lists diagrammed
es: Listas diagramadas

source: For example, the list @code{(rose violet buttercup)} has three elements, @samp{rose}, @samp{violet}, and @samp{buttercup}. In the computer, the electronic address of @samp{rose} is recorded in a segment of computer memory along with the address that gives the electronic address of where the atom @samp{violet} is located; and that address (the one that tells where @samp{violet} is located) is kept along with an address that tells where the address for the atom @samp{buttercup} is located.
es: Por ejemplo, la lista @code{(rosa violeta bot@'ondeoro)} tiene tres elementos, @samp{rosa}, @samp{violeta}, y @samp{bot@'ondeoro}. En el ordenador, la direcci@'on electr@'onica de @samp{rosa} se graba en un segmento de memoria del ordenador a trav@'es de la direcci@'on que da la direcci@'on electr@'onica de donde el @'atomo @samp{violeta} est@'a localizado; y esta direcci@'on (la que cuenta donde @samp{violeta} est@'a se localiza) se guarda con una direcci@'on que cuenta donde la direcci@'on para el @'atomo @samp{bot@'ondeoro} se localiza.

source: This sounds more complicated than it is and is easier seen in a diagram:
es: Esto parece m@'as complicado de lo que es y es m@'as f@'acil visto en un diagrama:

source: ___ ___ ___ ___ ___ ___ |___|___|--> |___|___|--> |___|___|--> nil | | | | | | --> rose --> violet --> buttercup
es: ___ ___ ___ ___ ___ ___ |___|___|--> |___|___|--> |___|___|--> nil | | | | | | ---> rosa ---> violeta ---> bot@'ondeoro

source: In the diagram, each box represents a word of computer memory that holds a Lisp object, usually in the form of a memory address. The boxes, i.e., the addresses, are in pairs. Each arrow points to what the address is the address of, either an atom or another pair of addresses. The first box is the electronic address of @samp{rose} and the arrow points to @samp{rose}; the second box is the address of the next pair of boxes, the first part of which is the address of @samp{violet} and the second part of which is the address of the next pair. The very last box points to the symbol @code{nil}, which marks the end of the list.
es: En el diagrama, cada caja representa una palabra de memoria del ordenador que maneja un objeto Lisp, normalmente en la forma de una direcci@'on de memoria. Las cajas, por ej. las direcciones, est@'an en pares. Cada flecha apunta a lo que la direcci@'on es la direcci@'on de, si un @'atomo u otro par de direcciones. La primera caja es la direcci@'on electr@'onica de @samp{rosa} y la flecha apunta a @samp{rosa}; la segunda caja es la direcci@'on del siguiente par de cajas, la primera parte de la que es la direcci@'on de @samp{violeta} y la segunda parte es la direcci@'on del siguiente par. La @'ultima caja apunta al s@'{@dotless{i}}mbolo @code{nil}, que marca el fin de la lista.

source: When a variable is set to a list with a function such as @code{setq}, it stores the address of the first box in the variable. Thus, evaluation of the expression
es: Cuando una variable es configurado a una lista con una funci@'on tal como @code{setq}, almacena la direcci@'on de la primera caja en la variable. De este modo, la evaluaci@'on de la expresi@'on es:

source: (setq bouquet '(rose violet buttercup))
es: (setq ramo '(rosa violeta bot@'ondeoro))

source: creates a situation like this:
es: crea una situaci@'on como esta:

source: bouquet | | ___ ___ ___ ___ ___ ___ --> |___|___|--> |___|___|--> |___|___|--> nil | | | | | | --> rose --> violet --> buttercup
es: ramo | | ___ ___ ___ ___ ___ ___ --> |___|___|--> |___|___|--> |___|___|--> nil | | | | | | --> rosa --> violeta --> bot@'ondeoro

source: In this example, the symbol @code{bouquet} holds the address of the first pair of boxes.
es: En este ejemplo, el s@'{@dotless{i}}mbolo @code{ramo} maneja la direcci@'on del primer par de cajas.

source: This same list can be illustrated in a different sort of box notation like this:
es: Esta misma lista puede ser ilustrada en un modo diferente de anotaci@'on de cajas como esta:

source: bouquet | | -------------- --------------- ---------------- | | car | cdr | | car | cdr | | car | cdr | -->| rose | o------->| violet | o------->| butter- | nil | | | | | | | | cup | | -------------- --------------- ----------------
es: ramo | | -------------- ---------------- -------------------- | | car | cdr | | car | cdr | | car | cdr | -->| rosa | o------->| violeta | o------->| bot@'ondeoro | nil | | | | | | | | | | -------------- ---------------- --------------------

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-2a.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-2a.eps}} % \catcode`\@=0 %

source: (Symbols consist of more than pairs of addresses, but the structure of a symbol is made up of addresses. Indeed, the symbol @code{bouquet} consists of a group of address-boxes, one of which is the address of the printed word @samp{bouquet}, a second of which is the address of a function definition attached to the symbol, if any, a third of which is the address of the first pair of address-boxes for the list @code{(rose violet buttercup)}, and so on. Here we are showing that the symbol's third address-box points to the first pair of address-boxes for the list.)
es: (Los s@'{@dotless{i}}mbolos consisten de m@'as pares de direcciones, pero la estructura de un s@'{@dotless{i}}mbolo es hecha de direcciones. De manera profunda, el s@'{@dotless{i}}mbolo @code{ramo} consiste de un grupo de cajas-de-direcciones, una que es la direcci@'on de la palabra impresa @samp{ramo}, una segunda de la que es la direcci@'on de una definici@'on de funci@'on adjunta al s@'{@dotless{i}}mbolo, si cualquiera, un tercero del que es la direcci@'on del primer par de cajas-de-direccion para la lista @code{(rosa violeta bot@'ondeoro)}, y as@'{@dotless{i}}. Aqu@'{@dotless{i}} se est@'a mostrando que la tercera caja de direcci@'on del s@'{@dotless{i}}mbolo apunta al primer par de cajas-de-direccion para la lista.)

source: If a symbol is set to the @sc{cdr} of a list, the list itself is not changed; the symbol simply has an address further down the list. (In the jargon, @sc{car} and @sc{cdr} are `non-destructive'.) Thus, evaluation of the following expression
es: Si un s@'{@dotless{i}}mbolo se asigna al @sc{cdr} de una lista, la lista en s@'{@dotless{i}} no cambia; el s@'{@dotless{i}}mbolo simplemente tiene una direcci@'on abajo de la lista. (En la jerga, @sc{car} y @sc{cdr} son `no destructivos'.) De este modo, se eval@'ua la siguiente expresi@'on

source: (setq flowers (cdr bouquet))
es: (setq flores (cdr ramo))

source: produces this:
es: produce esto:

source: bouquet flowers | | | ___ ___ | ___ ___ ___ ___ --> | | | --> | | | | | | |___|___|----> |___|___|--> |___|___|--> nil | | | | | | --> rose --> violet --> buttercup
es: ramo flores | | | ___ ___ | ___ ___ ___ ___ --> | | | --> | | | | | | |___|___|----> |___|___|--> |___|___|--> nil | | | | | | --> rosa --> violeta --> bot@'ondeoro

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-3.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-3.eps}} % \catcode`\@=0 %

source: The value of @code{flowers} is @code{(violet buttercup)}, which is to say, the symbol @code{flowers} holds the address of the pair of address-boxes, the first of which holds the address of @code{violet}, and the second of which holds the address of @code{buttercup}.
es: El valor de @code{flores} es @code{(violeta bot@'ondeoro)}, esto es decir que el s@'{@dotless{i}}mbolo @code{flores} maneja la direcci@'on del par address-boxes el primero que maneja la direcci@'on de @code{violeta}, y el segundo que maneja la direcci@'on de @code{bot@'ondeoro}.

source: A pair of address-boxes is called a @dfn{cons cell} or @dfn{dotted pair}. @xref{Cons Cell Type, , Cons Cell and List Types, elisp, The GNU Emacs Lisp Reference Manual}, and @ref{Dotted Pair Notation, , Dotted Pair Notation, elisp, The GNU Emacs Lisp Reference Manual}, for more information about cons cells and dotted pairs.
es: Un par de cajas-de-direcciones se llama una @dfn{cons cell} o @dfn{par de puntos}. @xref{Tipo de C@'elula Cons, , la C@'elula Cons y los Tipos Lista, elisp, El Manual de Referencia de Emacs Lisp}, y @ref{Notaci@'on de Pares de Puntos, , Notaci@'on de Pares de Puntos, elisp, El Manual de Referencia de GNU Emacs Lisp}, para m@'as informaci@'on acerca de c@'elulas cons y pares de puntos.

source: The function @code{cons} adds a new pair of addresses to the front of a series of addresses like that shown above. For example, evaluating the expression
es: La funci@'on @code{cons} a@~nade un nuevo par de direcciones al frente de una serie de direcciones como son mostradas debajo. Por ejemplo, evaluando la expresi@'on

source: (setq bouquet (cons 'lily bouquet))
es: (setq ramo (cons 'lila ramo))

source: produces:
es: produce:

source: bouquet flowers | | | ___ ___ ___ ___ | ___ ___ ___ ___ --> | | | | | | --> | | | | | | |___|___|----> |___|___|----> |___|___|---->|___|___|--> nil | | | | | | | | --> lily --> rose --> violet --> buttercup
es: ramo flores | | | ___ ___ ___ ___ | ___ ___ ___ ___ --> | | | | | | --> | | | | | | |___|___|----> |___|___|----> |___|___|---->|___|___|--> nil | | | | | | | | --> lila --> rosa --> violeta --> bot@'ondeoro

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-4.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-4.eps}} % \catcode`\@=0 %

source: However, this does not change the value of the symbol @code{flowers}, as you can see by evaluating the following,
es: Sin embargo, esto no cambia el valor del s@'{@dotless{i}}mbolo @code{flores}, as@'{@dotless{i}} puedes ver evaluando lo siguiente,

source: (eq (cdr (cdr bouquet)) flowers)
es: (eq (cdr (cdr ramo)) flores)

source: which returns @code{t} for true.
es: que devuelve @code{t} para verdad.

source: Until it is reset, @code{flowers} still has the value @code{(violet buttercup)}; that is, it has the address of the cons cell whose first address is of @code{violet}. Also, this does not alter any of the pre-existing cons cells; they are all still there.
es: Hasta que se resetea, @code{flores} todav@'{@dotless{i}}a tiene el valor de @code{(violeta bot@'ondeoro)}; que es, eso tiene la direcci@'on de la celula cons cuya primera direcci@'on es @code{violeta}. Tambi@'en, esto no altera cualquier c@'elula prexistente cons; ellas est@'a todav@'{@dotless{i}}a all@'{@dotless{i}}.
