Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Thus, in Lisp, to get the @sc{cdr} of a list, you just get the address of the next cons cell in the series; to get the @sc{car} of a list, you get the address of the first element of the list; to @code{cons} a new element on a list, you add a new cons cell to the front of the list. That is all there is to it! The underlying structure of Lisp is brilliantly simple!
es: De este modo, en Lisp, tiene el @sc{cdr} de una lista, se obtiene la direcci@'on del siguiente cons en las serie; para tener el @sc{car} de una lista, se obtiene la direcci@'on del primer elemento de la lista; para @code{cons} un nuevo elemento en una lista, se a@~nade una nueva c@'elula cons al frente de la lista. @exclamdown{}Esto es todo lo que hay as@'{@dotless{i}}! @exclamdown{}La estructura subyacente de Lisp es brillantemente simple!

source: And what does the last address in a series of cons cells refer to? It is the address of the empty list, of @code{nil}.
es: @questiondown{}Y qu@'e hace la @'ultima direcci@'on en una serie de c@'elulas cons se refieren? Eso es la direcci@'on de la lista vac@'{@dotless{i}}a, de @code{nil}.

source: In summary, when a Lisp variable is set to a value, it is provided with the address of the list to which the variable refers.
es: En resumen, cuando una variable Lisp es asignada a un valor, eso provee con la direcci@'on de la lista a la que la variable se refiere.

source: Symbols as a Chest of Drawers
es: S@'{@dotless{i}}mbolos como una caja con cajones

source: Chest of Drawers, metaphor for a symbol
es: Caja con cajones, met@'afora para su s@'{@dotless{i}}mbolo

source: Drawers, Chest of, metaphor for a symbol
es: Cajones, Caja de, met@'afora para un s@'{@dotless{i}}mbolo

source: In an earlier section, I suggested that you might imagine a symbol as being a chest of drawers. The function definition is put in one drawer, the value in another, and so on. What is put in the drawer holding the value can be changed without affecting the contents of the drawer holding the function definition, and vice-verse.
es: En una secci@'on temprana, se suger@'{@dotless{i}}a que se podr@'{@dotless{i}}a imaginar un s@'{@dotless{i}}mbolo siendo una caja con cajones. La definici@'on de funci@'on se pone en un caj@'on, el valor en otro, y as@'{@dotless{i}}. Lo que se pone en el caj@'on maneja el valor que puede cambiarse sin afectar a los contenidos del caj@'on manejando la definici@'on de funci@'on, y viceversa.

source: Actually, what is put in each drawer is the address of the value or function definition. It is as if you found an old chest in the attic, and in one of its drawers you found a map giving you directions to where the buried treasure lies.
es: Actualmente, lo que est@'a puesto en cada caj@'on es la direcci@'on del valor o definici@'on de funci@'on. Eso es como si se encontrara un viejo caj@'on en el @'atico, y en uno de sus cajones se encontrara un mapa d@'andote direcciones a donde est@'a el tesoro escondido.

source: (In addition to its name, symbol definition, and variable value, a symbol has a `drawer' for a @dfn{property list} which can be used to record other information. Property lists are not discussed here; see @ref{Property Lists, , Property Lists, elisp, The GNU Emacs Lisp Reference Manual}.)
es: (Adem@'as de su nombre, la definici@'on del s@'{@dotless{i}}mbolo, y un valor de la variable, un s@'{@dotless{i}}mbolo tiene un `caj@'on' para una @dfn{lista de propiedades} que puede ser usada para grabar otra informaci@'on. Las listas de propiedades no se discuten aqu@'{@dotless{i}}; ver @ref{Listas de Propiedades, , Listas de Propiedades, elisp, El Manual de Referencia de Emacs Lisp}.)

source: Here is a fanciful representation:
es: Aqu@'{@dotless{i}} hay una representaci@'on visionaria:

source: Chest of Drawers Contents of Drawers
es: Caja de Cajones Contenidos de Cajones

source: __ o0O0o __ / \ --------------------- | directions to | [map to] | symbol name | bouquet | | +---------------------+ | directions to | | symbol definition | [none] | | +---------------------+ | directions to | [map to] | variable value | (rose violet buttercup) | | +---------------------+ | directions to | | property list | [not described here] | | +---------------------+ |/ \|
es: __ o0O0o __ / \ --------------------- | direcciones al | [mapeo a] | nombre del simbolo | ramo | | +---------------------+ | direcciones a la | | definici@'on del | [nunca] | simbolo | +---------------------+ | direcciones al | [mapeo a] | valor de variable | (rosa violeta bot@'ondeoro) | | +---------------------+ | direcciones a la | |lista de propiedades | [no descrito aqu@'{@dotless{i}}] | | +---------------------+ |/ \|

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/drawers.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/drawers.eps}} % \catcode`\@=0 %

source: Set @code{flowers} to @code{violet} and @code{buttercup}. Cons two more flowers on to this list and set this new list to @code{more-flowers}. Set the @sc{car} of @code{flowers} to a fish. What does the @code{more-flowers} list now contain?
es: Asignar @code{flores} a @code{violeta} y @code{bot@'ondeoro}. Asigna dos flores m@'as en esta lista y asigna esta nueva lista a @code{mas-flores}. Asigna el @sc{car} de @code{flores} a un pez. @questiondown{}Qu@'e lista contiene ahora @code{mas-flores}?

source: Text retrieval
es: Recuperar Texto

source: Retrieving text
es: Recuperando Texto

source: Pasting text
es: Pegando Texto

source: Whenever you cut text out of a buffer with a `kill' command in GNU Emacs, you can bring it back with a `yank' command. The text that is cut out of the buffer is put in the kill ring and the yank commands insert the appropriate contents of the kill ring back into a buffer (not necessarily the original buffer).
es: Siempre y cuando se corta texto fuera de un b@'uffer con un comando `kill' en GNU Emacs, se puede traer con un comando `pegar'. El texto cortado del b@'uffer es puesto en el anillo de la muerte y en los comandos pegar, se insertan los contenidos apropiados del kill ring detr@'as de un b@'uffer (no necesariamente el b@'uffer original).

source: A simple @kbd{C-y} (@code{yank}) command inserts the first item from the kill ring into the current buffer. If the @kbd{C-y} command is followed immediately by @kbd{M-y}, the first element is replaced by the second element. Successive @kbd{M-y} commands replace the second element with the third, fourth, or fifth element, and so on. When the last element in the kill ring is reached, it is replaced by the first element and the cycle is repeated. (Thus the kill ring is called a `ring' rather than just a `list'. However, the actual data structure that holds the text is a list. @xref{Kill Ring, , Handling the Kill Ring}, for the details of how the list is handled as a ring.)
es: Un simple comando @kbd{C-y} (@code{yank}) inserta el primer @'{@dotless{i}}tem desde el anillo de la muerte @emph{kill ring} dentro del actual b@'uffer. Si el comando @kbd{C-y} es seguido inmediatamente para @kbd{M-y}, el primer elemento se reemplaza por el segundo elemento. Los sucesivos comandos @kbd{M-y} reemplazan el segundo elemento con el tercer, cuarto, o quinto elemento, y as@'{@dotless{i}}. Cuando se llega al @'ultimo elemento en el anillo de la muerte @emph{kill ring}, se reemplaza por el primer elemento y el ciclo se repite. (De este modo, el kill ring se llama un `anillo' en vez de solo una `lista'. Sin embargo, la estructura de de datos actual que maneja el texto es una lista. @xref{Qu@'e hace el anillo de la muerte, , Manejando el anillo de la muerte @emph{kill ring}}, para los detalles de c@'omo la lista es manejada como un anillo.)

source: Kill Ring Overview
es: Resumen del anillo de la muerte

source: Kill ring overview
es: Resumen del Anillo de la Muerte @emph{Kill ring}

source: The kill ring is a list of textual strings. This is what it looks like:
es: El anillo de la muerte @emph{kill ring} es una lista de cadenas textuales. Esto es lo que se ve:

source: ("some text" "a different piece of text" "yet more text")
es: ("alg@'un texto" "una pieza diferente pieza de texto" "todav@'{@dotless{i}}a m@'as texto")

source: If this were the contents of my kill ring and I pressed @kbd{C-y}, the string of characters saying @samp{some text} would be inserted in this buffer where my cursor is located.
es: Si estos fueran los contenidos de mi anillo de la muerte @emph{kill ring} y yo presionara @kbd{C-y}, la cadena de caracteres diciendo @samp{alg@'un texto} ser@'{@dotless{i}}a insertado en este b@'uffer donde mi cursor est@'a localizado.

source: The @code{yank} command is also used for duplicating text by copying it. The copied text is not cut from the buffer, but a copy of it is put on the kill ring and is inserted by yanking it back.
es: El comando @code{yank} @emph{pegar} es tambi@'en usado para duplicar texto copi@'andolo. El texto copiado no es cortado desde el b@'uffer, pero una copia de eso se pone en el anillo de la muerte @emph{kill ring} y se inserta peg@'andolo.

source: Three functions are used for bringing text back from the kill ring: @code{yank}, which is usually bound to @kbd{C-y}; @code{yank-pop}, which is usually bound to @kbd{M-y}; and @code{rotate-yank-pointer}, which is used by the two other functions.
es: Tres funciones se usan para atraer texto desde el anillo de la muerte @emph{kill ring}: @code{yank} (@emph{pegar}), que normalmente se asocian a @kbd{C-y}; @code{yank-pop}, que normalmente se asocia a @kbd{M-y}; y @code{rotate-yank-pointer}, que se usa por las otras dos funciones.

source: These functions refer to the kill ring through a variable called the @code{kill-ring-yank-pointer}. Indeed, the insertion code for both the @code{yank} and @code{yank-pop} functions is:
es: Estas funciones se refieren al kill ring @emph{anillo de la muerte} a trav@'es de una variable llamada el @code{kill-ring-yank-pointer}. En vez de eso, la inserci@'on del c@'odigo para ambos son las funciones @code{yank} y @code{yank-pop}:

source: (Well, no more. In GNU Emacs 22, the function has been replaced by @code{insert-for-yank} which calls @code{insert-for-yank-1} repetitively for each @code{yank-handler} segment. In turn, @code{insert-for-yank-1} strips text properties from the inserted text according to @code{yank-excluded-properties}. Otherwise, it is just like @code{insert}. We will stick with plain @code{insert} since it is easier to understand.)
es: (Bien, no m@'as. En GNU Emacs 22, la funci@'on se ha reemplazado por @code{insert-for-yank} que llama a @code{insert-for-yank-1} repetitivamente para cada segmento @code{yank-handler}. En vez de eso, @code{insert-for-yank-1} destituye las propiedades de texto desde el texto insertado de acuerdo a @code{yank-excluded-properties}. De otro modo, eso es como @code{insert}. Nosotros lo pegamos con un @code{insert} plano puesto que sea f@'acil de comprender.)

source: To begin to understand how @code{yank} and @code{yank-pop} work, it is first necessary to look at the @code{kill-ring-yank-pointer} variable.
es: Para empezar a comprender c@'omo @code{yank} y @code{yank-pop} funcionan, primero es necesario mirar en la variable @code{kill-ring-yank-pointer}.

source: The @code{kill-ring-yank-pointer} Variable
es: La variable @code{kill-ring-yank-pointer}

source: @code{kill-ring-yank-pointer} is a variable, just as @code{kill-ring} is a variable. It points to something by being bound to the value of what it points to, like any other Lisp variable.
es: @code{kill-ring-yank-pointer} es una variable, solo como @code{kill-ring} es una variable. Eso apunta a alguna cosa siendo asignada al valor de lo que apunta, como cualquier otra variable Lisp.

source: Thus, if the value of the kill ring is:
es: De este modo, si el valor del kill ring es:

source: and the @code{kill-ring-yank-pointer} points to the second clause, the value of @code{kill-ring-yank-pointer} is:
es: y el @code{kill-ring-yank-pointer} apunta a la segunda cl@'ausula, el valor de @code{kill-ring-yank-pointer} es:

source: ("a different piece of text" "yet more text")
es: ("una pieza diferente de texto" "todav@'{@dotless{i}}a m@'as texto")

source: As explained in the previous chapter (@pxref{List Implementation}), the computer does not keep two different copies of the text being pointed to by both the @code{kill-ring} and the @code{kill-ring-yank-pointer}. The words ``a different piece of text'' and ``yet more text'' are not duplicated. Instead, the two Lisp variables point to the same pieces of text. Here is a diagram:
es: Como se explica en el cap@'{@dotless{i}}tulo previo (@xref{Implementaci@'on de listas}), el ordenador no guarda dos copias diferentes del texto siendo apuntado por ambos el @code{kill-ring} (el @emph{anillo de la muerte}) y el @code{kill-ring-yank-pointer} (el @emph{puntero de pegar el anillo de la muerte}). Las palabras ``una pieza diferente de texto'' y ``todav@'{@dotless{i}}a m@'as texto'' no est@'an duplicadas. En vez de eso, las dos variables Lisp apuntan a las mismas piezas de texto. Aqu@'{@dotless{i}} hay un diagrama:

source: kill-ring kill-ring-yank-pointer | | | ___ ___ | ___ ___ ___ ___ ---> | | | --> | | | | | | |___|___|----> |___|___|--> |___|___|--> nil | | | | | | | | --> "yet more text" | | | --> "a different piece of text" | --> "some text"
es: kill-ring kill-ring-yank-pointer | | | ___ ___ | ___ ___ ___ ___ ---> | | | --> | | | | | | |___|___|----> |___|___|--> |___|___|--> nil | | | | | | | | --> "todav@'{@dotless{i}}a m@'as texto" | | | --> "una pieza diferente de texto" | --> "algo de texto"

source: %%%% old method of including an image % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-5.eps}} % \catcode`\@=0 %
es: %%%% viejo m@'etodo de incluir una imagen % \input /usr/local/lib/tex/inputs/psfig.tex % \centerline{\psfig{figure=/usr/local/lib/emacs/man/cons-5.eps}} % \catcode`\@=0 %

source: kill-ring kill-ring-yank-pointer | | | ___ ___ | ___ ___ ___ ___ ---> | | | --> | | | | | | |___|___|----> |___|___|--> |___|___|--> nil | | | | | | | | --> "yet more text" | | | --> "a different piece of text | --> "some text"
es: kill-ring kill-ring-yank-pointer | | | ___ ___ | ___ ___ ___ ___ ---> | | | --> | | | | | | |___|___|----> |___|___|--> |___|___|--> nil | | | | | | | | --> "todav@'{@dotless{i}}a m@'as texto" | | | --> "una pieza diferente de texto" | --> "algo de texto"

source: Both the variable @code{kill-ring} and the variable @code{kill-ring-yank-pointer} are pointers. But the kill ring itself is usually described as if it were actually what it is composed of. The @code{kill-ring} is spoken of as if it were the list rather than that it points to the list. Conversely, the @code{kill-ring-yank-pointer} is spoken of as pointing to a list.
es: Tanto la variable @code{kill-ring} y la variable @code{kill-ring-yank-pointer} son punteros. Pero el kill ring @emph{anillo de la muerte} en s@'{@dotless{i}} es normalmente descrito como si fuera actualmente de lo que est@'a compuesto. El @code{kill-ring} se refiere a lo que es la lista en vez de lo que apunta a la lista. Conversando, el @code{kill-ring-yank-pointer} se refiere a como se apunta a una lista.

source: These two ways of talking about the same thing sound confusing at first but make sense on reflection. The kill ring is generally thought of as the complete structure of data that holds the information of what has recently been cut out of the Emacs buffers. The @code{kill-ring-yank-pointer} on the other hand, serves to indicate---that is, to `point to'---that part of the kill ring of which the first element (the @sc{car}) will be inserted.
es: Estas dos maneras hablar acerca de la misma cosa suena confuso al principio pero tiene sentido para reflexionar. El kill ring @emph{anillo de la muerte} es generalmente pensado como la estructura completa de datos que manejan la informaci@'on de lo que se ha cortado reci@'entemente de los b@'uffers de Emacs. El @code{kill-ring-yank-pointer} en la otra mano, sirve para indicar --- que es, para `apuntar a' --- esta parte del anillo de la muerte del que el primer elemento (el @sc{car}) ser@'a insertado.

source: Exercises with @code{yank} and @code{nthcdr}
es: Ejercicios con @code{yank} y @code{nthcdr}

source: Using @kbd{C-h v} (@code{describe-variable}), look at the value of your kill ring. Add several items to your kill ring; look at its value again. Using @kbd{M-y} (@code{yank-pop)}, move all the way around the kill ring. How many items were in your kill ring? Find the value of @code{kill-ring-max}. Was your kill ring full, or could you have kept more blocks of text within it?
es: Usando @kbd{C-h v} (@code{describe-variable}), mira en el valor de tu kill ring @emph{anillo de la muerte}. A@~nade varios @'{@dotless{i}}tems a tu anillo de la muerte @emph{kill ring}; mira en su valor de nuevo. Usando @kbd{M-y} (@code{yank-pop}, mueve todo el camino alrededor del kill ring @emph{anillo de la muerte}. @questiondown{}Cu@'antos @'{@dotless{i}}tems estaban en tu kill ring @emph{anillo de la muerte}? Encuentra el valor de @code{kill-ring-max}. @questiondown{}Estaba tu anillo de la muerte @emph{kill ring} completo, o podr@'{@dotless{i}}as haber guardado m@'as bloques de texto dentro?

source: Using @code{nthcdr} and @code{car}, construct a series of expressions to return the first, second, third, and fourth elements of a list.
es: Usando @code{nthcrd} y @code{car}, construye una serie de expresiones para devolver, el primer, segundo, tercer y cuarto elemento de una lista.

source: Loops and recursion
es: Bucles y recursi@'on

source: Recursion and loops
es: Recursi@'on y bucles

source: Repetition (loops)
es: Repetici@'on (bucles)

source: Emacs Lisp has two primary ways to cause an expression, or a series of expressions, to be evaluated repeatedly: one uses a @code{while} loop, and the other uses @dfn{recursion}.
es: Emacs Lisp tiene dos caminos primarios para causar una expresi@'on, o una serie de expresiones, para ser evaluado repetidamente: uno usa un bucle @code{while}, y el otro usa @dfn{recursi@'on}.

source: Repetition can be very valuable. For example, to move forward four sentences, you need only write a program that will move forward one sentence and then repeat the process four times. Since a computer does not get bored or tired, such repetitive action does not have the deleterious effects that excessive or the wrong kinds of repetition can have on humans.
es: La repetici@'on puede ser valorable. Por ejemplo, para mover hacia delante cuatro frases, tu solo necesitas escribir un programa que mover@'a hacia delante una frase y entonces repite el proceso cuatro veces. Ya que un ordenador no est@'a aburrido o cansado, tal acci@'on repetitiva no tiene los efectos de borrado por equivocaci@'on o exceso que pueden tener los humanos.

source: People mostly write Emacs Lisp functions using @code{while} loops and their kin; but you can use recursion, which provides a very powerful way to think about and then to solve problems@footnote{You can write recursive functions to be frugal or wasteful of mental or computer resources; as it happens, methods that people find easy---that are frugal of `mental resources'---sometimes use considerable computer resources. Emacs was designed to run on machines that we now consider limited and its default settings are conservative. You may want to increase the values of @code{max-specpdl-size} and @code{max-lisp-eval-depth}. In my @file{.emacs} file, I set them to 15 and 30 times their default value.}.
es: La gente mayoritariamente escribe funciones de Emacs Lisp usando bucles @code{while}; pero se puede usar recursi@'on, que provee un poderoso camino mental para resolver problemas@footnote{Se pueden escribir funciones recursivas para ser frugal o basura mental o recursos de ordenador; como eso ocurre, los m@'etodos que la gente encuentra f@'aciles --- son frugales de `recursos mentales' --- algunas veces usan recursos de ordenador considerables. Emacs fu@'e dise@~nado para ejecutarse en m@'aquinas que ahora se consideran limitadas y sus configuraciones por defecto son conservadoras. Se puede querer incrementar los valores de @code{max-specdl-size} y @code{max-lisp-eval-depth}. En mi fichero @file{.emacs}, yo los asigno a 15 o 30 veces su valor por defecto.}.

source: Loops
es: Bucles

source: The @code{while} special form tests whether the value returned by evaluating its first argument is true or false. This is similar to what the Lisp interpreter does with an @code{if}; what the interpreter does next, however, is different.
es: La forma especial @code{while} chequea si el valor devuelto para evaluar el primer argumento es verdadero o falso. Esto es parecido a lo que el int@'erprete Lisp hace con un @code{if}; el int@'erprete hace lo siguiente, sin embargo, es diferente.

source: In a @code{while} expression, if the value returned by evaluating the first argument is false, the Lisp interpreter skips the rest of the expression (the @dfn{body} of the expression) and does not evaluate it. However, if the value is true, the Lisp interpreter evaluates the body of the expression and then again tests whether the first argument to @code{while} is true or false. If the value returned by evaluating the first argument is again true, the Lisp interpreter again evaluates the body of the expression.
es: En una expresi@'on @code{while}, si el valor devuelto por evaluar el primer argumento es falso, el int@'erprete Lisp descarta el resto de la expresi@'on (el @dfn{cuerpo} de la expresi@'on) y no la eval@'ua. Sin embargo, si el valor es cierto, el int@'erprete Lisp eval@'ua el cuerpo de la expresi@'on y entonces de nuevo chequea si el primer argumento para @code{while} es cierto o falso. Si el valor devuelto de evaluar el primer argumento es cierto de nuevo, el int@'erprete Lisp eval@'ua el cuerpo de la expresi@'on.

source: The template for a @code{while} expression looks like this:
es: La plantilla para una expresi@'on @code{while} se ve as@'{@dotless{i}}:

source: (while @var{true-or-false-test} @var{body}@dots{})
es: (while @var{test-verdadero-o-falso} @var{cuerpo}@dots{})

source: Looping with @code{while}
es: Bucles con @code{while}

source: So long as the true-or-false-test of the @code{while} expression returns a true value when it is evaluated, the body is repeatedly evaluated. This process is called a loop since the Lisp interpreter repeats the same thing again and again, like an airplane doing a loop. When the result of evaluating the true-or-false-test is false, the Lisp interpreter does not evaluate the rest of the @code{while} expression and `exits the loop'.
es: En el momento en el que el true-or-false-test de la expresi@'on @code{while} devuelve un valor cierto cuando eso se eval@'ua, el cuerpo es repetidamente evaluado. Este proceso se llama bucle puesto que el int@'erprete Lisp repite la misma cosa una y otra vez, como un avi@'on haciendo un loop. Cuando el resultado de evaluar el true-or-false-test es falso, el int@'erprete Lisp no eval@'ua el resto de la expresi@'on @code{while} y `existe el bucle'.
