Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: (In a read-only buffer, such as the @file{*info*} buffer, the kill command, @kbd{C-k} (@code{kill-line}), will not remove the text, merely copy it to the kill ring. However, your machine may beep at you. Alternatively, for silence, you may copy the region of each line with the @kbd{M-w} (@code{kill-ring-save}) command. You must mark each line for this command to succeed, but it does not matter at which end you put point or mark.)
es: (En un b@'uffer de solo lectura, tal como el b@'uffer @file{*info*}, el comando kill, @kbd{C-k} (@code{kill-line}), no eliminar@'a el texto, solamente lo mueve al anillo de la muerte @emph{kill ring}. Sin embargo, el ordenador puede avisar con un beep. Alternativamente, para silenciar, se puede copiar la regi@'on de cada l@'{@dotless{i}}nea con el comando @kbd{M-w} (@code{kill-ring-save}). Se debe marcar cada l@'{@dotless{i}}nea de este comando para tener @'exito, pero no importa si al final se posiciona en el punto o la marca).

source: Please invoke the calls in order, so that five elements attempt to fill the kill ring:
es: Por favor, invoque las llamadas en orden, de modo que los cinco elementos rellenen el anillo de la muerte @emph{kill ring}.

source: first some text second piece of text third line fourth line of text fifth bit of text
es: primero algo de texto segunda pieza de texto tercera l@'{@dotless{i}}nea cuarta l@'{@dotless{i}}nea de texto quinto bit de texto

source: Then find the value of @code{kill-ring} by evaluating
es: Entonces encuentra el valor de @code{kill-ring} evaluando

source: It is:
es: Eso es:

source: ("fifth bit of text" "fourth line of text" "third line" "second piece of text")
es: ("quinto bit de texto" "cuarta l@'{@dotless{i}}nea de texto" "tercera l@'{@dotless{i}}nea" "segunda pieza de texto")

source: The first element, @samp{first some text}, was dropped.
es: El primer elemento, @samp{primero algo de texto}, fu@'e borrado.

source: To return to the old value for the length of the kill ring, evaluate:
es: Para devolver el viejo valor para el tama@~no del kill ring, eval@'ue:

source: The @code{current-kill} function changes the element in the kill ring to which @code{kill-ring-yank-pointer} points. (Also, the @code{kill-new} function sets @code{kill-ring-yank-pointer} to point to the latest element of the kill ring. The @code{kill-new} function is used directly or indirectly by @code{kill-append}, @code{copy-region-as-kill}, @code{kill-ring-save}, @code{kill-line}, and @code{kill-region}.)
es: La funci@'on @code{current-kill} cambia el elemento en el anillo de la muerte @emph{kill ring} para el que el @code{kill-ring-yank-pointer} apunta. (Tambi@'en, la funci@'on @code{kill-new} asigna @code{kill-ring-yank-pointer} para apuntar al @'ultimo elemento del anillo de la muerte @emph{kill ring}. La funci@'on @code{kill-new} se usa directamente o indirectamente por @code{kill-append}, @code{copy-region-as-kill}, @code{kill-ring-save}, @code{kill-line}, y @code{kill-region}.)

source: Code for current-kill
es: C@'odigo para current-kill

source: The code for @code{current-kill}
es: El c@'odigo @code{current-kill}

source: The @code{current-kill} function is used by @code{yank} and by @code{yank-pop}. Here is the code for @code{current-kill}:
es: La funci@'on @code{current-kill} es usada por @code{yank} y por @code{yank-pop}. Aqu@'{@dotless{i}} est@'a el c@'odigo para @code{current-kill}:

source: (defun current-kill (n &optional do-not-move) "Rotate the yanking point by N places, and then return that kill. If N is zero, `interprogram-paste-function' is set, and calling it returns a string, then that string is added to the front of the kill ring and returned as the latest kill.
es: (defun current-kill (n &optional do-not-move) "Rota el punto de pegue por N lugares, y entonces devuelve lo cortado. Si N es cero, `interprogram-paste-function' se asigna, y si se llama devuelve una cadena, entonces esta cadena se a@~nade al frente del anillo de la muerte @emph{kill ring} y devuelve el @'ultimo corte.

source: If optional arg DO-NOT-MOVE is non-nil, then don't actually move the yanking point; just return the Nth kill forward." (let ((interprogram-paste (and (= n 0) interprogram-paste-function (funcall interprogram-paste-function))))
es: Si el argumento opcional DO-NOT-MOVE es no nulo, entonces no muevas el punto de pegue; solo devuelve el Nth corte hacia adelante. (let ((interprogram-paste (and (= n 0) interprogram-paste-function (funcall interprogram-paste-function)))))

source: (if interprogram-paste (progn ;; Disable the interprogram cut function when we add the new ;; text to the kill ring, so Emacs doesn't try to own the ;; selection, with identical text. (let ((interprogram-cut-function nil)) (kill-new interprogram-paste)) interprogram-paste)
es: (if interprogram-paste (progn ;; Deshabilita el programa de la funci@'on de corte cuando se ;; a@~nade el nuevo texto al anillo de la muerte @emph{kill ring}, ;; as@'{@dotless{i}} Emacs no intenta poseer la selecci@'on ;; con id@'entico texto. (let ((interprogram-cut-function nil)) (kill-new interprogram-paste)) interprogram-paste)

source: Remember also that the @code{kill-new} function sets @code{kill-ring-yank-pointer} to the latest element of the kill ring, which means that all the functions that call it set the value indirectly: @code{kill-append}, @code{copy-region-as-kill}, @code{kill-ring-save}, @code{kill-line}, and @code{kill-region}.
es: Recuerde tambi@'en que la funci@'on @code{kill-new} asigna @code{kill-ring-yank-pointer} al @'ultimo elemento del anillo de la muerte @emph{kill ring}, que significa que todas las funciones lo llaman y asigna el valor de manera indirecta: @code{kill-append}, @code{copy-region-as-kill}, @code{kill-ring-save}, @code{kill-line} y @code{kill-region}.

source: Here is the line in @code{kill-new}, which is explained in @ref{kill-new function, , The @code{kill-new} function}.
es: Aqu@'{@dotless{i}} est@'a la l@'{@dotless{i}}nea en @code{kill-new}, que se explica en la @ref{Funci@'on kill-new, , La funci@'on @code{kill-new}}.

source: The @code{current-kill} function looks complex, but as usual, it can be understood by taking it apart piece by piece. First look at it in skeletal form:
es: La funci@'on @code{current-kill} parece compleja, pero usual, eso puede ser comprendido tom@'andolo aparte pieza por pieza. Primero m@'{@dotless{i}}ralo en la forma esquel@'etica:

source: (defun current-kill (n &optional do-not-move) "Rotate the yanking point by N places, and then return that kill." (let @var{varlist} @var{body}@dots{})
es: (defun current-kill (n &optional do-not-move) "Rota el punto a pegar por N lugares, y entonces devuelve el texto cortado." (let @var{varlist} @var{body}@dots{})

source: This function takes two arguments, one of which is optional. It has a documentation string. It is @emph{not} interactive.
es: Esta funci@'on tiene dos argumentos, uno es opcional. Hay una cadena de documentaci@'on. @emph{No} es una funci@'on interactiva.

source: Body of current-kill
es: Cuerpo de current-kill

source: The Body of @code{current-kill}
es: El cuerpo de @code{current-kill}

source: The body of the function definition is a @code{let} expression, which itself has a body as well as a @var{varlist}.
es: El cuerpo de la definici@'on de funci@'on es una expresi@'on @code{let}, que por s@'{@dotless{i}} misma tiene tanto un cuerpo como una @var{varlist}.

source: The @code{let} expression declares a variable that will be only usable within the bounds of this function. This variable is called @code{interprogram-paste} and is for copying to another program. It is not for copying within this instance of GNU Emacs. Most window systems provide a facility for interprogram pasting. Sadly, that facility usually provides only for the last element. Most windowing systems have not adopted a ring of many possibilities, even though Emacs has provided it for decades.
es: La expresi@'on @code{let} declara una variable que ser@'a solo usable con las asociaciones de esta funci@'on. Esta variable se llama @code{interprogram-paste} y se copia a otro programa. No se copia con esta instancia de GNU Emacs. La mayor@'{@dotless{i}}a de los sistemas de ventanas proveen una facilidad para pegar el interprograma. Tristemente, esta facilidad normalmente provee solo el @'ultimo elemento. La mayor@'{@dotless{i}}a de los sistemas de ventanas no han adoptado un anillo de muchas posibilidades, incluso aunque Emacs haya provisto esto durante d@'ecadas.

source: The @code{if} expression has two parts, one if there exists @code{interprogram-paste} and one if not.
es: La expresi@'on @code{if} tiene dos partes, una si existe @code{interprogram-paste} y otra si no.

source: Let us consider the `if not' or else-part of the @code{current-kill} function. (The then-part uses the @code{kill-new} function, which we have already described. @xref{kill-new function, , The @code{kill-new} function}.)
es: Perm@'{@dotless{i}}tenos considerar el `si no' o la parte else de la funci@'on @code{current-kill}. (La parte then usa la funci@'on @code{kill-new}, que ya hemos descrito. @xref{Funci@'on kill-new, , La funci@'on @code{kill-new}.})

source: (or kill-ring (error "Kill ring is empty")) (let ((ARGth-kill-element (nthcdr (mod (- n (length kill-ring-yank-pointer)) (length kill-ring)) kill-ring))) (or do-not-move (setq kill-ring-yank-pointer ARGth-kill-element)) (car ARGth-kill-element))
es: (or kill-ring (error "El Kill ring est@'a vac@'{@dotless{i}}o")) (let ((ARGth-kill-element (nthcdr (mod (- n (length kill-ring-yank-pointer)) (length kill-ring)) kill-ring))) (or do-not-move (setq kill-ring-yank-pointer ARGth-kill-element)) (car ARGth-kill-element))

source: The code first checks whether the kill ring has content; otherwise it signals an error.
es: El c@'odigo primero chequea si el kill ring @emph{anillo de la muerte} tiene contenido; de otro modo se@~nala un error.

source: Note that the @code{or} expression is very similar to testing length with an @code{if}:
es: Note que la expresi@'on @code{or} es muy similar para testear el tama@~no con un @code{if}:

source: (if (zerop (length kill-ring)) ; @r{if-part} (error "Kill ring is empty")) ; @r{then-part} ;; No else-part
es: (if (zerop (length kill-ring)) ; @r{parte-si} (error "Anillo de la muerte vac@'{@dotless{i}}o")) ; @r{parte-entonces} ;; No hay parte-resto

source: If there is not anything in the kill ring, its length must be zero and an error message sent to the user: @samp{Kill ring is empty}. The @code{current-kill} function uses an @code{or} expression which is simpler. But an @code{if} expression reminds us what goes on.
es: Si no hay nada en el kill ring @emph{anillo de la muerte}, su tama@~no debe ser cero y un mensaje de error se env@'{@dotless{i}}a al usuario: @samp{El kill ring est@'a vac@'{@dotless{i}}o}. La funci@'on @code{current-kill} usa una expresi@'on @code{or} que es simple. Pero una expresi@'on @code{if} recuerda lo que lleva.

source: This @code{if} expression uses the function @code{zerop} which returns true if the value it is testing is zero. When @code{zerop} tests true, the then-part of the @code{if} is evaluated. The then-part is a list starting with the function @code{error}, which is a function that is similar to the @code{message} function (@pxref{message, , The @code{message} Function}) in that it prints a one-line message in the echo area. However, in addition to printing a message, @code{error} also stops evaluation of the function within which it is embedded. This means that the rest of the function will not be evaluated if the length of the kill ring is zero.
es: Esta expresi@'on @code{if} usa la funci@'on @code{zerop} que devuelve cierto si el valor que se chequea es cero. Cuando @code{zerop} chequea cierto, la parte then del @code{if} se eval@'ua. La parte then es una lista empezando con la funci@'on @code{error}, que es una funci@'on que es similar a la funci@'on @code{message} (@pxref{message, , La Funci@'on @code{message}}) que imprime un mensaje de una l@'{@dotless{i}}nea en el @'area echo. Sin embargo, adem@'as de imprimir un mensaje, @code{error} tambi@'en eval@'ua la funci@'on que est@'a embebida. Esto significa que el resto de la funci@'on no ser@'a evaluada si el tama@~no del anillo de la muerte @emph{kill ring} es cero.

source: Then the @code{current-kill} function selects the element to return. The selection depends on the number of places that @code{current-kill} rotates and on where @code{kill-ring-yank-pointer} points.
es: Entonces la funci@'on @code{current-kill} selecciona el elemento a devolver. La selecci@'on depende del n@'umero de lugares que @code{current-kill} rota y donde @code{kill-ring-yank-pointer} apunta.

source: Next, either the optional @code{do-not-move} argument is true or the current value of @code{kill-ring-yank-pointer} is set to point to the list. Finally, another expression returns the first element of the list even if the @code{do-not-move} argument is true.
es: Lo siguiente, si el argumento @code{do-not-move} opcional es verdadero o el actual valor de @code{kill-ring-yank-pointer} se establece al punto de la lista. Finalmente, otra expresi@'on devuelve el primer elemento de la lista incluso si el argumento @code{do-not-move} es verdadero.

source: Digression about the word `error'
es: Disgresi@'on acerca de la palabra `error'

source: In my opinion, it is slightly misleading, at least to humans, to use the term `error' as the name of the @code{error} function. A better term would be `cancel'. Strictly speaking, of course, you cannot point to, much less rotate a pointer to a list that has no length, so from the point of view of the computer, the word `error' is correct. But a human expects to attempt this sort of thing, if only to find out whether the kill ring is full or empty. This is an act of exploration.
es: En mi opini@'on, es ligeramente err@'oneo, al menos para humanos, usar el t@'ermino `error' como el nombre de la funci@'on @code{error}. Un t@'ermino mejor ser@'{@dotless{i}}a `cancelar'. Estrictamente hablando, de acuerdo, no se puede apuntar, mucho menos rotar un puntero a una lista que no tiene tama@~no, as@'{@dotless{i}} desde el punto de vista del ordenador, la palabra `error' es correcta. Pero un humano espera intentar algo, si solo si se encuentra el anillo de la muerte @emph{kill ring} est@'e lleno o vac@'{@dotless{i}}o. Esto es un acto de exploraci@'on.

source: From the human point of view, the act of exploration and discovery is not necessarily an error, and therefore should not be labeled as one, even in the bowels of a computer. As it is, the code in Emacs implies that a human who is acting virtuously, by exploring his or her environment, is making an error. This is bad. Even though the computer takes the same steps as it does when there is an `error', a term such as `cancel' would have a clearer connotation.
es: Desde el punto de vista humano, el acto de exploraci@'on y descubrimiento no es necesariamente un error, y por esta raz@'on no ser@'{@dotless{i}}a etiquetado como tal, incluso las vocales de un ordenador. Como tal, el c@'odigo en Emacs implica que un humano que est@'a actuando virtuosamente, explorando su entorno, est@'a teniendo un error. Esto est@'a mal. Incluso aunque el ordenador tome los mismos pasos como cuando hay `error', un t@'ermino tal como `cancelar' tendr@'{@dotless{i}}a una clara connotaci@'on.

source: Among other actions, the else-part of the @code{if} expression sets the value of @code{kill-ring-yank-pointer} to @code{ARGth-kill-element} when the kill ring has something in it and the value of @code{do-not-move} is @code{nil}.
es: Entre otras acciones, la else-part de la expresi@'on @code{if} asigna el valor de @code{kill-ring-yank-pointer} a @code{ARGth-kill-element} cuando el kill ring @emph{anillo de la muerte} tiene alguna cosa dentro y el valor de @code{do-not-move} es @code{nil}.

source: This needs some examination. Unless it is not supposed to move the pointer, the @code{current-kill} function changes where @code{kill-ring-yank-pointer} points. That is what the @w{@code{(setq kill-ring-yank-pointer ARGth-kill-element))}} expression does. Also, clearly, @code{ARGth-kill-element} is being set to be equal to some @sc{cdr} of the kill ring, using the @code{nthcdr} function that is described in an earlier section. (@xref{copy-region-as-kill}.) How does it do this?
es: Esto necesita alg@'un examen. A menos que no se suponga mover el puntero, la funci@'on @code{current-kill} cambia donde @code{kill-ring-yank-pointer} apunta. Esto es lo que la expresi@'on @w{@code{(setq kill-ring-yank-pointer ARGth-kill-element)}} hace. Tambi@'en, claramente, @code{ARGth-kill-element} est@'a siendo asignado para ser igual a alg@'un @sc{cdr} del anillo de la muerte @emph{kill ring}, usando la funci@'on @code{nthcdr} que est@'a descrita en una secci@'on temprana. (@xref{copy-region-as-kill}.) ¿C@'omo se hace?

source: As we have seen before (@pxref{nthcdr}), the @code{nthcdr} function works by repeatedly taking the @sc{cdr} of a list---it takes the @sc{cdr} of the @sc{cdr} of the @sc{cdr} @dots{}
es: Como se ha visto antes (@pxref{nthcdr}), la funci@'on @code{nthcdr} funciona repetidamente tomando el @sc{cdr} de una lista --- eso toma el @sc{cdr}, del @sc{cdr}, del @sc{cdr}, @dots{}

source: The two following expressions produce the same result:
es: Las siguientes dos expresiones producen el mismo resultado:

source: However, the @code{nthcdr} expression is more complicated. It uses the @code{mod} function to determine which @sc{cdr} to select.
es: Sin embargo, la expresi@'on @code{nthcdr} es m@'as complicada. Usa la funci@'on @code{mod} para determinar que @sc{cdr} para seleccionar.

source: (You will remember to look at inner functions first; indeed, we will have to go inside the @code{mod}.)
es: (Se recordar@'a buscar funciones propias primero, en vez de esto, tendremos que ir dentro del @code{mod}.)

source: The @code{mod} function returns the value of its first argument modulo the second; that is to say, it returns the remainder after dividing the first argument by the second. The value returned has the same sign as the second argument.
es: La funci@'on @code{mod} devuelve el valor de su primer argumento m@'odulo el segundo; que es decir, eso devuelve el resto despu@'es de dividir el primer argumento por el segundo. El valor devuelto tiene el mismo signo que el segundo argumento.

source: Thus,
es: De este modo,

source: (mod 12 4) @result{} 0 ;; @r{because there is no remainder} (mod 13 4) @result{} 1
es: (mod 12 4) @result{} 0 ;; @r{porque no hay resto} (mod 13 4) @result{} 1

source: In this case, the first argument is often smaller than the second. That is fine.
es: En este caso, el primer argumento es con frecuencia peque@~no que el segundo. Que est@'a bien.

source: We can guess what the @code{-} function does. It is like @code{+} but subtracts instead of adds; the @code{-} function subtracts its second argument from its first. Also, we already know what the @code{length} function does (@pxref{length}). It returns the length of a list.
es: Se puede adivinar lo que la funci@'on @code{-} hace. Eso es como @code{+} pero sustrae en vez de a@~nadir; la funci@'on @code{-} sustrae su segundo argumento desde el primero. Tambi@'en, ya se sabe que la funci@'on @code{length} hace (@pxref{length}). Eso devuelve el tama@~no de una lista.

source: And @code{n} is the name of the required argument to the @code{current-kill} function.
es: Y @code{n} es el nombre del argumento requerido a la funci@'on @code{current-kill}.

source: So when the first argument to @code{nthcdr} is zero, the @code{nthcdr} expression returns the whole list, as you can see by evaluating the following:
es: As@'{@dotless{i}} cuando el primer argumento a @code{nthcdr} es cero, la expresi@'on @code{nthcdr} devuelve la lista entera, como se puede ver evaluando lo siguiente:

source: ;; kill-ring-yank-pointer @r{and} kill-ring @r{have a length of four} ;; @r{and} (mod (- 0 4) 4) @result{} 0 (nthcdr (mod (- 0 4) 4) '("fourth line of text" "third line" "second piece of text" "first some text"))
es: ;; kill-ring-yank-pointer @r{and} kill-ring @r{tener un tama@~no de cuatro} ;; @r{and} (mod (- 0 4) 4) @result{} 0 (nthcdr (mod (- 0 4) 4) '("cuarta l@'{@dotless{i}}nea de texto" "tercera l@'{@dotless{i}}nea" "segunda pieza de texto" "primero algo de texto"))

source: When the first argument to the @code{current-kill} function is one, the @code{nthcdr} expression returns the list without its first element.
es: Cuando el primer argumento a la funci@'on @code{current-kill} es uno, la expresi@'on @code{nthcdr} devuelve la lista sin su primer elemento.

source: (nthcdr (mod (- 1 4) 4) '("fourth line of text" "third line" "second piece of text" "first some text"))
es: (nthcdr (mod (- 1 4) 4) '("cuarta l@'{@dotless{i}}nea de texto" "tercera l@'{@dotless{i}}nea" "segunda pieza de texto" "primero algo de texto"))

source: @samp{global variable} defined
es: @samp{variable global} definida

source: @samp{variable, global}, defined
es: @samp{variable, global}, definida

source: Incidentally, both @code{kill-ring} and @code{kill-ring-yank-pointer} are @dfn{global variables}. That means that any expression in Emacs Lisp can access them. They are not like the local variables set by @code{let} or like the symbols in an argument list. Local variables can only be accessed within the @code{let} that defines them or the function that specifies them in an argument list (and within expressions called by them).
es: Incidentalmente, tanto @code{kill-ring} y @code{kill-ring-yank-pointer} son @dfn{variables globales}. Esto significa que cualquier expresi@'on en Emacs Lisp puede acceder a ellas. Ellas no son como las variables locales asignadas por @code{let} o como los s@'{@dotless{i}}mbolos en una lista de argumentos. Las variables locales pueden solo ser accedidas con el @code{let} que los define o la funci@'on que los especifica en una lista de argumentos (y con expresiones llamadas por ellos).

source: After learning about @code{current-kill}, the code for the @code{yank} function is almost easy.
es: Despu@'es de aprender acerca de @code{current-kill}, el c@'odigo para la funci@'on @code{yank} es casi f@'acil.

source: The @code{yank} function does not use the @code{kill-ring-yank-pointer} variable directly. It calls @code{insert-for-yank} which calls @code{current-kill} which sets the @code{kill-ring-yank-pointer} variable.
es: La funci@'on @code{yank} no usa la variable @code{kill-ring-yank-pointer} directamente. Eso llama a @code{insert-for-yank} que llama a @code{current-kill} que asigna la variable @code{kill-ring-yank-pointer}.

source: (defun yank (&optional arg) "Reinsert (\"paste\") the last stretch of killed text. More precisely, reinsert the stretch of killed text most recently killed OR yanked. Put point at end, and set mark at beginning. With just \\[universal-argument] as argument, same but put point at beginning (and mark at end). With argument N, reinsert the Nth most recently killed stretch of killed text.
es: (defun yank (&optional arg) "Reinserta (\"pega\") el @'ultimo logro del texto cortado. M@'as precisamente, reinserta el texto cortado m@'as recientemente. Pon el punto al final, y asigna la marca al principio. Solo con \\[universal-argument] como argumento, lo mismo pero pon el punto al principio (y la marca al final). Con el argumento N, reinserta el N m@'as recientemente cortado.
