Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The @code{column-of-graph} function requires the height of the graph as an argument, so we should determine and record that as a local variable.
es: La funci@'on @code{column-of-graph} requiere el alto del grafo como un argumento, as@'{@dotless{i}} se asigna y guarda esto como una variable local.

source: This leads us to the following template for the @code{while} loop version of this function:
es: Esto lidera a la siguiente plantilla para el bucle @code{while} versi@'on de esta funci@'on:

source: We need to fill in the slots of the template.
es: Necesitamos rellenar los slots de la plantilla.

source: Clearly, we can use the @code{(apply 'max numbers-list)} expression to determine the height of the graph.
es: Claramente, se puede usar la expresi@'on @code{(apply 'max numbers-list)} para determinar el alto del grafo.

source: The @code{while} loop will cycle through the @code{numbers-list} one element at a time. As it is shortened by the @code{(setq numbers-list (cdr numbers-list))} expression, the @sc{car} of each instance of the list is the value of the argument for @code{column-of-graph}.
es: El bucle @code{while} iterar@'a a trav@'es de @code{numbers-list} un elemento a la vez. Como eso est@'a ordenado por la expresi@'on @code{(setq numbers-list (cdr numbers-list))}, el @sc{car} de cada instancia de la lista es el valor del argumento para @code{column-of-graph}.

source: At each cycle of the @code{while} loop, the @code{insert-rectangle} function inserts the list returned by @code{column-of-graph}. Since the @code{insert-rectangle} function moves point to the lower right of the inserted rectangle, we need to save the location of point at the time the rectangle is inserted, move back to that position after the rectangle is inserted, and then move horizontally to the next place from which @code{insert-rectangle} is called.
es: En cada ciclo del bucle @code{while}, la funci@'on @code{insert-rectangle} inserta la lista devuelta por @code{column-of-graph}. Desde que la funci@'on @code{insert-rectangle}, se necesita guardar la localizaci@'on de punto al tiempo que el rect@'angulo se inserta, mueve atr@'as a esta posici@'on despu@'es de que el rect@'angulo es insertado, y entonces se mueve horizontalmente al siguiente lugar desde el que @code{insert-rectangle} se llama.

source: If the inserted columns are one character wide, as they will be if single blanks and asterisks are used, the repositioning command is simply @code{(forward-char 1)}; however, the width of a column may be greater than one. This means that the repositioning command should be written @code{(forward-char symbol-width)}. The @code{symbol-width} itself is the length of a @code{graph-blank} and can be found using the expression @code{(length graph-blank)}. The best place to bind the @code{symbol-width} variable to the value of the width of graph column is in the varlist of the @code{let} expression.
es: Si las columnas se insertan en un car@'acter amplio, ser@'a si los espacios en blanco y asteriscos se usan, el comando de reposici@'on es simple @code{(forward-char 1)}; sin embargo, el ancho de una columna puede ser m@'as grande que uno. Esto significa que el comando de reposicionamiento ser@'{@dotless{i}}a escrito @code{(forward-char symbol-width)}. El mejor lugar para asociar la variable @code{symbol-width} al valor del width de la columna grafo est@'a en la varlist de la expresi@'on @code{let}.

source: These considerations lead to the following function definition:
es: Estas consideraciones lideran a la siguiente definici@'on de funci@'on:

source: (defun graph-body-print (numbers-list) "Print a bar graph of the NUMBERS-LIST. The numbers-list consists of the Y-axis values."
es: (defun graph-body-print (numbers-list) "Imprime un gr@'afico de barras de la NUMBERS-LIST. La numbers-list consiste en los valores del eje Y."

source: ;; @r{Draw graph column by column.} (sit-for 0) (setq numbers-list (cdr numbers-list)))
es: ;; @r{Dibuja la columna del grafo por columna.} (sit-for 0) (setq numbers-list (cdr numbers-list)))

source: ;; @r{Place point for X axis labels.} (forward-line height) (insert "\n") ))
es: ;; @r{Emplaza el punto para etiquetas de ejes X.} (forward-line height) (insert "\n") ))

source: The one unexpected expression in this function is the @w{@code{(sit-for 0)}} expression in the @code{while} loop. This expression makes the graph printing operation more interesting to watch than it would be otherwise. The expression causes Emacs to `sit' or do nothing for a zero length of time and then redraw the screen. Placed here, it causes Emacs to redraw the screen column by column. Without it, Emacs would not redraw the screen until the function exits.
es: La expresi@'on inesperada en esta funci@'on es la expresi@'on @w{@code{(sit-for 0)}} en el bucle @code{while}. Esta expresi@'on hace que el grafo imprima la operaci@'on m@'as interesante para vigilar lo que ser@'{@dotless{i}}a de otro modo. La expresi@'on causa que Emacs pare (sit-for 0) para un momento cero y entonces redibuje la pantalla. Puesto aqu@'{@dotless{i}}, eso causa que Emacs redibuje la pantalla columna por columna. Sin eso, Emacs no redibujar@'{@dotless{i}}a la pantalla hasta que la funci@'on exista.

source: We can test @code{graph-body-print} with a short list of numbers.
es: Se puede chequear @code{graph-body-print} con una peque@~na lista de n@'umeros.

source: Install @code{graph-symbol}, @code{graph-blank}, @code{column-of-graph}, which are in
es: Instala @code{graph-symbol}, @code{graph-blank}, @code{column-of-graph}, que est@'an en

source: @ref{Readying a Graph, , Readying a Graph},
es: @ref{Leyendo un grafo, , Leyendo un grafo},

source: @ref{Columns of a graph},
es: @ref{Columnas de un grafo},

source: Copy the following expression:
es: Copia la siguiente expresi@'on:

source: Switch to the @file{*scratch*} buffer and place the cursor where you want the graph to start.
es: Cambia al b@'uffer @file{*scratch*} y emplaza el cursor donde quiere que el grafo empiece.

source: Type @kbd{M-:} (@code{eval-expression}).
es: Escribe @kbd{M-:} (@code{eval-expression}).

source: Yank the @code{graph-body-print} expression into the minibuffer with @kbd{C-y} (@code{yank)}.
es: Pega la expresi@'on @code{graph-body-print} dentro del minib@'uffer con @kbd{C-y} (@code{yank}).

source: Press @key{RET} to evaluate the @code{graph-body-print} expression.
es: Presiona @key{RET} para evaluar la expresi@'on @code{graph-body-print}

source: Emacs will print a graph like this:
es: Emacs imprimir@'a un grafo como este:

source: The @code{recursive-graph-body-print} Function
es: La funci@'on @code{recursive-graph-body-print}

source: The @code{graph-body-print} function may also be written recursively. The recursive solution is divided into two parts: an outside `wrapper' that uses a @code{let} expression to determine the values of several variables that need only be found once, such as the maximum height of the graph, and an inside function that is called recursively to print the graph.
es: La funci@'on @code{graph-body-print} puede tambi@'en ser escrito recursivamente. La soluci@'on recursiva es dividida dentro de dos partes: una fuera `wrapper' @emph{envoltorio} que usa una expresi@'on @code{let} para determinar los valores varias variables que solo necesitan ser encontradas una vez, tal como la m@'axima altura del grafo, y una funci@'on dentro que es llamada recursivamente para imprimir el grafo.

source: The `wrapper' is uncomplicated:
es: El `envoltorio' no es complicado:

source: (defun recursive-graph-body-print (numbers-list) "Print a bar graph of the NUMBERS-LIST. The numbers-list consists of the Y-axis values." (let ((height (apply 'max numbers-list)) (symbol-width (length graph-blank)) from-position) (recursive-graph-body-print-internal numbers-list height symbol-width)))
es: (defun recursive-graph-body-print (numbers-list) "Imprime un gr@'afico de barras del NUMBERS-LIST. El numbers-list consiste en los valores del eje Y." (let ((height (apply 'max numbers-list)) (symbol-width (length graph-blank)) from-position) (recursive-graph-body-print-internal numbers-list height symbol-width)))

source: The recursive function is a little more difficult. It has four parts: the `do-again-test', the printing code, the recursive call, and the `next-step-expression'. The `do-again-test' is a @code{when} expression that determines whether the @code{numbers-list} contains any remaining elements; if it does, the function prints one column of the graph using the printing code and calls itself again. The function calls itself again according to the value produced by the `next-step-expression' which causes the call to act on a shorter version of the @code{numbers-list}.
es: La funci@'on recursiva es un poco m@'as dif@'{@dotless{i}}cil. Eso tiene cuatro partes: el `do-again-test', el c@'odigo impreso, la llamada recursiva, y la `next-step-expression'. El `do-again-test' es una expresi@'on @code{when} determina si la @code{numbers-list} contiene cualquier elemento que permanece; si hace eso, la funci@'on imprime una columna del grafo usando el c@'odigo impreso y se llama as@'{@dotless{i}} mismo de nuevo. La funci@'on se llama as@'{@dotless{i}} misma de nuevo de acuerdo al valor producido por la `next-step-expression' que causa para llamar a actuar en una versi@'on ordenada de la @code{numbers-list}.

source: (defun recursive-graph-body-print-internal (numbers-list height symbol-width) "Print a bar graph. Used within recursive-graph-body-print function."
es: (defun recursive-graph-body-print-internal (numbers-list height symbol-width) "Imprime un gr@'afico de barras. Usado con la funci@'on recursive-graph-body-print."

source: (goto-char from-position) (forward-char symbol-width) (sit-for 0) ; @r{Draw graph column by column.} (recursive-graph-body-print-internal (cdr numbers-list) height symbol-width)))
es: (goto-char from-position) (forward-char symbol-width) (sit-for 0) ; @r{Dibuja un gr@'afico columna por columna.} (recursive-graph-body-print-internal (cdr numbers-list) height symbol-width)))

source: After installation, this expression can be tested; here is a sample:
es: Despu@'es de la siguiente instalaci@'on, esta expresi@'on puede ser chequeada; aqu@'{@dotless{i}} hay un ejemplo:

source: Here is what @code{recursive-graph-body-print} produces:
es: Aqu@'{@dotless{i}} est@'a lo que @code{recursive-graph-body-print} produce:

source: Either of these two functions, @code{graph-body-print} or @code{recursive-graph-body-print}, create the body of a graph.
es: Cada una de estas dos funciones, @code{graph-body-print} o @code{recursive-graph-body-print}, crea el cuerpo de un grafo.

source: Printed Axes
es: Ejes Impresos

source: Need for Printed Axes
es: Necesidad para ejes impresos

source: A graph needs printed axes, so you can orient yourself. For a do-once project, it may be reasonable to draw the axes by hand using Emacs's Picture mode; but a graph drawing function may be used more than once.
es: Un grafo necesita ejes impresos, as@'{@dotless{i}} se puede orientar a t@'{@dotless{i}} mismo. Para un proyecto do-once, eso puede ser razonable dibujar los ejes a mano usando el modo de emacs Picture, pero un grafo dibuja la funci@'on que puede ser usada m@'as de una vez.

source: For this reason, I have written enhancements to the basic @code{print-graph-body} function that automatically print labels for the horizontal and vertical axes. Since the label printing functions do not contain much new material, I have placed their description in an appendix. @xref{Full Graph, , A Graph with Labeled Axes}.
es: Por esta raz@'on, se han escrito mejoras a la funci@'on b@'asica @code{print-graph-body} que autom@'aticamente imprime etiquetas para los ejes horizontal y vertical. Puesto que la etiqueta de imprimir funciones no contiene mucho material nuevo, se ha emplazado su descripci@'on en un ap@'endice @xref{Grafo completo, , Un Grafo con Ejes Etiquetados}.

source: Write a line graph version of the graph printing functions.
es: Escribe una versi@'on de l@'{@dotless{i}}nea de grafo de la funciones de impresi@'on del grafo.

source: @file{.emacs} file
es: fichero @file{.emacs}

source: Customizing your @file{.emacs} file
es: Personalizando tu fichero @file{.emacs}

source: Initialization file
es: Fichero inicializaci@'on

source: ``You don't have to like Emacs to like it''---this seemingly paradoxical statement is the secret of GNU Emacs. The plain, `out of the box' Emacs is a generic tool. Most people who use it, customize it to suit themselves.
es: ``No te tiene que gustar Emacs para lo que te gusta'' --- esto que parece una frase parad@'ojica es el secreto de GNU Emacs. En realidad, Emacs es una herramienta gen@'erica. La mayor@'{@dotless{i}}a de la gente que usa Emacs, lo personaliza para ajustarlo a sus necesidades.

source: GNU Emacs is mostly written in Emacs Lisp; this means that by writing expressions in Emacs Lisp you can change or extend Emacs.
es: GNU Emacs est@'a mayoritariamente escrito en Emacs Lisp; esto significa que escribiendo expresiones en Emacs Lisp se puede modificar o extender Emacs.

source: Default Configuration
es: Configuraci@'on por defecto

source: Emacs's Default Configuration
es: Configuraci@'on por defecto de Emacs

source: There are those who appreciate Emacs's default configuration. After all, Emacs starts you in C mode when you edit a C file, starts you in Fortran mode when you edit a Fortran file, and starts you in Fundamental mode when you edit an unadorned file. This all makes sense, if you do not know who is going to use Emacs. Who knows what a person hopes to do with an unadorned file? Fundamental mode is the right default for such a file, just as C mode is the right default for editing C code. (Enough programming languages have syntaxes that enable them to share or nearly share features, so C mode is now provided by CC mode, the `C Collection'.)
es: Hay quien aprecia la configuraci@'on por defecto de Emacs. Despu@'es de todo, Emacs empieza en modo C cuando se edita un fichero C, empieza en modo Fortran cuando se edita un fichero Fortran, y empieza en modo Fundamental cuando se edita un fichero no adornado. Esto tiene sentido, si no sabes quien est@'a yendo a usar Emacs. @questiondown{}Qui@'en sabe lo que una persona espera hacer con un fichero no adornado? El modo fundamental es el modo correcto por defecto para tal fichero, tal como el modo C es lo correcto para editar c@'odigo C. (Suficientes lenguajes de programaci@'on tienen sintaxis que permiten compartir funcionalidades, tal como el modo C es ahora proporcionado por el modo CC, la `Colecci@'on C'.)

source: But when you do know who is going to use Emacs---you, yourself---then it makes sense to customize Emacs.
es: Pero cuando se conoce quien est@'a yendo a usar Emacs --- tu, tu mismo -- entonces eso tiene sentido para personalizar Emacs.

source: For example, I seldom want Fundamental mode when I edit an otherwise undistinguished file; I want Text mode. This is why I customize Emacs: so it suits me.
es: Por ejemplo, yo raramente quiero el modo Fundamental cuando edito un fichero de otro modo no distinguido; yo quiero el modo Texto. Esto es por lo que yo personalizo Emacs: as@'{@dotless{i}} eso se ajusta a m@'{@dotless{i}}.

source: You can customize and extend Emacs by writing or adapting a @file{~/.emacs} file. This is your personal initialization file; its contents, written in Emacs Lisp, tell Emacs what to do.@footnote{You may also add @file{.el} to @file{~/.emacs} and call it a @file{~/.emacs.el} file. In the past, you were forbidden to type the extra keystrokes that the name @file{~/.emacs.el} requires, but now you may. The new format is consistent with the Emacs Lisp file naming conventions; the old format saves typing.}
es: Se puede personalizar y extender Emacs escribiendo o adaptando un fichero @file{~/.emacs}. Esto es un fichero de inicializaci@'on personal; sus contenidos, escritos en Emacs Lisp, cuentan a Emacs qu@'e hacer.@footnote{Tu puedes tambi@'en a@~nadir @file{.el} para @file{~/.emacs} y llama a un fichero @file{~/.emacs}. En el pasado, fu@'e prohibido escribir los atajos de teclado extra que el nombre @file{~/.emacs.el} requiere, pero ahora puedes. El nuevo formato es consistente con las conveniciones de nombre del fichero Emacs Lisp; el viejo formato guarda la escritura.}

source: A @file{~/.emacs} file contains Emacs Lisp code. You can write this code yourself; or you can use Emacs's @code{customize} feature to write the code for you. You can combine your own expressions and auto-written Customize expressions in your @file{.emacs} file.
es: Un fichero @file{~/.emacs} contiene c@'odigo Emacs Lisp. Se puede escribir este c@'odigo por uno mismo; o se puede usar la funcionalidad @code{customize} para escribir el c@'odigo para ti. Se puede combinar tus propias expresiones y expresiones auto-escritas personalizadas en tu fichero @file{.emacs}.

source: (I myself prefer to write my own expressions, except for those, particularly fonts, that I find easier to manipulate using the @code{customize} command. I combine the two methods.)
es: (Yo prefiero por m@'{@dotless{i}} mismo escribir mis propias expresiones, excepto para estas, fuentes particularmente, que se encuentran f@'aciles de manipular usando el comando @code{customize}. Yo combino los dos m@'etodos.)

source: Most of this chapter is about writing expressions yourself. It describes a simple @file{.emacs} file; for more information, see @ref{Init File, , The Init File, emacs, The GNU Emacs Manual}, and @ref{Init File, , The Init File, elisp, The GNU Emacs Lisp Reference Manual}.
es: La mayor@'{@dotless{i}}a de este cap@'{@dotless{i}}tulo es acerca de escribir expresiones por uno mismo. Eso describe un fichero @file{.emacs} simple; para m@'as informaci@'on, mira @ref{Fichero de Inicio, , El Fichero de Inicio, emacs, El Manual GNU Emacs}, y la @ref{Fichero de Inicio, , El Fichero de Inicio, elisp, El Manual de Referencia GNU Emacs Lisp}.

source: Site-wide Initialization Files
es: Fichero de inicializaci@'on site-wide

source: @file{default.el} init file
es: fichero de inicio @file{default.el}

source: @file{site-init.el} init file
es: fichero inicio @file{site-init.el}

source: @file{site-load.el} init file
es: fichero @file{site-load.el}

source: In addition to your personal initialization file, Emacs automatically loads various site-wide initialization files, if they exist. These have the same form as your @file{.emacs} file, but are loaded by everyone.
es: Adem@'as de tu fichero de inicializaci@'on personal, Emacs autom@'aticamente carga varios ficheros de inicializaci@'on amplios, si existen. Tienen la misma forma que tu fichero @file{.emacs}, pero se cargan por cualquiera.

source: Two site-wide initialization files, @file{site-load.el} and @file{site-init.el}, are loaded into Emacs and then `dumped' if a `dumped' version of Emacs is created, as is most common. (Dumped copies of Emacs load more quickly. However, once a file is loaded and dumped, a change to it does not lead to a change in Emacs unless you load it yourself or re-dump Emacs. @xref{Building Emacs, , Building Emacs, elisp, The GNU Emacs Lisp Reference Manual}, and the @file{INSTALL} file.)
es: Dos ficheros de incializaci@'on, @file{site-load.el} y @file{site-init.el}, est@'an cargados dentro de Emacs y volcados @emph{dumped} sin una versi@'on dumped de Emacs se cre@'o, como es m@'as com@'un. (Las copias dumped de Emacs cargan m@'as r@'apidamente. Sin embargo, puesto que un fichero se carga y compila, un cambio no llega a ser un cambio en Emacs a menos que se cargue por uno mismo o se recompile Emacs. @xref{Construyendo Emacs, , Construyendo Emacs, elisp, El Manual de Referencia de GNU Emacs Lisp}, y el fichero @file{INSTALL})

source: Three other site-wide initialization files are loaded automatically each time you start Emacs, if they exist. These are @file{site-start.el}, which is loaded @emph{before} your @file{.emacs} file, and @file{default.el}, and the terminal type file, which are both loaded @emph{after} your @file{.emacs} file.
es: Los otros tres ficheros de inicializaci@'on se cargan autom@'aticamente cada vez que se inicia Emacs, si existen. Son @file{site-start.el}, que se carga @emph{antes} que tu fichero @file{.emacs}, y @file{default.el}, y el tipo de fichero terminal, que se cargan @emph{despu@'es} de tu fichero @file{.emacs}.

source: Settings and definitions in your @file{.emacs} file will overwrite conflicting settings and definitions in a @file{site-start.el} file, if it exists; but the settings and definitions in a @file{default.el} or terminal type file will overwrite those in your @file{.emacs} file. (You can prevent interference from a terminal type file by setting @code{term-file-prefix} to @code{nil}. @xref{Simple Extension, , A Simple Extension}.)
es: Las configuraciones y definiciones en tu fichero @file{.emacs} sobreescribir@'an las configuraciones en conflicto y definiciones en un fichero @file{site-start.el}, si eso existe; pero las configuraciones y definiciones en un @file{default.el} o el tipo de fichero terminal sobreescribir@'a estos en tu fichero @file{.emacs}. (Se pueden prevenir interferencias desde un tipo de fichero terminal configurando @code{term-file-prefix} para @code{nil}. @xref{Extensi@'on simple, , Una extensi@'on simple}.)

source: The @file{INSTALL} file that comes in the distribution contains descriptions of the @file{site-init.el} and @file{site-load.el} files.
es: El fichero @file{INSTALL} que viene en la distribuci@'on contiene descripciones de los fichero @file{site-init.el} y @file{site-load.el}.

source: The @file{loadup.el}, @file{startup.el}, and @file{loaddefs.el} files control loading. These files are in the @file{lisp} directory of the Emacs distribution and are worth perusing.
es: Los ficheros @file{loadup.el}, @file{startup.el}, y @file{loaddefs.el} controlan la carga. Estos ficheros est@'an en el directorio @file{lisp} de la distribuci@'on Emacs y tiene valor de uso.

source: The @file{loaddefs.el} file contains a good many suggestions as to what to put into your own @file{.emacs} file, or into a site-wide initialization file.
es: El fichero @file{loaddefs.el} contiene buenas sugerencias como las que poner dentro de tu propio fichero @file{.emacs}, o dentro de un fichero de inicializaci@'on amplio.

source: Specifying Variables using @code{defcustom}
es: Especificar variables usando @code{defcustom}

source: You can specify variables using @code{defcustom} so that you and others can then use Emacs's @code{customize} feature to set their values. (You cannot use @code{customize} to write function definitions; but you can write @code{defuns} in your @file{.emacs} file. Indeed, you can write any Lisp expression in your @file{.emacs} file.)
es: Se pueden especificar variables usando @code{defcustom} as@'{@dotless{i}} que la gente pueda usar la funcionalidad de Emacs @code{customize} para asignar sus valores. (No se puede usar @code{customize} para escribir definiciones de funci@'on; pero se pueden escribir @code{defuns} en tu fichero @file{.emacs}. En vez de eso, se puede escribir cualquier expresi@'on Lisp en tu fichero @file{.emacs}).

source: The @code{customize} feature depends on the @code{defcustom} special form. Although you can use @code{defvar} or @code{setq} for variables that users set, the @code{defcustom} special form is designed for the job.
es: La funcionalidad @code{customize} depende de la forma especial @code{defcustom}. Aunque se puede usar @code{defvar} o @code{setq} para las variables que los usuarios asignan, la forma especial @code{defcustom} est@'a dise@~nada para el trabajo.
