Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: This is the bug.
es: Este es el error.

source: Press @kbd{q} to quit Edebug.
es: Presiona @kbd{q} para salir de Edebug.

source: To remove instrumentation from a function definition, simply re-evaluate it with a command that does not instrument it. For example, you could place your cursor after the definition's closing parenthesis and type @kbd{C-x C-e}.
es: Para eliminar la instrumentaci@'on desde una definici@'on de funci@'on, simplemente se reeval@'ua con un comando que no lo instrumente. Por ejemplo, se podr@'{@dotless{i}}a posicionar su cursor despu@'es de la definici@'on cerrando par@'entesis y escribiendo @kbd{C-x C-e}.

source: Edebug does a great deal more than walk with you through a function. You can set it so it races through on its own, stopping only at an error or at specified stopping points; you can cause it to display the changing values of various expressions; you can find out how many times a function is called, and more.
es: Edebug hace un gran trato antes de entrar en una funci@'on. Se puede dirigir as@'{@dotless{i}} mismo, parando solo en un error o en puntos espec@'{@dotless{i}}ficos, se puede causar para mostrar los valores cambiantes de varias expresiones; se puede encontrar cuantas veces una funci@'on se llama, y m@'as.

source: Install the @code{@value{COUNT-WORDS}} function and then cause it to enter the built-in debugger when you call it. Run the command on a region containing two words. You will need to press @kbd{d} a remarkable number of times. On your system, is a `hook' called after the command finishes? (For information on hooks, see @ref{Command Overview, , Command Loop Overview, elisp, The GNU Emacs Lisp Reference Manual}.)
es: Instale la funci@'on @code{@value{COUNT-WORDS}} y provoque que se introduzca el depurador construido cuando se llame. Ejecute el comando en una regi@'on conteniendo dos palabras. Se necesitar@'a presionar @kbd{d} un n@'umero remarcable de veces. En el sistema, es un `hook' llamado despu@'es que el comando se finaliza. (Para informaci@'on sobre hooks, mira @ref{Resumen de Comandos, , Resumen del Comando Bucle, elisp, El Manual de Referencia GNU Emacs Lisp}.)

source: Copy @code{@value{COUNT-WORDS}} into the @file{*scratch*} buffer, instrument the function for Edebug, and walk through its execution. The function does not need to have a bug, although you can introduce one if you wish. If the function lacks a bug, the walk-through completes without problems.
es: Copie @code{@value{COUNT-WORDS}} dentro del b@'uffer @file{*scratch*}, instrumente la funci@'on para Edebug, y navegue a trav@'es de su ejecuci@'on. La funci@'on no necesita tener un error, aunque se puede introducir uno si se desea. Si a la funci@'on le falta un error, el paseo se completa sin problemas.

source: While running Edebug, type @kbd{?} to see a list of all the Edebug commands. (The @code{global-edebug-prefix} is usually @kbd{C-x X}, i.e., @kbd{@key{CTRL}-x} followed by an upper case @kbd{X}; use this prefix for commands made outside of the Edebug debugging buffer.)
es: Mientras se ejecuta Edebug, escriba @kbd{?} para ver una lista de todos los comandos Edebug. (El @code{global-edebug-prefix} normalmente es @kbd{C-x X}, por ej@: @kbd{@key{CTRL}-x} seguido por una tecla may@'uscula @kbd{X}; use este prefijo para comandos hechos fuera del b@'uffer de depuraci@'on Edebug.)

source: In the Edebug debugging buffer, use the @kbd{p} (@code{edebug-bounce-point}) command to see where in the region the @code{@value{COUNT-WORDS}} is working.
es: En el b@'uffer de depuraci@'on Edebug, usa el comando @kbd{p} (@code{edebug-bounce-point}) para ver si @code{@value{COUNT-WORDS}} est@'a funcionando.

source: Move point to some spot further down the function and then type the @kbd{h} (@code{edebug-goto-here}) command to jump to that location.
es: Mueve el punto a alg@'un sitio debajo de la funci@'on y entonces escribe el comando @kbd{h} (@code{edebug-goto-here}) para saltar a esta localizaci@'on.

source: Use the @kbd{t} (@code{edebug-trace-mode}) command to cause Edebug to walk through the function on its own; use an upper case @kbd{T} for @code{edebug-Trace-fast-mode}.
es: Usa el comando @kbd{t} (@code{edebug-trace-mode}) para causar que Edebug pasee a trav@'es de la funci@'on en s@'{@dotless{i}}; usa una letra may@'uscula @kbd{T} para @code{edebug-Trace-fast-mode}.

source: Set a breakpoint, then run Edebug in Trace mode until it reaches the stopping point.
es: Asigna un punto de ruptura, entonces ejecuta Edebug en modo Traza hasta que se logre el punto de parada.

source: We have now reached the end of this Introduction. You have now learned enough about programming in Emacs Lisp to set values, to write simple @file{.emacs} files for yourself and your friends, and write simple customizations and extensions to Emacs.
es: Ahora se ha llegado al fin de esta Introducci@'on. Se ha aprendido lo suficiente acerca de programaci@'on en Emacs Lisp para asignar valores, para escribir ficheros @file{.emacs} para t@'{@dotless{i}} mismo y tus amigos, y escribir personalizaciones simples y extensiones a Emacs.

source: This is a place to stop. Or, if you wish, you can now go onward, and teach yourself.
es: Este es un lugar para parar. O, si se desea, se puede ir adelante, y aprender m@'as por uno mismo.

source: You have learned some of the basic nuts and bolts of programming. But only some. There are a great many more brackets and hinges that are easy to use that we have not touched.
es: Se han aprendido algunas bases de programaci@'on. Pero solo algunas. Todav@'{@dotless{i}}a hay muchas cosas que son f@'aciles de usar que no se han tocado.

source: A path you can follow right now lies among the sources to GNU Emacs and in
es: Otra idea para seguir es leer las fuentes de Emacs o

source: The Emacs Lisp sources are an adventure. When you read the sources and come across a function or expression that is unfamiliar, you need to figure out or find out what it does.
es: Las fuentes de Emacs Lisp son una aventura. Cuando se leen las fuentes vienen a trav@'es de una funci@'on o expresi@'on que nos es familiar, se necesita imaginar o encontrar qu@'e se hace.

source: Go to the Reference Manual. It is a thorough, complete, and fairly easy-to-read description of Emacs Lisp. It is written not only for experts, but for people who know what you know. (The @cite{Reference Manual} comes with the standard GNU Emacs distribution. Like this introduction, it comes as a Texinfo source file, so you can read it on-line and as a typeset, printed book.)
es: Ir al Manual de Referencia. Eso est@'a a trav@'es del completo, limpio y f@'acil de leer descripci@'on de Emacs Lisp. Est@'a escrito no solo para expertos, pero s@'{@dotless{i}} para gente que conoce lo que usted conoce. (El @cite{Manual de Referencia} viene con la distribuci@'on de GNU Emacs. Como esta introducci@'on, viene como un fichero fuente Texinfo, as@'{@dotless{i}} se puede leer on-line como un libro impreso.)

source: Go to the other on-line help that is part of GNU Emacs: the on-line documentation for all functions and variables, and @code{find-tag}, the program that takes you to sources.
es: Ir a otra ayuda on-line que sea parte de GNU Emacs: la documentaci@'on on-line para todas las funciones y variables, y @code{find-tag}, el programa que va a las fuentes.

source: Here is an example of how I explore the sources. Because of its name, @file{simple.el} is the file I looked at first, a long time ago. As it happens some of the functions in @file{simple.el} are complicated, or at least look complicated at first sight. The @code{open-line} function, for example, looks complicated.
es: Aqu@'{@dotless{i}} hay un ejemplo de c@'omo explorar las fuentes. Porque su nombre, @file{simple.el} es el fichero que se vi@'o primero, hace tiempo. Como eso ocurre alguna de las funciones en @file{simple.el} son complicadas, o al menos parece complicado a primera vista. La funci@'on @code{open-line}, por ejemplo, parece complicada.

source: You may want to walk through this function slowly, as we did with the @code{forward-sentence} function. (@xref{forward-sentence, The @code{forward-sentence} function}.) Or you may want to skip that function and look at another, such as @code{split-line}. You don't need to read all the functions. According to @code{count-words-in-defun}, the @code{split-line} function contains 102 words and symbols.
es: Se puede querer pasear a trav@'es de esta funci@'on lentamente, como nosotros hicimos la funci@'on @code{forward-sentence}. (@xref{forward-sentence, La funci@'on @code{forward-sentence}}.) O se puede querer salir de esta funci@'on y mirar en otra, tal como @code{split-line}. No se necesita leer todas las funciones. De acuerdo a @code{count-words-in-defun}, la funci@'on @code{split-line} contiene 102 palabras y s@'{@dotless{i}}mbolos.

source: Even though it is short, @code{split-line} contains expressions we have not studied: @code{skip-chars-forward}, @code{indent-to}, @code{current-column} and @code{insert-and-inherit}.
es: Incluso aunque sean pocas, @code{split-line} contiene expresiones que no se han estudiado: @code{skip-chars-forward}, @code{indent-to}, @code{current-column} y @code{insert-and-inherit}.

source: Consider the @code{skip-chars-forward} function. (It is part of the function definition for @code{back-to-indentation}, which is shown in @ref{Review, , Review}.)
es: Considera la funci@'on @code{skip-chars-forward}. (Eso es parte de la definici@'on de funci@'on para @code{back-to-indentation}, que muestra la @ref{Revisar, , Revisar}.)

source: In GNU Emacs, you can find out more about @code{skip-chars-forward} by typing @kbd{C-h f} (@code{describe-function}) and the name of the function. This gives you the function documentation.
es: En GNU Emacs, se puede encontrar m@'as acerca de @code{skip-chars-forward} escribiendo @kbd{C-h f} (@code{describe-function}) y el nombre de la funci@'on. Esto te da la documentaci@'on de funci@'on.

source: You may be able to guess what is done by a well named function such as @code{indent-to}; or you can look it up, too. Incidentally, the @code{describe-function} function itself is in @file{help.el}; it is one of those long, but decipherable functions. You can look up @code{describe-function} using the @kbd{C-h f} command!
es: Se puede ser capaz de adivinar que se hace por una funci@'on bien llamada tal como @code{indent-to}; o se puede buscar, tambi@'en. Incidentalmente, la funci@'on @code{describe-function} en s@'{@dotless{i}} est@'a en @file{help.el}; esta es una de estas largas, pero descifrables funciones. @exclamdown{}Se puede buscar @code{describe-function} usando el comando @kbd{C-h f}!

source: In this instance, since the code is Lisp, the @file{*Help*} buffer contains the name of the library containing the function's source. You can put point over the name of the library and press the RET key, which in this situation is bound to @code{help-follow}, and be taken directly to the source, in the same way as @kbd{M-.} (@code{find-tag}).
es: En esta instancia, desde el c@'odigo es Lisp, el b@'uffer @file{*Help*} contiene el nombre de la librer@'{@dotless{i}}a conteniendo las fuentes de la funci@'on. Se puede poner el punto a trav@'es del nombre de la librer@'{@dotless{i}}a y presiona la tecla RET, que est@'a en esta situaci@'on est@'a asociado a @code{help-follow}, y se toma directamente de las fuentes, en el mismo camino que @kbd{M-.} (@code{find-tag}).

source: The definition for @code{describe-function} illustrates how to customize the @code{interactive} expression without using the standard character codes; and it shows how to create a temporary buffer.
es: La definici@'on para @code{describe-function} ilustra como personalizar las expresiones @code{interactive} sin usar los c@'odigos de caracter est@'andar y eso muestra como crear un b@'uffer temporal.

source: (The @code{indent-to} function is written in C rather than Emacs Lisp; it is a `built-in' function. @code{help-follow} takes you to its source as does @code{find-tag}, when properly set up.)
es: (La funci@'on @code{indent-to} es escrita en C en vez de Emacs Lisp; eso es una funci@'on `construida'. @code{help-follow} toma su fuente como @code{find-tag}, cuando se configura apropiadamente.)

source: You can look at a function's source using @code{find-tag}, which is bound to @kbd{M-.} Finally, you can find out what the Reference Manual has to say by visiting the manual in Info, and typing @kbd{i} (@code{Info-index}) and the name of the function, or by looking up the function in the index to a printed copy of the manual.
es: Se puede mirar en las fuentes de la funci@'on usando @code{find-tag}, que est@'a asociado a @kbd{M-.}. Finalmente, se puede encontrar que el Manual de Referencia tiene que decir visitando el manual en Info, y escribiendo @kbd{i} (@code{Info-index}) y el nombre de la funci@'on, o buscando la funci@'on en el @'{@dotless{i}}ndice a una copia impresa del manual.

source: Similarly, you can find out what is meant by @code{insert-and-inherit}.
es: Similarmente, se puede encontrar que significa por @code{insert-and-inherit}.

source: Other interesting source files include @file{paragraphs.el}, @file{loaddefs.el}, and @file{loadup.el}. The @file{paragraphs.el} file includes short, easily understood functions as well as longer ones. The @file{loaddefs.el} file contains the many standard autoloads and many keymaps. I have never looked at it all; only at parts. @file{loadup.el} is the file that loads the standard parts of Emacs; it tells you a great deal about how Emacs is built. (@xref{Building Emacs, , Building Emacs, elisp, The GNU Emacs Lisp Reference Manual}, for more about building.)
es: Otros ficheros fuente interesantes incluyen @file{paragraphs.el}, @file{loaddefs.el} y @file{loadup.el}. El fichero @file{paragraphs.el} incluye ordenar, funciones f@'acilmente comprendidas tan bien como las largas. El fichero @file{loaddefs.el} contiene muchos autoloads est@'andar y muchos mapas de teclado. Nunca se ha buscado en todo; solo en las partes. @file{loadup.el} es el fichero que carga las partes est@'andar de Emacs; eso cuenta un gran trato acerca de c@'omo Emacs est@'a construido. (@xref{Construyendo Emacs, , Construyendo Emacs, elisp, El Manual de Referencia GNU Emacs Lisp}, para m@'as acerca de construcci@'on.)

source: As I said, you have learned some nuts and bolts; however, and very importantly, we have hardly touched major aspects of programming; I have said nothing about how to sort information, except to use the predefined @code{sort} function; I have said nothing about how to store information, except to use variables and lists; I have said nothing about how to write programs that write programs. These are topics for another, and different kind of book, a different kind of learning.
es: Como dije, se han aprendido algunas cosas; sin embargo, y de manera muy importante, se han tocado fuertes aspectos de la programaci@'on; no se ha dicho nada acerca de como ordenar la informaci@'on, excepto para usar la funci@'on predefinida @code{sort}; no se ha dicho nada acerca de c@'omo almacenar la informaci@'on, excepto para usar variables y listas; no se ha dicho nada acerca de como escribir programas que escriben programas. Esto son asuntos para otro tipo diferente de libro, un diferente tipo de aprendizaje.

source: What you have done is learn enough for much practical work with GNU Emacs. What you have done is get started. This is the end of a beginning.
es: Lo que se ha hecho es aprender lo suficiente para hacer mucho trabajo pr@'actico con GNU Emacs. Lo que se ha hecho es comenzar. Este es el fin del principio de una gran amistad.

source: The @code{the-the} Function
es: La funci@'on @code{the-the}

source: Duplicated words function
es: Funci@'on de palabras duplicadas

source: Words, duplicated
es: Palabras, duplicadas

source: Sometimes when you you write text, you duplicate words---as with ``you you'' near the beginning of this sentence. I find that most frequently, I duplicate ``the''; hence, I call the function for detecting duplicated words, @code{the-the}.
es: Algunas veces cuando se se escribe texto, se duplican palabras --- como con ``se se'' cerca del principio de esta frase. Se encuentra que lo m@'as frecuente, es duplicar ``el''; aqu@'{@dotless{i}}, se llama a la funci@'on para detectar las palabras duplicadas, @code{the-the}.

source: As a first step, you could use the following regular expression to search for duplicates:
es: Como primer paso, se podr@'{@dotless{i}}an usar las siguientes expresiones regulares para buscar duplicados:

source: This regexp matches one or more word-constituent characters followed by one or more spaces, tabs, or newlines. However, it does not detect duplicated words on different lines, since the ending of the first word, the end of the line, is different from the ending of the second word, a space. (For more information about regular expressions, see @ref{Regexp Search, , Regular Expression Searches}, as well as @ref{Regexps, , Syntax of Regular Expressions, emacs, The GNU Emacs Manual}, and @ref{Regular Expressions, , Regular Expressions, elisp, The GNU Emacs Lisp Reference Manual}.)
es: Este regexp asocia uno o m@'as caracteres que constituyen palabras seguidas por uno o m@'as espacios, tabuladores, o nuevas l@'{@dotless{i}}neas. Sin embargo, eso no detecta palabras duplicadas en diferentes l@'{@dotless{i}}neas, desde la finalizaci@'on de la primera palabra, el fin de la l@'{@dotless{i}}nea, es diferente desde el fin de la segunda palabra, un espacio. (Para m@'as informaci@'on acerca de expresiones regulares, mira el @ref{Buscar regexp, , B@'usquedas de Expresiones Regulares}, tan bien como la @ref{Regexps, , Sintaxis de Expresiones Regulares, emacs, El Manual de GNU Emacs}, y la @ref{Expresiones Regulares, , Expresiones Regulares, elisp, El Manual de Referencia GNU Emacs Lisp}.)

source: You might try searching just for duplicated word-constituent characters but that does not work since the pattern detects doubles such as the two occurrences of `th' in `with the'.
es: Se podr@'{@dotless{i}}an intentar buscar caracteres duplicados pero no si el patr@'on detecta dobles tales como las dos ocurrencias de `th' en `with the'.

source: Another possible regexp searches for word-constituent characters followed by non-word-constituent characters, reduplicated. Here, @w{@samp{\\w+}} matches one or more word-constituent characters and @w{@samp{\\W*}} matches zero or more non-word-constituent characters.
es: Otro posible regexp busca caracteres constituyentes de palabras seguidos por caracteres de no palabras constituyentes, reduplicadas. Aqu@'{@dotless{i}}, @w{@samp{\\w+}} asocia a una o m@'as caracteres de palabras constituyente y @w{@samp{\\W*}} asocia cero o m@'as caracteres que no constituyen palabras.

source: Again, not useful.
es: De nuevo, no @'util.

source: Here is the pattern that I use. It is not perfect, but good enough. @w{@samp{\\b}} matches the empty string, provided it is at the beginning or end of a word; @w{@samp{[^@@ \n\t]+}} matches one or more occurrences of any characters that are @emph{not} an @@-sign, space, newline, or tab.
es: Aqu@'{@dotless{i}} est@'a el patr@'on que uso. No es perfecto, pero suficientemente bueno. @w{@samp{\\b}} asocia la cadena vac@'{@dotless{i}}a provista al principio o fin de una palabra; @w{@samp{[^@@ \n\t]+}} asocia una o m@'as ocurrencias de qu@'e caracteres que @emph{no} son un @@-signo, espacio, nueva l@'{@dotless{i}}nea, o tabulador.

source: One can write more complicated expressions, but I found that this expression is good enough, so I use it.
es: Uno puede escribir expresiones m@'as complicadas, pero esta expresi@'on es suficientemente buena as@'{@dotless{i}}.

source: Here is the @code{the-the} function, as I include it in my @file{.emacs} file, along with a handy global key binding:
es: Aqu@'{@dotless{i}} est@'a la funci@'on @code{the-the}, como se incluye en mi fichero @file{.emacs}, a lo largo de un atajo global manejable:

source: (defun the-the () "Search forward for for a duplicated word." (interactive) (message "Searching for for duplicated words ...") (push-mark)
es: (defun the-the () "Busca hacia adelante para una palabra duplicada." (interactive) (message "Buscando palabras duplicadas ...") (push-mark)

source: ;; This regexp is not perfect ;; but is fairly good over all: (if (re-search-forward "\\b\\([^@@ \n\t]+\\)[ \n\t]+\\1\\b" nil 'move) (message "Found duplicated word.") (message "End of buffer")))
es: ;; Este regexp no es perfecto ;; pero es limpiamente bueno a pesar de todo: (if (re-search-forward "\\b\\([^@@ \n\t]+\\)[ \n\t]+\\1\\b" nil 'move) (message "Palabra encontrada duplicada.") (message "Fin de b@'uffer")))

source: ;; Bind `the-the' to C-c \ (global-set-key "\C-c\\" 'the-the)
es: ;; Asocia `the-the' a C-c \ (global-set-key "\C-c\\" 'the-the)

source: Here is test text:
es: Aqu@'{@dotless{i}} est@'a el test del texto:

source: one two two three four five five six seven
es: uno dos tres cuatro cinco cinco seis siete

source: You can substitute the other regular expressions shown above in the function definition and try each of them on this list.
es: Se pueden sustituir las otras expresiones regulares mostradas debajo en la definici@'on de funci@'on y se prueba cada una de ellas en esta lista.

source: Kill ring handling
es: Manejando el anillo de la muerte

source: Handling the kill ring
es: Manejando el anillo de la muerte

source: Ring, making a list like a
es: Anillo, creando un lista como un

source: The kill ring is a list that is transformed into a ring by the workings of the @code{current-kill} function. The @code{yank} and @code{yank-pop} commands use the @code{current-kill} function.
es: El anillo de la muerte es una lista que es transformada dentro de un anillo que trabaja con la funci@'on @code{current-kill}. Los comandos @code{yank} y @code{yank-pop} usan la funci@'on @code{current-kill}.

source: This appendix describes the @code{current-kill} function as well as both the @code{yank} and the @code{yank-pop} commands, but first, consider the workings of the kill ring.
es: Este ap@'endice describe la funci@'on @code{current-kill} y los comandos @code{yank} y @code{yank-pop}, pero primero, considere los trabajo del kill ring.

source: What the Kill Ring Does
es: Qu@'e hace el anillo de la muerte

source: The kill ring has a default maximum length of sixty items; this number is too large for an explanation. Instead, set it to four. Please evaluate the following:
es: El anillo de la muerte @emph{kill ring} tiene el tama@~no m@'aximo de sesenta elementos; hacer una explicaci@'on con este n@'umero m@'aximo quedar@'{@dotless{i}}a demasiado larga. En vez de eso, pensemos qu@'e ocurre si se as@'{@dotless{i}}gna a cuatro. Por favor, eval@'ue lo siguiente:

source: Then, please copy each line of the following indented example into the kill ring. You may kill each line with @kbd{C-k} or mark it and copy it with @kbd{M-w}.
es: Entonces, por favor, copie cada l@'{@dotless{i}}nea del siguiente ejemplo indentado dentro del anillo de la muerte @emph{kill ring}. Se puede cortar cada l@'{@dotless{i}}nea con @kbd{C-k} o marcarla y copiarla con @kbd{M-w}.
