Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The @code{if} special form is called a @dfn{conditional}. There are other conditionals in Emacs Lisp, but @code{if} is perhaps the most commonly used.
es: La forma especial @code{if} es llamada @dfn{condicional}. Hay otros condicionales en Emacs Lisp, pero @code{if} es quiz@'as lo m@'as com@'unmente usado.

source: (if (= 22 emacs-major-version) (message "This is version 22 Emacs") (message "This is not version 22 Emacs"))
es: (if (= 22 version-de-emacs-mayor) (message "Esta es la versi@'on 22 de Emacs") (message "Esta no es la versi@'on 22 Emacs"))

source: The @code{<} function tests whether its first argument is smaller than its second argument. A corresponding function, @code{>}, tests whether the first argument is greater than the second. Likewise, @code{<=} tests whether the first argument is less than or equal to the second and @code{>=} tests whether the first argument is greater than or equal to the second. In all cases, both arguments must be numbers or markers (markers indicate positions in buffers).
es: La funci@'on @code{<} chequea si su primer argumento es m@'as peque@~no que su segundo argumento. Una funci@'on correspondiente, @code{>}, chequea si el primer argumento es mayor que el segundo. De otro modo, @code{<=} chequea si el primer argumento es menor o igual al segundo y @code{>=} chequea si el primer argumento es mayor o igual al segundo. En todos los casos, ambos argumentos deben ser n@'umeros o marcas (las marcas indican posiciones en b@'uffers).

source: The @code{=} function tests whether two arguments, both numbers or markers, are equal.
es: La funci@'on @code{=} chequea si dos argumentos, ambos n@'umeros o marcadores, son iguales.

source: Test whether two objects are the same. @code{equal} uses one meaning of the word `same' and @code{eq} uses another: @code{equal} returns true if the two objects have a similar structure and contents, such as two copies of the same book. On the other hand, @code{eq}, returns true if both arguments are actually the same object.
es: Chequea si dos objetos son el mismo. @code{equal} usa un signicado de la palabra `mismo' y @code{eq} usa otro: @code{equal} devuelve cierto si los dos objetos tienen una estructura y contenidos similares, tal como dos copias del mismo libro. En una mano, @code{eq}, devuelve cierto si ambos argumentos son actualmente el mismo objeto.

source: The @code{string-lessp} function tests whether its first argument is smaller than the second argument. A shorter, alternative name for the same function (a @code{defalias}) is @code{string<}.
es: La funci@'on @code{string-lessp} chequea si su primer argumento es m@'as peque@~no que el segundo. En resumen, el nombre alternativo para la misma funci@'on (un @code{defalias}) es @code{string}.

source: The arguments to @code{string-lessp} must be strings or symbols; the ordering is lexicographic, so case is significant. The print names of symbols are used instead of the symbols themselves.
es: Los argumentos para @code{string-lessp} deben ser cadenas o s@'{@dotless{i}}mbolos; la ordenaci@'on es lexicogr@'afica, as@'{@dotless{i}} el caso es significativo. Los nombres impresos de s@'{@dotless{i}}mbolos son usado en vez de s@'{@dotless{i}}mbolos por s@'{@dotless{i}} mismos.

source: @samp{empty string} defined
es: @samp{cadena vac@'{@dotless{i}}a} definida

source: An empty string, @samp{""}, a string with no characters in it, is smaller than any string of characters.
es: Una cadena vac@'{@dotless{i}}a, @samp{"\"}, es una cadena sin caracteres dentro, es m@'as peque@~na que cualquier cadena de caracteres.

source: @code{string-equal} provides the corresponding test for equality. Its shorter, alternative name is @code{string=}. There are no string test functions that correspond to @var{>}, @code{>=}, or @code{<=}.
es: @code{string-equal} provee el test correpondiente para igualdad. Su corto nombre alternativo es @code{string=}. No hay funciones test que correponden a @var{>}, @code{>=}.

source: Print a message in the echo area. The first argument is a string that can contain @samp{%s}, @samp{%d}, or @samp{%c} to print the value of arguments that follow the string. The argument used by @samp{%s} must be a string or a symbol; the argument used by @samp{%d} must be a number. The argument used by @samp{%c} must be an @sc{ascii} code number; it will be printed as the character with that @sc{ascii} code. (Various other %-sequences have not been mentioned.)
es: Imprime un mensaje en el @'area echo. El primer argumento es una cadena que puede contener, @samp{%s}, @samp{%d}, o @samp{%c} para imprimir el valor de argumentos que siguen la cadena. El argumento usado por @samp{%d} debe ser un n@'umero. El argumento usado por @samp{%c} debe ser un n@'umero de c@'odigo @sc{ascii}; eso ser@'a impreso como el caracter con este c@'odigo @sc{ascii}. (Otras varias %-secuencias no han sido mencionadas.)

source: The @code{setq} function sets the value of its first argument to the value of the second argument. The first argument is automatically quoted by @code{setq}. It does the same for succeeding pairs of arguments. Another function, @code{set}, takes only two arguments and evaluates both of them before setting the value returned by its first argument to the value returned by its second argument.
es: La funci@'on @code{setq} asigna el valor de su primer argumento al valor del segundo argumento. El primer argumento est@'a autom@'aticamente citado por @code{setq}. Eso hace lo mismo para los pares de argumentos. Otra funci@'on, @code{set}, toma solo dos argumentos y eval@'ua ambos de ellos antes de configurar el valor devuelto por su primer argumento al valor devuelto por su segundo argumento.

source: Without an argument, return the name of the buffer, as a string.
es: Sin un argumento, devuelve el nombre del b@'uffer, como una cadena.

source: Without an argument, return the name of the file the buffer is visiting.
es: Sin un argumento, devuelve el nombre del fichero si el b@'uffer lo est@'a visitando.

source: Return the buffer in which Emacs is active; it may not be the buffer that is visible on the screen.
es: Devuelve el b@'uffer en el que Emacs es activo; eso puede no ser el b@'uffer que es visible en la pantalla.

source: Return the most recently selected buffer (other than the buffer passed to @code{other-buffer} as an argument and other than the current buffer).
es: Devuelve el b@'uffer seleccionado m@'as recientemente (otro que el b@'uffer pasado a @code{other-buffer} como un argumento y otro en vez de el b@'uffer actual).

source: Select a buffer for Emacs to be active in and display it in the current window so users can look at it. Usually bound to @kbd{C-x b}.
es: Selecciona un b@'uffer para que Emacs est@'e activo y lo muestre en la ventana actual y as@'{@dotless{i}} los usuarios puedan mirarlo. Normalmente se empareja a @kbd{C-x b}.

source: Switch Emacs's attention to a buffer on which programs will run. Don't alter what the window is showing.
es: Cambia la atenci@'on de Emacs a un b@'uffer en el que los programas se ejecutar@'an. No altera lo que la ventana est@'a mostrando.

source: Return the number of characters in the current buffer.
es: Devuelve el n@'umero de caracteres en el b@'uffer actual.

source: Return the value of the current position of the cursor, as an integer counting the number of characters from the beginning of the buffer.
es: Devuelve el valor de la actual posici@'on del cursor, como un entero contando el n@'umero de caracteres desde el principio del b@'uffer.

source: Return the minimum permissible value of point in the current buffer. This is 1, unless narrowing is in effect.
es: Devuelve el valor m@'{@dotless{i}}nimo permisible del punto en el b@'uffer actual. Esto es 1, a menos que la contracci@'on est@'e en efecto

source: Return the value of the maximum permissible value of point in the current buffer. This is the end of the buffer, unless narrowing is in effect.
es: Devuelve el valor del m@'aximo valor permisible del punto en el b@'uffer actual. Esto es el fin del b@'uffer, a menos que la contracci@'on est@'e en efecto

source: Write a non-interactive function that doubles the value of its argument, a number. Make that function interactive.
es: Escribe una funci@'on no interactiva que doble el valor de su argumento, un n@'umero. Luego haz la funci@'on interactiva.

source: Write a function that tests whether the current value of @code{fill-column} is greater than the argument passed to the function, and if so, prints an appropriate message.
es: Escribe una funci@'on que chequee si el valor actual de @code{fill-column} es m@'as grande que el argumento pasado a la funci@'on, y si es as@'{@dotless{i}}, imprime un mensaje apropiado.

source: In this chapter we study in detail several of the functions used in GNU Emacs. This is called a ``walk-through''. These functions are used as examples of Lisp code, but are not imaginary examples; with the exception of the first, simplified function definition, these functions show the actual code used in GNU Emacs. You can learn a great deal from these definitions. The functions described here are all related to buffers. Later, we will study other functions.
es: En este cap@'{@dotless{i}}tulo estudiamos en detalle varias de las funciones usadas en GNU Emacs. Esto se llama un ``paseo a trav@'es''. Estas funciones son usadas como ejemplos de c@'odigo Lisp, pero no son ejemplos imaginarios; con la excepci@'on del primero, la definici@'on de funci@'on simplificada, esta funciones muestran el actual c@'odigo usado en GNU Emacs. Se puede aprender mucho desde estas definiciones. Las funciones descritas aqu@'{@dotless{i}} est@'an todas relacionadas a b@'uffers. Despu@'es, estudiaremos otras funciones.

source: Finding More Information
es: Encontrando m@'as informaci@'on

source: describe-function, @r{introduced}
es: describe-function, @r{introducido}

source: Find function documentation
es: Encontrar documentaci@'on de la funci@'on

source: In this walk-through, I will describe each new function as we come to it, sometimes in detail and sometimes briefly. If you are interested, you can get the full documentation of any Emacs Lisp function at any time by typing @kbd{C-h f} and then the name of the function (and then @key{RET}). Similarly, you can get the full documentation for a variable by typing @kbd{C-h v} and then the name of the variable (and then @key{RET}).
es: En este paseo, se describe cada nueva funci@'on como viene, algunas veces en detalle y algunas veces brevemente. Si est@'a interesado, se puede obtener la documentaci@'on completa de cualquier funci@'on Emacs Lisp en cualquier momento escribiendo @kbd{C-h f} y entonces el nombre de la funci@'on (y entonces @key{RET}. De manera similar, se puede obtener la documentaci@'on completa para una variable escribiendo @kbd{C-h v}, despu@'es el nombre de la variable (y entonces @key{RET}).

source: Find source of function
es: Encontrar la fuente de la funci@'on

source: Also, @code{describe-function} will tell you the location of the function definition.
es: Tambi@'en, en @code{describe-function}, se encontrar@'a la localizaci@'on de la definici@'on de la funci@'on.

source: Put point into the name of the file that contains the function and press the @key{RET} key. In this case, @key{RET} means @code{push-button} rather than `return' or `enter'. Emacs will take you directly to the function definition.
es: Poner el punto dentro del nombre del fichero que contiene la funci@'on y presiona la tecla @key{RET}. En este caso, @key{RET} significa @code{push-button} en vez de `return' o `enter'. Emacs tomar@'a directamente a la definici@'on de la funci@'on.

source: More generally, if you want to see a function in its original source file, you can use the @code{find-tag} function to jump to it. @code{find-tag} works with a wide variety of languages, not just Lisp, and C, and it works with non-programming text as well. For example, @code{find-tag} will jump to the various nodes in the Texinfo source file of this document. The @code{find-tag} function depends on `tags tables' that record the locations of the functions, variables, and other items to which @code{find-tag} jumps.
es: De manera m@'as general, si quieres ver una funci@'on en su fichero fuente original, se puede usar la funci@'on @code{find-tag} para saltar dentro. @code{find-tag} funciona con una amplia variedad de lenguajes, no solo Lisp, y C, y funciona con texto de no programaci@'on tambi@'en. Por ejemplo, @code{find-tag} saltar@'a a los varios nodos en el fichero fuente Texinfo de este documento. La funci@'on @code{find-tag} depende de `tablas de etiquetas' que graba las localizaciones de las funciones, variables, y otros @'{@dotless{i}}tems para los que @code{find-tag} salta.

source: To use the @code{find-tag} command, type @kbd{M-.} (i.e., press the period key while holding down the @key{META} key, or else type the @key{ESC} key and then type the period key), and then, at the prompt, type in the name of the function whose source code you want to see, such as @code{mark-whole-buffer}, and then type @key{RET}. Emacs will switch buffers and display the source code for the function on your screen. To switch back to your current buffer, type @kbd{C-x b @key{RET}}. (On some keyboards, the @key{META} key is labeled @key{ALT}.)
es: Para usar el comando @code{find-tag}, escribe @kbd{M-.} (por ej., presionando la tecla @key{META}, o al menos escribe la tecla @key{ESC} y entonces escribe la tecla punto), entonces, en la pantalla, se escribe el nombre de la funci@'on cuyo c@'odigo fuente se quiere ver, tal como @code{mark-whole-buffer}, y luego escribe @key{RET}. Emacs cambiar@'a el b@'uffer y mostrar@'a el c@'odigo fuente para la funci@'on en la pantalla. Para volver al b@'uffer actual, escribe @kbd{C-x b @key{RET}}. (En algunos teclados, la tecla @key{META} es etiquetada con @key{ALT}.)

source: TAGS table, specifying
es: tabla TAGS, especificando

source: Depending on how the initial default values of your copy of Emacs are set, you may also need to specify the location of your `tags table', which is a file called @file{TAGS}. For example, if you are interested in Emacs sources, the tags table you will most likely want, if it has already been created for you, will be in a subdirectory of the @file{/usr/local/share/emacs/} directory; thus you would use the @code{M-x visit-tags-table} command and specify a pathname such as @file{/usr/local/share/emacs/22.1.1/lisp/TAGS}. If the tags table has not already been created, you will have to create it yourself. It will be in a file such as @file{/usr/local/src/emacs/src/TAGS}.
es: Dependiendo de c@'omo los valores iniciales por defecto de tu copia de Emacs son asignados se puede tambi@'en necesitar especificar la posici@'on de tu `tabla de tags', que es un fichero llamado @file{TAGS}. Por ejemplo, si se est@'a interesado en fuentes de Emacs, la tabla de tags que se desea, si ya ha sido creada para t@'{@dotless{i}}, estar@'a en un subdirectorio del directorio @file{/usr/local/share/emacs}; de este modo se usar@'{@dotless{i}}a el comando @code{M-x visit-tags-table} y especifica una ruta tal como @file{/usr/local/share/emacs/22.1.1/lisp/TAGS}. Si la tabla tags no ha sido creada, tendr@'as que crearla por t@'{@dotless{i}} mismo. Ser@'a un fichero tal como @file{/usr/local/src/emacs/src/TAGS}.

source: To create a @file{TAGS} file in a specific directory, switch to that directory in Emacs using @kbd{M-x cd} command, or list the directory with @kbd{C-x d} (@code{dired}). Then run the compile command, with @w{@code{etags *.el}} as the command to execute:
es: Para crear un fichero @file{TAGS} en un directorio espec@'{@dotless{i}}fico, cambia a este directorio en Emacs usando un comando @kbd{M-x cd}, o lista el directorio como @w{@code{etags *.el}} como el comando para ejecutar:

source: For more information, see @ref{etags, , Create Your Own @file{TAGS} File}.
es: Para m@'as informaci@'on, ver @ref{etags, , Crea tu propio fichero @file{TAGS}}.

source: After you become more familiar with Emacs Lisp, you will find that you will frequently use @code{find-tag} to navigate your way around source code; and you will create your own @file{TAGS} tables.
es: Despu@'es de llegar a estar m@'as familiarizado con Emacs Lisp, se encontrar@'a frecuentemente usar @code{find-tag} para navegar tu camino alrededor del c@'odigo fuente; y se crear@'an tus propias tablas @file{TAGS}.

source: Library, as term for `file'
es: Librer@'{@dotless{i}}a, como t@'ermino para `fichero'

source: Incidentally, the files that contain Lisp code are conventionally called @dfn{libraries}. The metaphor is derived from that of a specialized library, such as a law library or an engineering library, rather than a general library. Each library, or file, contains functions that relate to a particular topic or activity, such as @file{abbrev.el} for handling abbreviations and other typing shortcuts, and @file{help.el} for on-line help. (Sometimes several libraries provide code for a single activity, as the various @file{rmail@dots{}} files provide code for reading electronic mail.) In @cite{The GNU Emacs Manual}, you will see sentences such as ``The @kbd{C-h p} command lets you search the standard Emacs Lisp libraries by topic keywords.''
es: Incidentalmente, los ficheros que contienen c@'odigo Lisp son convencionalmente llamadas @dfn{librer@'{@dotless{i}}as}. La met@'afora se deriva que una librer@'{@dotless{i}}a, tal como la librer@'{@dotless{i}}a de leyes o una librer@'{@dotless{i}}a de ingenier@'{@dotless{i}}a, en vez de una librer@'{@dotless{i}}a general. Cada librer@'{@dotless{i}}a, o fichero, contiene funciones que se relacionan a un asunto particular o actividad, tal como @file{abbrev.el} para manejar abreviaciones y otros atajos, y @file{help.el} para la ayuda on-line. (Algunas veces varias librer@'{@dotless{i}}as proporcionan c@'odigo para una actividad simple, como varios @file{rmail@dots{}} ficheros proveen c@'odigo para leer correos electr@'onicos.) En @cite{El Manual de GNU Emacs}, tu ver@'as varias frases tales como ``El comando @kbd{C-h p} te permite buscar el est@'andar de las librer@'{@dotless{i}}as Emacs Lisp por las palabras claves.

source: A Simplified @code{beginning-of-buffer} Definition
es: Una definici@'on simplificada de @code{beginning-of-buffer}

source: The @code{beginning-of-buffer} command is a good function to start with since you are likely to be familiar with it and it is easy to understand. Used as an interactive command, @code{beginning-of-buffer} moves the cursor to the beginning of the buffer, leaving the mark at the previous position. It is generally bound to @kbd{M-<}.
es: El comando @code{beginning-of-buffer} es una buena funci@'on para empezar ya puedes tener cierta familiaridad con eso y es f@'acil de comprender. Usado como un comando interactivo, @code{beginning-of-buffer} mueve el cursor al principio del b@'uffer, dejando la marca en la posici@'on previa. Eso es generalmente asignados a @kbd{M-<}.

source: In this section, we will discuss a shortened version of the function that shows how it is most frequently used. This shortened function works as written, but it does not contain the code for a complex option. In another section, we will describe the entire function. (@xref{beginning-of-buffer, , Complete Definition of @code{beginning-of-buffer}}.)
es: En esta secci@'on, se discutir@'a una versi@'on ordenada de la funci@'on que muestra como eso es lo usado m@'as frecuentemente. Esta funci@'on ordenada trabaja como se escribe, pero no contiene el c@'odigo para una funci@'on compleja. En otra secci@'on, describiremos la funci@'on entera. (@xref{beginning-of-buffer, Definici@'on Completa de @code{beginnning-of-buffer}}.)

source: Before looking at the code, let's consider what the function definition has to contain: it must include an expression that makes the function interactive so it can be called by typing @kbd{M-x beginning-of-buffer} or by typing a keychord such as @kbd{M-<}; it must include code to leave a mark at the original position in the buffer; and it must include code to move the cursor to the beginning of the buffer.
es: Antes de mirar en el c@'odigo, perm@'{@dotless{i}}tenos considerar que la definici@'on de funci@'on tiene que contener: eso debe incluir una expresi@'on que crea la funci@'on interactiva as@'{@dotless{i}} puede ser llamado escribiendo @kbd{M-x beginning-of-buffer} o escribiendo unos atajos tales como @kbd{M-<}; debe incluir c@'odigo para dejar una marca en la posici@'on original en el b@'uffer; y debe incluir c@'odigo el cursor al principio del b@'uffer.

source: Here is the complete text of the shortened version of the function:
es: Aqu@'{@dotless{i}} est@'a el texto completo la versi@'on ordenada de la funci@'on:

source: (defun simplified-beginning-of-buffer () "Move point to the beginning of the buffer; leave mark at previous position." (interactive) (push-mark) (goto-char (point-min)))
es: (defun simplified-beginning-of-buffer () "Mover punto al principio del bufer; dejar marca en la posici@'on previa." (interactive) (push-mark) (goto-char (point-min)))

source: Like all function definitions, this definition has five parts following the special form @code{defun}:
es: Como todas las definiciones de funci@'on, esta definici@'on tiene cinco partes siguiendo la forma especial @code{defun}:

source: The name: in this example, @code{simplified-beginning-of-buffer}.
es: El nombre: en este ejemplo, @code{simplified-beginning-of-buffer}.

source: A list of the arguments: in this example, an empty list, @code{()},
es: Una lista de los argumentos: en este ejemplo, una lista vac@'{@dotless{i}}a, @code{()},

source: The documentation string.
es: La cadena de documentaci@'on.

source: The interactive expression.
es: La expresi@'on interactive.

source: The body.
es: El cuerpo.

source: In this function definition, the argument list is empty; this means that this function does not require any arguments. (When we look at the definition for the complete function, we will see that it may be passed an optional argument.)
es: En esta definici@'on de funci@'on, la lista de argumentos est@'a vac@'{@dotless{i}}a; esto significa que esta funci@'on no requiere argumentos. (Cuando se busca la definici@'on para la funci@'on completa, se ver@'a que puede pasarse un argumento opcional.)

source: The interactive expression tells Emacs that the function is intended to be used interactively. In this example, @code{interactive} does not have an argument because @code{simplified-beginning-of-buffer} does not require one.
es: La expresi@'on interactiva cuenta a Emacs que la funci@'on se pretende ser usada interactivamente. En este ejemplo, @code{interactive} no tiene un argumento porque @code{simplified-beginning-of-buffer} no se requiere.

source: The body of the function consists of the two lines:
es: El cuerpo de la funci@'on consiste de dos l@'{@dotless{i}}neas:

source: The first of these lines is the expression, @code{(push-mark)}. When this expression is evaluated by the Lisp interpreter, it sets a mark at the current position of the cursor, wherever that may be. The position of this mark is saved in the mark ring.
es: La primera de estas l@'{@dotless{i}}neas es la expresi@'on, @code{(push-mark)}. Cuando esta expresi@'on es evaluado por el int@'erprete Lisp, eso asigna una marca en la posici@'on actual del cursor, siempre y cuando esto pueda ser. La posici@'on de esta marca est@'a guardada en el anillo de marcas.
