Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Free documentation, like free software, is a matter of freedom, not price. The problem with these manuals was not that O'Reilly Associates charged a price for printed copies---that in itself is fine. The Free Software Foundation @uref{http://shop.fsf.org, sells printed copies} of free @uref{http://www.gnu.org/doc/doc.html, GNU manuals}, too. But GNU manuals are available in source code form, while these manuals are available only on paper. GNU manuals come with permission to copy and modify; the Perl manuals do not. These restrictions are the problems.
es: La documentaci@'on, como el software, es una cuesti@'on de libertad, no de precio. El problema con estos manuales no eran que O'Reilly Associates impusiera un precio por las copias impresas --- que en s@'{@dotless{i}} estaban bien. La Free Software Foundation @emph{Fundaci@'on por el Software Libre} @uref{http://shop.fsf.org, vende copias impresas} de @uref{http://www.gnu.org/doc/doc.html, manuales libres de GNU}, tambi@'en. Pero los manuales de GNU est@'an disponibles en forma de c@'odigo fuente, mientras que estos manuales est@'an disponibles solo en papel. Los manuales de GNU vienen con permiso para copiar y modificar; los manuales de Perl no. Estas restricciones son un problema.

source: The criterion for a free manual is pretty much the same as for free software: it is a matter of giving all users certain freedoms. Redistribution (including commercial redistribution) must be permitted, so that the manual can accompany every copy of the program, on-line or on paper. Permission for modification is crucial too.
es: El criterio para un manual libre es parecido al del software libre: es una cuesti@'on de dar a todos los usuarios ciertas libertades. La redistribuci@'on (incluyendo redistribuci@'on comercial) debe ser permitida, as@'{@dotless{i}} el manual puede acompa@~nar cada copia del programa, en l@'{@dotless{i}}ne o en papel. El permiso para modificar es crucial tambi@'en.

source: As a general rule, I don't believe that it is essential for people to have permission to modify all sorts of articles and books. The issues for writings are not necessarily the same as those for software. For example, I don't think you or I are obliged to give permission to modify articles like this one, which describe our actions and our views.
es: Como regla general, no se cree que sea esencial para la gente tener permisos para modificar todas las partes de art@'{@dotless{i}}culos y libro. Las cuestiones para escritos no son necesariamente las mismas como estas para el software. Por ejemplo, no se sabe si se est@'a obligado a dar permisos para modificar art@'{@dotless{i}}culos como este, que describen nuestras acciones y nuestras vistas.

source: But there is a particular reason why the freedom to modify is crucial for documentation for free software. When people exercise their right to modify the software, and add or change its features, if they are conscientious they will change the manual too---so they can provide accurate and usable documentation with the modified program. A manual which forbids programmers to be conscientious and finish the job, or more precisely requires them to write a new manual from scratch if they change the program, does not fill our community's needs.
es: Pero hay una raz@'on particular de por qu@'e la libertad de modificar es crucial para la documentaci@'on de software libre. Cuando las personas ejercita su derecho a modificar el software, y a@~nadir o cambiar sus funcionalidades, si son consciente ellos cambiar@'an el manual tambi@'en --- as@'{@dotless{i}} se puede proveer documentaci@'on usable y cuidada con el programa modificado. Un manual que prohibe a los programadores ser consciente y finalizar el trabajo, o m@'as precisamente requiere escribir un nuevo manual desde cero si ellos cambian el programa, no se ajusta a las necesidades de nuestra comunidad.

source: While a blanket prohibition on modification is unacceptable, some kinds of limits on the method of modification pose no problem. For example, requirements to preserve the original author's copyright notice, the distribution terms, or the list of authors, are ok. It is also no problem to require modified versions to include notice that they were modified, even to have entire sections that may not be deleted or changed, as long as these sections deal with nontechnical topics. (Some GNU manuals have them.)
es: Mientras una serie de prohibiciones en la modificaci@'on es inaceptable, algunos tipos de l@'{@dotless{i}}mites en el m@'etodo de modificar no tiene tanto problema. Por ejemplo, los requisitos para preservar la noticia de autores del copyright, los t@'erminos de distribuci@'on, o la lista de autores, est@'en ok. Eso es tambi@'en no da problemas para requerir versiones modificadas para incluir notificar que fueron modificadas, incluso tienen secciones enteras que puede no ser eliminadas o cambiadas, tan largo como estas secciones tratan con asuntos no t@'ecnicos. (Algunos manuales de GNU los tienen).

source: These kinds of restrictions are not a problem because, as a practical matter, they don't stop the conscientious programmer from adapting the manual to fit the modified program. In other words, they don't block the free software community from making full use of the manual.
es: Estos tipos de restricciones no son un problema porque, como materia pr@'actica, no para al programador consciente desde la adaptaci@'on del manual para ajustar el programa modificado. En otras palabras, no se bloquea la comunidad del software libre haciendo el uso completo del manual.

source: However, it must be possible to modify all the technical content of the manual, and then distribute the result in all the usual media, through all the usual channels; otherwise, the restrictions do block the community, the manual is not free, and so we need another manual.
es: Sin embargo, debe ser posible modificar todo el contenido t@'ecnico del manual, y entonces se distribuye el resultado en todos los medios usuales, a trav@'es de todos los canales usuales; de otro modo, las restricciones bloquean la comunidad, el manual no es libre, y as@'{@dotless{i}} no se necesita otro manual.

source: Unfortunately, it is often hard to find someone to write another manual when a proprietary manual exists. The obstacle is that many users think that a proprietary manual is good enough---so they don't see the need to write a free manual. They do not see that the free operating system has a gap that needs filling.
es: Desafortunadamente, con frecuencia es duro encontrar a alguien a escribir otro manual cuando un manual privativo. El obst@'aculo es que muchos usuario piensan que un manual privativo es suficientemente bueno --- as@'{@dotless{i}} ellos no ven la necesidad de escribir un manual libre. Ellos no ven que el sistema operativo tiene un gazapo que necesita se rellenado.

source: Why do users think that proprietary manuals are good enough? Some have not considered the issue. I hope this article will do something to change that.
es: @questiondown{}Por qu@'e los usuarios piensan que los manuales privativos son suficientemente buenos? Algunos no han considerado la cuesti@'on. Espero que este art@'{@dotless{i}}culo har@'a alguna cosa para cambiar esto.

source: Other users consider proprietary manuals acceptable for the same reason so many people consider proprietary software acceptable: they judge in purely practical terms, not using freedom as a criterion. These people are entitled to their opinions, but since those opinions spring from values which do not include freedom, they are no guide for those of us who do value freedom.
es: Otros usuarios considera manuales privativos aceptables para la misma raz@'on as@'{@dotless{i}} muchas personas software privativo aceptable: ellos judgan en t@'erminos puramente pr@'acticos, no usando la liberta como un criterio. Estas personas son tituladas a sus opiniones, pero desde que estas opciones crezcan desde valores que no incluyen libertad, ellas no est@'an guiadas por esto quienes valoran la libertad.

source: Please spread the word about this issue. We continue to lose manuals to proprietary publishing. If we spread the word that proprietary manuals are not sufficient, perhaps the next person who wants to help GNU by writing documentation will realize, before it is too late, that he must above all make it free.
es: Por favor, populariza esta cuesti@'on. Se contin@'ua a perder manuales para publicaci@'on privativa. Si se populariza que los manuales privativos no son suficientes, quiz@'as la siguiente persona que quiere ayudar a GNU escribiendo documentaci@'on realizar@'a, antes de que sea demasiado tarde, lo que @'el debe que todo sea libre.

source: We can also encourage commercial publishers to sell free, copylefted manuals instead of proprietary ones. One way you can help this is to check the distribution terms of a manual before you buy it, and prefer copylefted manuals to non-copylefted ones.
es: Se puede tambi@'en animar editoriales comerciales a vender manuales libres o con copyleft en vez de uno privativo. Un camino que se puede ayudar esto chequea los t@'erminos de la distribuci@'on de un manual antes de que se compre, y preferimos manuales copyleft a los no copyleft.

source: Note: The Free Software Foundation maintains a page on its Web site that lists free books available from other publishers:@* @uref{http://www.gnu.org/doc/other-free-books.html}
es: Note: La Fundaci@'on para el Software Libre mantiene una p@'agina en su sitio Web que liste libros libres disponibles desde otras editoriales:@* @uref{http://www.gnu.org/doc/other-free-books.html}

source: Index
es: @'Indice

source: Robert J. Chassell has worked with GNU Emacs since 1985. He writes and edits, teaches Emacs and Emacs Lisp, and speaks throughout the world on software freedom. Chassell was a founding Director and Treasurer of the Free Software Foundation, Inc. He is co-author of the @cite{Texinfo} manual, and has edited more than a dozen other books. He graduated from Cambridge University, in England. He has an abiding interest in social and economic history and flies his own airplane.
es: Robert J. Chassell ha trabajado con GNU Emacs desde 1985. @'El escribe, edita y ense@~na Emacs y Emacs Lisp, y habla alrededor del mundo acerca de la libertad del software. Chassell es Director fundador y Tesorero de la Fundaci@'on por el Software Libre (FSF). @'El se gradu@'o la Universidad de Cambridge, en Inglaterra. @'El tiene un inter@'es cont@'inuo en historia econ@'omica y social y vuela su propio aeroplano
