Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: ;;; @r{3. Send a message to the user.} (cond ((zerop count) (message "The region does NOT have any words.")) ((= 1 count) (message "The region has 1 word.")) (t (message "The region has %d words." count))))))
es: ;;; @r{3. Enviar un mensaje al usuario.} (cond ((zerop count) (message "La regi@'on no tiene palabras.")) ((= 1 count) (message "La regi@'on tiene 1 palabra.")) (t (message "La regi@'on tiene %d palabras." count))))))

source: As written, the function works, but not in all circumstances.
es: Como se escribe, la funci@'on funciona, pero no en todas las circunstancias.

source: The Whitespace Bug in @code{@value{COUNT-WORDS}}
es: El error de espacio en blanco en @code{@value{COUNT-WORDS}}

source: The @code{@value{COUNT-WORDS}} command described in the preceding section has two bugs, or rather, one bug with two manifestations. First, if you mark a region containing only whitespace in the middle of some text, the @code{@value{COUNT-WORDS}} command tells you that the region contains one word! Second, if you mark a region containing only whitespace at the end of the buffer or the accessible portion of a narrowed buffer, the command displays an error message that looks like this:
es: El comando @code{@value{COUNT-WORDS}} descrito en la secci@'on precedente tiene dos errores, o incluso, un error con dos manifestaciones. Primero, si se marca una regi@'on conteniendo solo espacio en blanco en el medio de alg@'un texto el comando @exclamdown{}@code{@value{COUNT-WORDS}} cuenta que la regi@'on contiene una palabra!. Segundo, si se marca una regi@'on conteniendo solo espacios en blanco al final del b@'uffer o la porci@'on accesible de un b@'uffer encogido, el comando muestra un mensaje de error que se parece a esto:

source: Search failed: "\\w+\\W*"
es: B@'usqueda fallida: "\\w+\\W*"

source: If you are reading this in Info in GNU Emacs, you can test for these bugs yourself.
es: Si est@'a leyendo esto en Info en GNU Emacs, se puede testear para estos errores por s@'{@dotless{i}} mismo.

source: First, evaluate the function in the usual manner to install it.
es: Primero, eval@'ua la funci@'on de la manera usual para instalarlo.

source: Here is a copy of the definition. Place your cursor after the closing parenthesis and type @kbd{C-x C-e} to install it.
es: Aqu@'{@dotless{i}} hay una copia de la definici@'on. Emplaza tu cursor despu@'es de cerrar los par@'entesis y escribir @kbd{C-x C-e} para instalarlo.

source: ;; @r{First version; has bugs!} (defun @value{COUNT-WORDS} (beginning end) "Print number of words in the region. Words are defined as at least one word-constituent character followed by at least one character that is not a word-constituent. The buffer's syntax table determines which characters these are."
es: ;; @r{@exclamdown{}La Primera versi@'on; tiene errores!} (defun @value{COUNT-WORDS} (beginning end) "Imprime el n@'umero de palabras en la regi@'on. Las palabras son definidas como al menos un caracter de palabra constituida seguida por al menos un caracter que no es una palabra constituyente. La tabla de sintaxis del b@'uffer determina qu@'e caracteres hay."

source: (interactive "r") (message "Counting words in region ... ")
es: (interactive "r") (message "Contando palabras en la regi@'on ... ")

source: ;;; @r{3. Send a message to the user.} (cond ((zerop count) (message "The region does NOT have any words.")) ((= 1 count) (message "The region has 1 word.")) (t (message "The region has %d words." count))))))
es: ;;; @r{3. Env@'{@dotless{i}}a un mensaje al usuario.} (cond ((zerop count) (message "La regi@'on no tiene palabras.")) ((= 1 count) (message "The regi@'on tiene 1 palabra.")) (t (message "La regi@'on tiene %d palabras." count))))))

source: If you wish, you can also install this keybinding by evaluating it:
es: Si se desea, se puede tambi@'en instalar este atajo para ser evaluado:

source: To conduct the first test, set mark and point to the beginning and end of the following line and then type @kbd{C-c =} (or @kbd{M-x @value{COUNT-WORDS}} if you have not bound @kbd{C-c =}):
es: Para conducir el primer test, asigna marca y punto al principio y fin de la siguiente l@'{@dotless{i}}nea y entonces escribe @kbd{C-c =} (o @kbd{M-x @value{COUNT-WORDS}} si no se ha asignado @kbd{C-c =}):

source: one two three
es: uno dos tres

source: Emacs will tell you, correctly, that the region has three words.
es: Emacs te contar@'a, correctamente, que la regi@'on tiene tres palabras.

source: Repeat the test, but place mark at the beginning of the line and place point just @emph{before} the word @samp{one}. Again type the command @kbd{C-c =} (or @kbd{M-x @value{COUNT-WORDS}}). Emacs should tell you that the region has no words, since it is composed only of the whitespace at the beginning of the line. But instead Emacs tells you that the region has one word!
es: Repite el test, pero marca el lugar al principio de la l@'{@dotless{i}}nea y emplaza el punto justo @emph{antes} de la palabra @samp{uno}. De nuevo escribe el comando @kbd{C-c =} (o @kbd{M-x @value{COUNT-WORDS}}). Emacs cuenta que la regi@'on no tiene palabras, puesto que eso est@'a compuesto solo por espacios en blanco al principio de la l@'{@dotless{i}}nea. @exclamdown{}Pero en vez de que Emacs cuente que la regi@'on tiene una palabra!

source: For the third test, copy the sample line to the end of the @file{*scratch*} buffer and then type several spaces at the end of the line. Place mark right after the word @samp{three} and point at the end of line. (The end of the line will be the end of the buffer.) Type @kbd{C-c =} (or @kbd{M-x @value{COUNT-WORDS}}) as you did before. Again, Emacs should tell you that the region has no words, since it is composed only of the whitespace at the end of the line. Instead, Emacs displays an error message saying @samp{Search failed}.
es: Para el tercer test, copia la l@'{@dotless{i}}nea de ejemplo al fin del b@'uffer @file{*scratch*} y entonces escribe varios espacios al fin de la l@'{@dotless{i}}nea. Posiciona la marca correcta despu@'es de la palabra @samp{tres} y apunta al fin de la l@'{@dotless{i}}nea. (El fin de la l@'{@dotless{i}}nea ser@'a el fin del b@'uffer.) Escribe @kbd{C-c =} (o @kbd{M-x @value{COUNT-WORDS}}) como se hizo antes. De nuevo, Emacs te contar@'{@dotless{i}}a que la regi@'on no tiene palabras, puesto que eso est@'a compuesto solo de los espacios en blanco al fin de la l@'{@dotless{i}}nea. En vez de eso, Emacs muestra un mensaje de error diciendo @samp{B@'usqueda fallida}.

source: The two bugs stem from the same problem.
es: Los dos errores queman el mismo problema.

source: Consider the first manifestation of the bug, in which the command tells you that the whitespace at the beginning of the line contains one word. What happens is this: The @code{M-x @value{COUNT-WORDS}} command moves point to the beginning of the region. The @code{while} tests whether the value of point is smaller than the value of @code{end}, which it is. Consequently, the regular expression search looks for and finds the first word. It leaves point after the word. @code{count} is set to one. The @code{while} loop repeats; but this time the value of point is larger than the value of @code{end}, the loop is exited; and the function displays a message saying the number of words in the region is one. In brief, the regular expression search looks for and finds the word even though it is outside the marked region.
es: Considere la primera manifestaci@'on del error, en el que el comando te cuenta que el espacio en blanco al principio de la l@'{@dotless{i}}nea contiene una palabra. Lo que ocurre es esto: El comando @code{M-x @value{COUNT-WORDS}} mueve el punto al principio de la regi@'on. El test @code{while} si el valor del punto es m@'as peque@~no de lo que el valor de @code{end}, que es. Por consiguiente, en la expresi@'on regular se busca y encuentra la primera palabra. Eso deja el punto despu@'es de la palabra. @code{count} que se establece a uno. El bucle @code{while} repite; pero esta vez el valor del punto es m@'as largo que el valor de @code{end}, el bucle sale; y la funci@'on muestra un mensaje diciendo el n@'umero de palabras en la regi@'on es uno. En breve, la expresi@'on regular busca y encuentra la palabra incluso aunque eso est@'e fuera de la regi@'on marcada.

source: In the second manifestation of the bug, the region is whitespace at the end of the buffer. Emacs says @samp{Search failed}. What happens is that the true-or-false-test in the @code{while} loop tests true, so the search expression is executed. But since there are no more words in the buffer, the search fails.
es: En la segunda manifestaci@'on del error, la regi@'on es un espacio en blanco al fin del b@'uffer. Emacs dice @samp{B@'usqueda fallida}. Lo que ocurre es que true-or-false-test en el bucle @code{while} chequea verdad, as@'{@dotless{i}} la expresi@'on de b@'usqueda es ejecutada. Pero desde que no hay m@'as palabras en el buffer, la b@'usqueda falla.

source: In both manifestations of the bug, the search extends or attempts to extend outside of the region.
es: En ambas manifestaciones del error, la b@'usqueda extiende o intenta extenderse fuera de la regi@'on.

source: The solution is to limit the search to the region---this is a fairly simple action, but as you may have come to expect, it is not quite as simple as you might think.
es: La soluci@'on es limitar la b@'usqueda a la regi@'on --- esto es una acci@'on simple y limpia, pero como tu puedes tener que llegar a esperar, eso no es tan simple como se podr@'{@dotless{i}}a pensar.

source: As we have seen, the @code{re-search-forward} function takes a search pattern as its first argument. But in addition to this first, mandatory argument, it accepts three optional arguments. The optional second argument bounds the search. The optional third argument, if @code{t}, causes the function to return @code{nil} rather than signal an error if the search fails. The optional fourth argument is a repeat count. (In Emacs, you can see a function's documentation by typing @kbd{C-h f}, the name of the function, and then @key{RET}.)
es: Como se ha visto, la funci@'on @code{re-search-forward} toma un patr@'on de b@'usqueda como su primer argumento. Pero adem@'as de este primer, argumento obligatorio, se aceptan tres argumentos opcionales. El segundo argumento opcional asocia la b@'usqueda. El tercer argumento opcional, si @code{t}, causa la funci@'on a devolver @code{nil} en vez de la se@~nal un error si la b@'usqueda falla. El cuarto argumento opcional es un contador repetido. (En Emacs, se puede ver una documentaci@'on de la funci@'on escribiendo @kbd{C-h f}, el nombre de la funci@'on, y entonces @key{RET}.)

source: In the @code{@value{COUNT-WORDS}} definition, the value of the end of the region is held by the variable @code{end} which is passed as an argument to the function. Thus, we can add @code{end} as an argument to the regular expression search expression:
es: En la definici@'on @code{@value{COUNT-WORDS}}, el valor del fin de la regi@'on es tomada por la variable @code{end} que es pasada como un argumento para la funci@'on. De este modo, se puede a@~nadir @code{end} como un argumento para la b@'usqueda de la expresi@'on de b@'usqueda:

source: (re-search-forward "\\w+\\W*" end)
es: (re-search-forward "\\w+\\W*" fin)

source: However, if you make only this change to the @code{@value{COUNT-WORDS}} definition and then test the new version of the definition on a stretch of whitespace, you will receive an error message saying @samp{Search failed}.
es: Sin embargo, si se crea solo este cambio a la definici@'on @code{@value{COUNT-WORDS}} y entonces se chequea la nueva versi@'on de la definici@'on en una extensi@'on de espacio en blanco, se recibir@'a un mensaje de error diciendo @samp{B@'usqueda fallida}.

source: What happens is this: the search is limited to the region, and fails as you expect because there are no word-constituent characters in the region. Since it fails, we receive an error message. But we do not want to receive an error message in this case; we want to receive the message that "The region does NOT have any words."
es: Lo que ocurre es esto: la b@'usqueda se limita a la regi@'on, y falla como se espera porque no hay caracteres de palabras constituyentes en la regi@'on. Puesto que eso falla, se recibe un mensaje de error. Pero no queremos recibir un mensaje de error en este caso; se quiere recibir el mensaje que "La regi@'on no tiene palabras".

source: The solution to this problem is to provide @code{re-search-forward} with a third argument of @code{t}, which causes the function to return @code{nil} rather than signal an error if the search fails.
es: La soluci@'on a este problema es proveer @code{re-search-forward} con un tercer argumento de @code{t}, que causa la funci@'on para devolver @code{nil} en vez la se@~nalar un error si la b@'usqueda falla.

source: However, if you make this change and try it, you will see the message ``Counting words in region ... '' and @dots{} you will keep on seeing that message @dots{}, until you type @kbd{C-g} (@code{keyboard-quit}).
es: Sin embargo, si se crea este cambio y se intenta, se ver@'a el mensaje ``Contando palabras en la regi@'on ...'' y @dots{} se guardar@'a viendo qu@'e mensaje @dots{}, hasta que se escribe @kbd{C-g} (@code{keyboard-quit}).

source: Here is what happens: the search is limited to the region, as before, and it fails because there are no word-constituent characters in the region, as expected. Consequently, the @code{re-search-forward} expression returns @code{nil}. It does nothing else. In particular, it does not move point, which it does as a side effect if it finds the search target. After the @code{re-search-forward} expression returns @code{nil}, the next expression in the @code{while} loop is evaluated. This expression increments the count. Then the loop repeats. The true-or-false-test tests true because the value of point is still less than the value of end, since the @code{re-search-forward} expression did not move point. @dots{} and the cycle repeats @dots{}
es: Aqu@'{@dotless{i}} est@'a lo que ocurre: la b@'usqueda est@'a limitada a la regi@'on, como antes, y eso falla porque no hay caracteres no constituyentes de palabras en la regi@'on, como se espera. Por tanto, la expresi@'on @code{re-search-forward} devuelve @code{nil}. Eso no hace nada m@'as. En particular, no mueve el punto, que hace como un efecto lateral si se encuentra la b@'usqueda objetiva. Despu@'es la expresi@'on @code{re-search-forward} devuelve @code{nil}, la siguiente expresi@'on en el bucle @code{while} est@'a evaluado. Esta expresi@'on incrementa el contador. Entonces el bucle repite. El test true-or-false-test chequea cierto porque el valor del punto es todav@'{@dotless{i}}a menor que el valor final, desde que la expresi@'on @code{re-search-forward} no mover@'{@dotless{i}}a el punto. @dots{} y el ciclo repite @dots{}

source: The @code{@value{COUNT-WORDS}} definition requires yet another modification, to cause the true-or-false-test of the @code{while} loop to test false if the search fails. Put another way, there are two conditions that must be satisfied in the true-or-false-test before the word count variable is incremented: point must still be within the region and the search expression must have found a word to count.
es: La definici@'on @code{@value{COUNT-WORDS}} requiere todav@'{@dotless{i}}a de otra modificaci@'on para causar el true-or-false-test del bucle @code{while} para chequear falso si la b@'usqueda falla. Pon otro camino, hay dos condiciones que deben ser satisfechas en el true-or-false-test antes que el contador de palabras variable se incremente: el punto debe todav@'{@dotless{i}}a estar con la regi@'on y la expresi@'n de b@'usqueda debe haber encontrado una palabra para contar.

source: Since both the first condition and the second condition must be true together, the two expressions, the region test and the search expression, can be joined with an @code{and} special form and embedded in the @code{while} loop as the true-or-false-test, like this:
es: Por ambas la primera condici@'on y la segunda condici@'on deben ser ciertas juntas, las dos expresiones, la regi@'on chequea y la expresi@'on de b@'usqueda, puede estar unido con una forma especial @code{and} y embebido en el bucle @code{while} como el true-or-false-test, como esto:

source: (For information about @code{and}, see @ref{kill-new function, , The @code{kill-new} function}.)
es: (Para informaci@'on acerca de @code{and}, ver @ref{Funci@'on kill-new, , La funci@'on @code{kill-new}}.)

source: (@xref{kill-new function, , The @code{kill-new} function}, for information about @code{and}.)
es: (@xref{Funci@'on kill-new, , La funci@'on @code{kill-new}}, para informaci@'on acerca de @code{and}.)

source: The @code{re-search-forward} expression returns @code{t} if the search succeeds and as a side effect moves point. Consequently, as words are found, point is moved through the region. When the search expression fails to find another word, or when point reaches the end of the region, the true-or-false-test tests false, the @code{while} loop exits, and the @code{@value{COUNT-WORDS}} function displays one or other of its messages.
es: La expresi@'on @code{re-search-forward} devuelve @code{t} si la b@'usqueda es exitosa y como efecto lateral se mueve el punto. Consiguientemente, como las palabras se encuentran, el punto es movido a trav@'es de la regi@'on. Cuando la b@'usqueda de la expresi@'on falla para encontrar otra palabra, o cuando el punto logra el fin de la regi@'on, el test true-or-false-test es falso, el bucle @code{while} existe, y la funci@'on @code{@value{COUNT-WORDS}} muestra uno u otro de sus mensajes.

source: After incorporating these final changes, the @code{@value{COUNT-WORDS}} works without bugs (or at least, without bugs that I have found!). Here is what it looks like:
es: Despu@'es de incorporar estos cambios finales, el @code{@value{COUNT-WORDS}} funciona sin errores (@exclamdown{}o al menos, sin los errores que yo haya encontrado!. Aqu@'{@dotless{i}} est@'a lo que parece:

source: ;;; @r{Final version:} @code{while} (defun @value{COUNT-WORDS} (beginning end) "Print number of words in the region." (interactive "r") (message "Counting words in region ... ")
es: ;;; @r{Versi@'on final:} @code{while} (defun @value{COUNT-WORDS} (beginning end) "Imprime n@'umero de palabras en la regi@'on." (interactive "r") (message "Contando palabras en la regi@'on ... ")

source: ;;; @r{1. Set up appropriate conditions.} (save-excursion (let ((count 0)) (goto-char beginning)
es: ;;; @r{1. Configura condiciones apropiadas.} (save-excursion (let ((count 0)) (goto-char beginning)

source: ;;; @r{2. Run the} while @r{loop.} (while (and (< (point) end) (re-search-forward "\\w+\\W*" end t)) (setq count (1+ count)))
es: ;;; @r{2. Ejecuta el} @r{bucle} while (while (and (< (point) end) (re-search-forward "\\w+\\W*" end t)) (setq count (1+ count)))

source: Count Words Recursively
es: Cuenta palabras recursivamente

source: Count words recursively
es: Cuenta palabras recursivamente

source: Recursively counting words
es: Recursivamente contando palabras

source: Words, counted recursively
es: Palabras, contadas recursivamente

source: You can write the function for counting words recursively as well as with a @code{while} loop. Let's see how this is done.
es: Se puede escribir la funci@'on para contar palabras tanto de manera recursiva como con un bucle @code{while}. Permita ver c@'omo se hace.

source: First, we need to recognize that the @code{@value{COUNT-WORDS}} function has three jobs: it sets up the appropriate conditions for counting to occur; it counts the words in the region; and it sends a message to the user telling how many words there are.
es: Primero, se necesita reconocer que la funci@'on @code{@value{COUNT-WORDS}} tiene tres trabajos: eso configura las condiciones apropiadas para contar lo que ocurre; eso cuenta las palabras en la regi@'on; y env@'{@dotless{i}}a un mensaje al usuario contando cu@'antas palabras hay.

source: If we write a single recursive function to do everything, we will receive a message for every recursive call. If the region contains 13 words, we will receive thirteen messages, one right after the other. We don't want this! Instead, we must write two functions to do the job, one of which (the recursive function) will be used inside of the other. One function will set up the conditions and display the message; the other will return the word count.
es: Si se escribe una funci@'on recursiva simple para hacer cualquier cosa se recibir@'a un mensaje para cada llamada recursiva. Si la regi@'on contiene 13 palabras, se recibir@'an trece mensajes, uno correcto despu@'es del otro. @exclamdown{}No queremos esto!. En vez de eso, se deben escribir dos funciones para hacer el trabajo, una (la funci@'on recursiva) ser@'a usada dentro de la otra. Una funci@'on configurar@'a las condiciones y muestra el mensaje; la otra devolver@'a el contador de palabras.

source: Let us start with the function that causes the message to be displayed. We can continue to call this @code{@value{COUNT-WORDS}}.
es: Perm@'{@dotless{i}}tase comenzar con la funci@'on que causa el mensaje que se muestra. Se puede continuar por llamarse @code{@value{COUNT-WORDS}}.

source: This is the function that the user will call. It will be interactive. Indeed, it will be similar to our previous versions of this function, except that it will call @code{recursive-count-words} to determine how many words are in the region.
es: Esta es la funci@'on que el usuario llama. Ser@'a interactiva. En realidad, ser@'a similar a nuestras versiones previas de esta funci@'on, excepto que llamar@'a @code{recursive-count-words} para determinar cu@'antas palabras hay en la regi@'on.

source: We can readily construct a template for this function, based on our previous versions:
es: Se puede construir una plantilla legible para esta funci@'on, basada en versiones previas:

source: ;; @r{Recursive version; uses regular expression search} (defun @value{COUNT-WORDS} (beginning end) "@var{documentation}@dots{}" (@var{interactive-expression}@dots{})
es: ;; @r{Versi@'on Recursiva; usa la b@'usqueda de la expresi@'on regular} (defun @value{COUNT-WORDS} (beginning end) "@var{documentation}@dots{}" (@var{interactive-expression}@dots{})

source: ;;; @r{1. Set up appropriate conditions.} (@var{explanatory message}) (@var{set-up functions}@dots{}
es: ;;; @r{1. Configura condiciones apropiadas.} (@var{explanatory message}) (@var{set-up functions}@dots{}

source: ;;; @r{2. Count the words.} @var{recursive call}
es: ;;; @r{2. Contar las palabras.} @var{recursive call}

source: ;;; @r{3. Send a message to the user.} @var{message providing word count}))
es: ;;; @r{3. Env@'{@dotless{i}}a un mensaje al usuario.} @var{message providing word count}))

source: The definition looks straightforward, except that somehow the count returned by the recursive call must be passed to the message displaying the word count. A little thought suggests that this can be done by making use of a @code{let} expression: we can bind a variable in the varlist of a @code{let} expression to the number of words in the region, as returned by the recursive call; and then the @code{cond} expression, using binding, can display the value to the user.
es: La definici@'on parece sencilla, excepto que como el contador devuelve la llamada recursiva que debe ser pasada al mensaje mostrando el contaje de palabras. Un peque@~no pensamiento sugiere que esto puede ser hecho haciendo uso de una expresi@'on @code{let} al n@'umero de palabras en la regi@'on, como se devuelve por la llamada recursiva; y entonces la expresi@'on @code{cond}, que usa la asociaci@'on, puede mostrar el valor al usuario.
