Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: (@code{buffer-substring} is a previously unmentioned function you will have to investigate yourself; or perhaps you will have to use @code{buffer-substring-no-properties} or @code{filter-buffer-substring} @dots{}, yet other functions. Text properties are a feature otherwise not discussed here. @xref{Text Properties, , Text Properties, elisp, The GNU Emacs Lisp Reference Manual}.)
es: (@code{buffer-substring} es una funci@'on previamente no mencionada que tendr@'a que investigarla cada cual por uno mismo; o quiz@'as tendr@'a que usarse @code{buffer-substring-no-properties} o @code{filter-buffer-substring} @dots{}, o todav@'{@dotless{i}}a otras funciones. Las propiedades de texto son una funcionalidad que de otro modo no ser@'{@dotless{i}}an discutidas aqu@'{@dotless{i}}. @xref{Propiedades de Texto, , Propiedades de Texto, elisp, El Manual de Referencia de Emacs Lisp}.)

source: Additionally, do you really need @code{goto-char} or @code{point-min}? Or can you write the function without them?
es: Adem@'as, @questiondown{}realmente se necesita @code{goto-char} o @code{point-min}? @questiondown{}O se puede escribir la funci@'on sin ellos?

source: car, @r{introduced}
es: car, @r{introducido}

source: cdr, @r{introduced}
es: cdr, @r{introducido}

source: In Lisp, @code{car}, @code{cdr}, and @code{cons} are fundamental functions. The @code{cons} function is used to construct lists, and the @code{car} and @code{cdr} functions are used to take them apart.
es: En Lisp, @code{car}, @code{cdr}, y @code{cons} son funciones fundamentales. La funci@'on @code{cons} es usada para construir listas, y las funciones @code{car} y @code{cdr} son usadas para tomarlas aparte.

source: In the walk through of the @code{copy-region-as-kill} function, we will see @code{cons} as well as two variants on @code{cdr}, namely, @code{setcdr} and @code{nthcdr}. (@xref{copy-region-as-kill}.)
es: En el paseo guiado a trav@'es de la funci@'on @code{copy-region-as-kill}, se ver@'a @code{cons} tan bien como dos variantes de @code{cdr}, llamadas @code{setcdr} y @code{nthcdr}. (@xref{copy-region-as-kill}.)

source: The name of the @code{cons} function is not unreasonable: it is an abbreviation of the word `construct'. The origins of the names for @code{car} and @code{cdr}, on the other hand, are esoteric: @code{car} is an acronym from the phrase `Contents of the Address part of the Register'; and @code{cdr} (pronounced `could-er') is an acronym from the phrase `Contents of the Decrement part of the Register'. These phrases refer to specific pieces of hardware on the very early computer on which the original Lisp was developed. Besides being obsolete, the phrases have been completely irrelevant for more than 25 years to anyone thinking about Lisp. Nonetheless, although a few brave scholars have begun to use more reasonable names for these functions, the old terms are still in use. In particular, since the terms are used in the Emacs Lisp source code, we will use them in this introduction.
es: El nombre de la funci@'on @code{cons} es razonable: es una abreviaci@'on de la palabra `constructo'. Los or@'{@dotless{i}}genes de los nombres @code{car} y @code{cdr}, por otro lado, son esot@'ericos: @code{car} es un acr@'onimo de la frase `Contenidos de la parte de la Direcci@'on del Registro'; y @code{cdr} (pronunciado `could-er') es un acr@'onimo de la frase `Contenidos del Decremento del Registro'. Estas frases se refieren a piezas espec@'{@dotless{i}}ficas de hardware en el ordenador en el que el Lisp original fu@'e desarrollado. El resto de frases han sido completamente irrelevantes por m@'as de 25 a@~nos a cualquiera pensando acerca de Lisp. Ninguno, excepto unos pocos acad@'emicos valientes han empezado a usar nombres m@'as razonables para estas funciones, los viejos t@'erminos est@'an todav@'{@dotless{i}}a en uso. En particular, los t@'erminos usados en el c@'odigo fuente Emacs Lisp, que usaremos en esta introducci@'on.

source: @code{car} and @code{cdr}
es: @code{car} y @code{cdr}

source: The @sc{car} of a list is, quite simply, the first item in the list. Thus the @sc{car} of the list @code{(rose violet daisy buttercup)} is @code{rose}.
es: El @sc{car} de una lista es, bastante simple, el primer @'{@dotless{i}}tem en la lista. De este modo, el @sc{car} de la lista @code{(rosa violeta margarita bot@'ondeoro)} es @code{rosa}.

source: If you are reading this in Info in GNU Emacs, you can see this by evaluating the following:
es: Si est@'a leyendo en Info y en GNU Emacs, se puede ver esto evaluando lo siguiente:

source: (car '(rose violet daisy buttercup))
es: (car '(rosa violeta margarita bot@'ondeoro))

source: After evaluating the expression, @code{rose} will appear in the echo area.
es: Despu@'es de evaluar la expresi@'on, @code{rosa} aparecer@'a en el @'area echo.

source: Clearly, a more reasonable name for the @code{car} function would be @code{first} and this is often suggested.
es: Claramente, un nombre m@'as razonable para la funci@'on @code{car} ser@'{@dotless{i}}a @code{first} y esto es con frecuencia lo que se sugiere.

source: @code{car} does not remove the first item from the list; it only reports what it is. After @code{car} has been applied to a list, the list is still the same as it was. In the jargon, @code{car} is `non-destructive'. This feature turns out to be important.
es: @code{car} no elimina el primer @'{@dotless{i}}tem de la lista; solo se informa de lo que hay. Despu@'es de que @code{car} se haya aplicado a una lista, la lista es todav@'{@dotless{i}}a la misma que era. En la jerga, @code{car} es `no-destructiva'. Esta funcionalidad deja de ser importante.

source: The @sc{cdr} of a list is the rest of the list, that is, the @code{cdr} function returns the part of the list that follows the first item. Thus, while the @sc{car} of the list @code{'(rose violet daisy buttercup)} is @code{rose}, the rest of the list, the value returned by the @code{cdr} function, is @code{(violet daisy buttercup)}.
es: El @sc{cdr} de una lista es el resto de la lista, que es, la funci@'on @code{cdr} que devuelve la parte de la lista que sigue el primer @'{@dotless{i}}tem. De este modo, mientras el @sc{car} de la lista @code{'(rosa violeta margarita bot@'ondeoro)} es @code{rosa}, el resto de la lista, el valor devuelto por la funci@'on @code{cdr}, es @code{(violeta margarita bot@'ondeoro)}.

source: You can see this by evaluating the following in the usual way:
es: Se puede ver esto evaluando lo siguiente del modo usual:

source: (cdr '(rose violet daisy buttercup))
es: (cdr '(rosa violeta margarita bot@'ondeoro))

source: When you evaluate this, @code{(violet daisy buttercup)} will appear in the echo area.
es: Cuando se eval@'ua esto, @code{(violeta margarita bot@'ondeoro)} aparecer@'a en el @'area echo.

source: Like @code{car}, @code{cdr} does not remove any elements from the list---it just returns a report of what the second and subsequent elements are.
es: Al igual que @code{car}, @code{cdr} no elimina los elementos desde la lista --- solo devuelve un informe de lo que el segundo y subsiguientes elementos son.

source: Incidentally, in the example, the list of flowers is quoted. If it were not, the Lisp interpreter would try to evaluate the list by calling @code{rose} as a function. In this example, we do not want to do that.
es: En el ejemplo, la lista de flores se cita. Si no, el int@'erprete Lisp intentar@'{@dotless{i}}a evaluar la lista llamando a @code{rosa} como una funci@'on. En este ejemplo, no queremos hacer esto.

source: Clearly, a more reasonable name for @code{cdr} would be @code{rest}.
es: Claramente, un nombre m@'as razonable para @code{cdr} ser@'{@dotless{i}}a @code{rest}.

source: (There is a lesson here: when you name new functions, consider very carefully what you are doing, since you may be stuck with the names for far longer than you expect. The reason this document perpetuates these names is that the Emacs Lisp source code uses them, and if I did not use them, you would have a hard time reading the code; but do, please, try to avoid using these terms yourself. The people who come after you will be grateful to you.)
es: (Hay una lecci@'on aqu@'{@dotless{i}}: cuando se nombran nuevas funciones, considere muy cuidadosamente lo que se est@'a haciendo, ya que puede estar pegadas con los nombres largos que se esperan. La raz@'on es que este documento perpet@'ua estos nombres que el c@'odigo fuente de Emacs Lisp usa, y si no los usaba, se estar@'{@dotless{i}}a un duro rato leyendo el c@'odigo; pero, por favor, se debe intentar evitar usar estos t@'erminos por uno mismo. Las personas que vengan despu@'es se lo agradecer@'an.

source: When @code{car} and @code{cdr} are applied to a list made up of symbols, such as the list @code{(pine fir oak maple)}, the element of the list returned by the function @code{car} is the symbol @code{pine} without any parentheses around it. @code{pine} is the first element in the list. However, the @sc{cdr} of the list is a list itself, @code{(fir oak maple)}, as you can see by evaluating the following expressions in the usual way:
es: Cuando @code{car} y @code{cdr} se aplica a una lista hecha de s@'{@dotless{i}}mbolos, tal como la lista @code{(pino roble abeto arce)}, el elemento de la lista devuelta por la funci@'on @code{car} es el s@'{@dotless{i}}mbolo @code{pino} sin cualquier par@'entesis alrededor. @code{pino} es el primer elemento en la lista. Sin embargo, el @sc{cdr} de la lista es una lista por s@'{@dotless{i}} misma, @code{(roble abeto arce)}, como se puede ver evaluando las siguientes expresiones en el modo usual:

source: (car '(pine fir oak maple))
es: (car '(pino roble abeto arce))

source: (cdr '(pine fir oak maple))
es: (cdr '(pino roble abeto arce))

source: On the other hand, in a list of lists, the first element is itself a list. @code{car} returns this first element as a list. For example, the following list contains three sub-lists, a list of carnivores, a list of herbivores and a list of sea mammals:
es: Por otro lado, en una lista de listas, el primer elemento es en s@'{@dotless{i}} mismo una lista. @code{char} devuelve este primer elemento como una lista. Por ejemplo, la siguiente lista contiene tres sublistas, una lista de carn@'{@dotless{i}}voros, una lista de herb@'{@dotless{i}}voros y una lista de mam@'{@dotless{i}}feros:

source: (car '((lion tiger cheetah) (gazelle antelope zebra) (whale dolphin seal)))
es: (car '((leon tigre leopardo) (gacela antilope cebra) (ballena delfin foca)))

source: In this example, the first element or @sc{car} of the list is the list of carnivores, @code{(lion tiger cheetah)}, and the rest of the list is @code{((gazelle antelope zebra) (whale dolphin seal))}.
es: En este ejemplo, el primer elemento de @sc{car} de la lista es la lista de carn@'{@dotless{i}}voros, @code{(leon tigre leopardo)}, y el resto de la lista es @code{((gacela antilope cebra) (ballena delfin foca))}.

source: (cdr '((lion tiger cheetah) (gazelle antelope zebra) (whale dolphin seal)))
es: (cdr '((leon tigre leopardo) (gacela antilope cebra) (ballena delfin)))

source: It is worth saying again that @code{car} and @code{cdr} are non-destructive---that is, they do not modify or change lists to which they are applied. This is very important for how they are used.
es: Es un valor decir de nuevo que @code{car} y @code{cdr} son no destructivos --- esto es, no se modifican o cambian listas para las que ser aplicados. Esto es muy importante por c@'omo son usados.

source: Also, in the first chapter, in the discussion about atoms, I said that in Lisp, ``certain kinds of atom, such as an array, can be separated into parts; but the mechanism for doing this is different from the mechanism for splitting a list. As far as Lisp is concerned, the atoms of a list are unsplittable.'' (@xref{Lisp Atoms}.) The @code{car} and @code{cdr} functions are used for splitting lists and are considered fundamental to Lisp. Since they cannot split or gain access to the parts of an array, an array is considered an atom. Conversely, the other fundamental function, @code{cons}, can put together or construct a list, but not an array. (Arrays are handled by array-specific functions. @xref{Arrays, , Arrays, elisp, The GNU Emacs Lisp Reference Manual}.)
es: Tambi@'en, en el primer cap@'{@dotless{i}}tulo, en la discusi@'on acerca de @'atomos, yo dije que en Lisp, ``ciertos tipos de @'atomos, tales como un array, pueden separarse en partes; pero el mecanismo de hacer esto es diferente del mecanismo de separar una lista. Desde que Lisp se conoce, los @'atomos de una lista son indivisibles.'' (@xref{@'Atomos Lisp}.) El @code{car} y el @code{cdr} son funciones que son usadas para dividir listas y son consideradas fundamentales para Lisp. Puesto que no pueden dividir o ganar acceso a las partes de un array, un array es considerado un @'atomo. De otro modo, la otra funci@'on fundamental, @code{cons}, se puede poner cerca o construir una lista, pero no un array. (Los arrays son manejados por funciones de array espec@'{@dotless{i}}ficas. @xref{Arrays, , Arrays, elisp, El Manual de Referencia de GNU Emacs Lisp}.)

source: cons, @r{introduced}
es: cons, @r{introducido}

source: The @code{cons} function constructs lists; it is the inverse of @code{car} and @code{cdr}. For example, @code{cons} can be used to make a four element list from the three element list, @code{(fir oak maple)}:
es: La funci@'on @code{cons} construye listas; eso es lo inverso de @code{car} y @code{cdr}. Por ejemplo, @code{cons} puede usarse para crear una lista de cuatro elementos desde los tres elementos de la lista, @code{(abeto roble arce)}:

source: (cons 'pine '(fir oak maple))
es: (cons 'pino '(abeto roble arce))

source: After evaluating this list, you will see
es: Despu@'es de evaluar esto, se ver@'a lo siguiente:

source: (pine fir oak maple)
es: (pino abeto roble arce)

source: appear in the echo area. @code{cons} causes the creation of a new list in which the element is followed by the elements of the original list.
es: aparece en el @'area echo. @code{cons} causa la creaci@'on de una nueva lista en el que el elemento es seguido por los elementos de la lista original.

source: We often say that `@code{cons} puts a new element at the beginning of a list; it attaches or pushes elements onto the list', but this phrasing can be misleading, since @code{cons} does not change an existing list, but creates a new one.
es: Con frecuencia decimos que `@code{cons} pone un nuevo elemento al principio de una lista; adjunta o empuja el elemento dentro de la lista', pero esta frase puede ser incorrecta, puesto que @code{cons} no cambia a una lista existente, pero crea una nueva.

source: Like @code{car} and @code{cdr}, @code{cons} is non-destructive.
es: Como @code{car} y @code{cdr}, @code{cons} es no destructivo.

source: Build a list
es: Construir una lista

source: @code{cons} must have a list to attach to.@footnote{Actually, you can @code{cons} an element to an atom to produce a dotted pair. Dotted pairs are not discussed here; see @ref{Dotted Pair Notation, , Dotted Pair Notation, elisp, The GNU Emacs Lisp Reference Manual}.} You cannot start from absolutely nothing. If you are building a list, you need to provide at least an empty list at the beginning. Here is a series of @code{cons} expressions that build up a list of flowers. If you are reading this in Info in GNU Emacs, you can evaluate each of the expressions in the usual way; the value is printed in this text after @samp{@result{}}, which you may read as `evaluates to'.
es: @code{cons} debe tener una lista para adjuntar a@footnote{Actualmente, se puede @code{cons} un elemento para un @'atomo para producir a para punteado. Los pares punteados no se discuten aqu@'{@dotless{i}}; ver @ref{Notaci@'on de Pares Punteados, , Notaci@'on de Para Punteado, elisp, El Manual de Referencia de GNU Emacs Lisp}.} No se puede empezar desde absolutamente nada. Si se est@'a construyendo una lista, se necesita proveer al menos una lista vac@'{@dotless{i}}a al principio. Aqu@'{@dotless{i}} hay una serie de expresiones @code{cons} que construyen una lista de flores. Si est@'a leyendo esto en Info en GNU Emacs, se puede evaluar cada una de las expresiones en el camino usual; el valor es impreso en este texto despu@'es de @samp{@result{}}, que puede leer como `eval@'uas para'.

source: (cons 'buttercup ()) @result{} (buttercup)
es: (cons 'bot@'ondeoro ()) @result{} (bot@'ondeoro)

source: (cons 'daisy '(buttercup)) @result{} (daisy buttercup)
es: (cons 'margarita '(bot@'ondeoro)) @result{} (margarita bot@'ondeoro)

source: (cons 'violet '(daisy buttercup)) @result{} (violet daisy buttercup)
es: (cons 'violeta '(margarita bot@'ondeoro)) @result{} (violeta margarita bot@'ondeoro)

source: (cons 'rose '(violet daisy buttercup)) @result{} (rose violet daisy buttercup)
es: (cons 'rosa '(violeta margarita bot@'ondeoro)) @result{} (rosa violeta margarita bot@'ondeoro)

source: In the first example, the empty list is shown as @code{()} and a list made up of @code{buttercup} followed by the empty list is constructed. As you can see, the empty list is not shown in the list that was constructed. All that you see is @code{(buttercup)}. The empty list is not counted as an element of a list because there is nothing in an empty list. Generally speaking, an empty list is invisible.
es: En el primer ejemplo, la lista vac@'{@dotless{i}}a se muestra como @code{()} y despu@'es se construye una lista de @code{bot@'ondeoro} seguida por la lista vac@'{@dotless{i}}a. Como se puede ver, la lista vac@'{@dotless{i}}a no se muestra en la lista que fu@'e construida. Todo lo que se ve es @code{(bot@'ondeoro)}. La lista vac@'{@dotless{i}}a no cuenta como un elemento de una lista porque no hay nada en una lista vac@'{@dotless{i}}a. Generalmente hablando, una lista vac@'{@dotless{i}}a es invisible.

source: The second example, @code{(cons 'daisy '(buttercup))} constructs a new, two element list by putting @code{daisy} in front of @code{buttercup}; and the third example constructs a three element list by putting @code{violet} in front of @code{daisy} and @code{buttercup}.
es: El segundo ejemplo, @code{(cons 'margarita '(bot@'ondeoro))} construye una nueva lista de dos elemento poniendo @code{margarita} en frente de @code{bot@'ondeoro}; y el tercer ejemplo construye una lista de tres elementos poniendo @code{violeta} en frente de @code{margarita} y @code{bot@'ondeoro}.

source: Find the Length of a List: @code{length}
es: Encuentra el tama@~no de una lista: @code{length}

source: You can find out how many elements there are in a list by using the Lisp function @code{length}, as in the following examples:
es: Se pueden encontrar cu@'antos elementos hay en una lista usando la funci@'on Lisp @code{length}, como en los siguientes ejemplos:

source: (length '(buttercup)) @result{} 1
es: (length '(bot@'ondeoro)) @result{} 1

source: (length '(daisy buttercup)) @result{} 2
es: (length '(margarita bot@'ondeoro)) @result{} 2

source: (length (cons 'violet '(daisy buttercup))) @result{} 3
es: (length (cons 'violeta '(margarita bot@'ondeoro))) @result{} 3

source: In the third example, the @code{cons} function is used to construct a three element list which is then passed to the @code{length} function as its argument.
es: En el tercer ejemplo, la funci@'on @code{cons} es usada para construir una lista de tres elementos que entonces se pasa a la funci@'on @code{length} como su argumento.

source: We can also use @code{length} to count the number of elements in an empty list:
es: Se puede tambi@'en usar @code{length} para contar el n@'umero de elementos en una lista vac@'{@dotless{i}}a:

source: As you would expect, the number of elements in an empty list is zero.
es: Como se esperar@'{@dotless{i}}a, el n@'umero de elementos en una lista vac@'{@dotless{i}}a es cero.

source: An interesting experiment is to find out what happens if you try to find the length of no list at all; that is, if you try to call @code{length} without giving it an argument, not even an empty list:
es: Un experimento interesante es encontrar qu@'e ocurre si se intenta encontrar el tama@~no de una no lista en todo; que es, si se intenta llamar a @code{length} sin darle un argumento, incluso una lista no vac@'{@dotless{i}}a:

source: What you see, if you evaluate this, is the error message
es: Lo que se ve, si se eval@'ua esto, es el mensaje de error

source: This means that the function receives the wrong number of arguments, zero, when it expects some other number of arguments. In this case, one argument is expected, the argument being a list whose length the function is measuring. (Note that @emph{one} list is @emph{one} argument, even if the list has many elements inside it.)
es: Esto significa que la funci@'on recibe el n@'umero incorrecto de argumentos, cero, cuando se espera alg@'un otro n@'umero de argumentos. En este caso, se espera un argumento, el argumento de una lista cuyo tama@~no de la funci@'on se est@'a midiendo. (N@'otese que @emph{una} lista es @emph{un} argumento, incluso si la lista tiene muchos elementos dentro.)

source: The part of the error message that says @samp{length} is the name of the function.
es: La parte del mensaje de error que dice @samp{length} es el nombre de la funci@'on.

source: The @code{nthcdr} function is associated with the @code{cdr} function. What it does is take the @sc{cdr} of a list repeatedly.
es: La funci@'on @code{nthcdr} est@'a asociada con la funci@'on @code{cdr}. Que lo que hace es tomar la @sc{cdr} de una lista repetidamente.

source: If you take the @sc{cdr} of the list @code{(pine fir oak maple)}, you will be returned the list @code{(fir oak maple)}. If you repeat this on what was returned, you will be returned the list @code{(oak maple)}. (Of course, repeated @sc{cdr}ing on the original list will just give you the original @sc{cdr} since the function does not change the list. You need to evaluate the @sc{cdr} of the @sc{cdr} and so on.) If you continue this, eventually you will be returned an empty list, which in this case, instead of being shown as @code{()} is shown as @code{nil}.
es: Si se toma el @sc{cdr} de la lista @code{(pino roble abeto arce)}, ser@'a devuelta la lista @code{(roble abeto arce)}. Si se repite esto en lo que se devolvi@'o, se devolver@'a lista lista @code{(abeto arce)}. (De acuerdo, se repite @sc{cdr} en la lista original solo se dar@'a @sc{cdr} desde la funci@'on que no cambia la lista. Se necesita evaluar el @sc{cdr} del @sc{cdr} y as@'{@dotless{i}}.) Si se conti@'ua esto, finalmente ser@'a devuelta una lista vac@'{@dotless{i}}a, que en este caso, en vez de ser mostrada como @code{()} es mostrado como @code{nil}.

source: For review, here is a series of repeated @sc{cdr}s, the text following the @samp{@result{}} shows what is returned.
es: Para revisar, aqu@'{@dotless{i}} hay una serie de @sc{cdr}s repetidos, el siguiente @samp{@result{}} muestra lo que se devuelve.

source: (cdr '(pine fir oak maple)) @result{}(fir oak maple)
es: (cdr '(pino roble abeto arce)) @result{}(roble abeto arce)

source: (cdr '(fir oak maple)) @result{} (oak maple)
es: (cdr '(roble abeto arce)) @result{} (abeto arce)

source: (cdr '(oak maple)) @result{}(maple)
es: (cdr '(abeto arce)) @result{}(arce)

source: (cdr '(maple)) @result{} nil
es: (cdr '(arce)) @result{} nil

source: You can also do several @sc{cdr}s without printing the values in between, like this:
es: Tambi@'en se pueden hacer varios @sc{cdr}s sin imprimir los valores as@'{@dotless{i}}:

source: (cdr (cdr '(pine fir oak maple))) @result{} (oak maple)
es: (cdr (cdr '(pino roble abeto arce))) @result{} (abeto arce)
