Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Regular expression searches are described in @ref{Regexp Search, , Regular Expression Search, emacs, The GNU Emacs Manual}, as well as in @ref{Regular Expressions, , , elisp, The GNU Emacs Lisp Reference Manual}. In writing this chapter, I am presuming that you have at least a mild acquaintance with them. The major point to remember is that regular expressions permit you to search for patterns as well as for literal strings of characters. For example, the code in @code{forward-sentence} searches for the pattern of possible characters that could mark the end of a sentence, and moves point to that spot.
es: Las b@'usquedas de expresiones regulares son descritas en @ref{B@'usqueda de Regexp, , B@'usqueda de Expresi@'on Regular, emacs, El Manual de GNU Emacs}, tan bien como en @ref{Expresiones Regulares, , , elisp, El Manual de Referencia de GNU Emacs Lisp}. Escribiendo este cap@'{@dotless{i}}tulo, estoy presuponiendo que tiene al menos una familiaridad con esto. El mayor punto para recordar es que las expresiones regulares te permiten buscar patrones tan bien como para cadenas literales de caracteres. Por ejemplo, el c@'odigo en @code{forward-sentence} busca para el patr@'on de posibles caracteres que podr@'{@dotless{i}}an marcar el fin de una frase, y mueve el punto al otro lado.

source: Before looking at the code for the @code{forward-sentence} function, it is worth considering what the pattern that marks the end of a sentence must be. The pattern is discussed in the next section; following that is a description of the regular expression search function, @code{re-search-forward}. The @code{forward-sentence} function is described in the section following. Finally, the @code{forward-paragraph} function is described in the last section of this chapter. @code{forward-paragraph} is a complex function that introduces several new features.
es: Antes de mirar en el c@'odigo la funci@'on @code{forward-sentence}, es valorable considerar que el patr@'on que marca el fin de una frase debe estar. El patr@'on se discute en la siguiente secci@'on; siguiendo que es una descripci@'on de la expresi@'on regular de b@'usqueda, @code{re-search-forward}. La funci@'on @code{forward-sentence} es descrito en la secci@'on siguiente. Finalmente, la funci@'on @code{forward-paragraph} es descrito en la @'ultima secci@'on de este cap@'{@dotless{i}}tulo. @code{forward-paragraph} es una funci@'on compleja que introduce varias funcionalidades.

source: The Regular Expression for @code{sentence-end}
es: La expresi@'on regular para @code{sentence-end}

source: The symbol @code{sentence-end} is bound to the pattern that marks the end of a sentence. What should this regular expression be?
es: El s@'{@dotless{i}}mbolo @code{sentence-end} se asocia al patr@'on que marca el fin de una frase. @questiondown{}Cu@'al ser@'{@dotless{i}}a esta expresi@'on regular?

source: Clearly, a sentence may be ended by a period, a question mark, or an exclamation mark. Indeed, in English, only clauses that end with one of those three characters should be considered the end of a sentence. This means that the pattern should include the character set:
es: Claramente, una frase puede ser finalizada por un periodo, una marca de inicio de interrogaci@'on, o una marca de exclamaci@'on. Puesto que viene del ingl@'es, solo las cla@'usulas que finalizan con uno de estos tres caracteres deber@'{@dotless{i}}an ser consideradas al fin de una frase. Esto significa que el patr@'on incluir@'{@dotless{i}}a el conjunto de caracteres:

source: However, we do not want @code{forward-sentence} merely to jump to a period, a question mark, or an exclamation mark, because such a character might be used in the middle of a sentence. A period, for example, is used after abbreviations. So other information is needed.
es: Sin embargo, no queremos que @code{forward-sentence} salte a un periodo, una marca de pregunta, o una marca de exclamaci@'on, porque tal car@'acter podr@'{@dotless{i}}a ser usado en el medio de una frase. Un periodo, por ejemplo, se usa despu@'es de abreviaciones. As@'{@dotless{i}}, otra informaci@'on es necesaria.

source: According to convention, you type two spaces after every sentence, but only one space after a period, a question mark, or an exclamation mark in the body of a sentence. So a period, a question mark, or an exclamation mark followed by two spaces is a good indicator of an end of sentence. However, in a file, the two spaces may instead be a tab or the end of a line. This means that the regular expression should include these three items as alternatives.
es: De acuerdo a la convenci@'on, escribe dos espacios despu@'es de cada frase, pero solo un espacio despu@'es de un periodo, una marca de pregunta, o una marca de exclamaci@'on seguida por dos espacios es un buen indicador de un fin de frase. Sin embargo, en un fichero, los dos espacios pueden ser un tabulador o el fin de una l@'{@dotless{i}}nea. Esto significa que la expresi@'on regular incluir@'{@dotless{i}}a estos tres @'{@dotless{i}}tems como alternativas.

source: This group of alternatives will look like this:
es: Este grupo de alternativas se parece a esto:

source: Here, @samp{$} indicates the end of the line, and I have pointed out where the tab and two spaces are inserted in the expression. Both are inserted by putting the actual characters into the expression.
es: Aqu@'{@dotless{i}}, @samp{$} indica el fin de la l@'{@dotless{i}}nea, y yo he apuntado donde el tab y dos espacios est@'an insertados en la expresi@'on. Ambos est@'an insertados poniendo los caracteres actuales dentro de la expresi@'on.

source: Two backslashes, @samp{\\}, are required before the parentheses and vertical bars: the first backslash quotes the following backslash in Emacs; and the second indicates that the following character, the parenthesis or the vertical bar, is special.
es: Dos barras invertidas, @samp{\\}, se requiere antes de los par@'entesis y barras verticales: la primera barra invertida cita la siguiente barra invertida en Emacs; y el segundo indica que el siguiente caracter, el par@'entesis o la barra vertical, es especial.

source: Also, a sentence may be followed by one or more carriage returns, like this:
es: Tambi@'en, una frase puede ser seguida por uno o m@'as retornos de carro, como este:

source: Like tabs and spaces, a carriage return is inserted into a regular expression by inserting it literally. The asterisk indicates that the @key{RET} is repeated zero or more times.
es: Como en los tabuladores y espacios, un retorno de carro se inserta dentro de una expresi@'on regular insert@'andolo literalmente. El asterisco indica que el @key{RET} se repite cero o m@'as veces.

source: But a sentence end does not consist only of a period, a question mark or an exclamation mark followed by appropriate space: a closing quotation mark or a closing brace of some kind may precede the space. Indeed more than one such mark or brace may precede the space. These require a expression that looks like this:
es: Pero una frase no consiste solo en un periodo, una marca de pregunta o una marca de exclamaci@'on seguida por espacios apropiados: una marca de cerrar comillas o cerrar un par@'entesis de alg@'un tipo puede preceder el espacio. En realidad m@'as de una marca o par@'entesis pueden preceder el espacio. Estas requieren una expresi@'on que se parezca a:

source: In this expression, the first @samp{]} is the first character in the expression; the second character is @samp{"}, which is preceded by a @samp{\} to tell Emacs the @samp{"} is @emph{not} special. The last three characters are @samp{'}, @samp{)}, and @samp{@}}.
es: En esta expresi@'on, el primer @samp{]} es el primer caracter en la expresi@'on; el segundo caracter es @samp{"}, que est@'a precedido por un @samp{\} para contar Emacs el @samp{"} @emph{no} es especial. Los @'ultimos tres caracteres son @samp{'}, @samp{)}, y @samp{@}}.

source: All this suggests what the regular expression pattern for matching the end of a sentence should be; and, indeed, if we evaluate @code{sentence-end} we find that it returns the following value:
es: Todo esto sugiere que el patr@'on de la expresi@'on regular para asociar el fin de una frase ser@'{@dotless{i}}a; y, profundamente, si se eval@'ua @code{sentence-end} y encuentra que se devuelve el valor siguiente:

source: (Well, not in GNU Emacs 22; that is because of an effort to make the process simpler and to handle more glyphs and languages. When the value of @code{sentence-end} is @code{nil}, then use the value defined by the function @code{sentence-end}. (Here is a use of the difference between a value and a function in Emacs Lisp.) The function returns a value constructed from the variables @code{sentence-end-base}, @code{sentence-end-double-space}, @code{sentence-end-without-period}, and @code{sentence-end-without-space}. The critical variable is @code{sentence-end-base}; its global value is similar to the one described above but it also contains two additional quotation marks. These have differing degrees of curliness. The @code{sentence-end-without-period} variable, when true, tells Emacs that a sentence may end without a period, such as text in Thai.)
es: (Bien, no en GNU Emacs 22; porque es un esfuerzo crear el proceso simple y manejar m@'as s@'{@dotless{i}}mbolos y lenguajes. Cuando el valor de @code{sentence-end} es @code{nil}, entonces usa el valor definido por la funci@'on @code{sentence-end} es @code{nil}, entonces usa el valor definido por la funci@'on @code{sentence-end}. (Aqu@'{@dotless{i}} se usa la diferencia entre un valor y una funci@'on en Emacs Lisp.) La funci@'on devuelve un valor construido desde las variables @code{sentence-end-base}, @code{sentence-end-double-space}, @code{sentence-end-without-period}, y @code{sentence-end-without-space}. La variable cr@'{@dotless{i}}tica es @code{sentence-end-base}; su valor global es similar a uno descrito debajo pero tambi@'en contiene marcas de cita adicionales. Estas tienen diferentes grados de curvas. La variable @code{sentence-end-without-period}, cuando es verdad, dice a Emacs que una frase puede finalizar sin un periodo tal como texto en Thai.)

source: The first part of the pattern is the three characters, a period, a question mark and an exclamation mark, within square brackets. The pattern must begin with one or other of these characters.
es: La primera parte del patr@'on son los tres caracteres, un periodo, una pregunta marca y un marca de exclamaci@'on, con par@'entesis cuadrados. El patr@'on empieza con uno un otro de estos caracteres.

source: The second part of the pattern is the group of closing braces and quotation marks, which can appear zero or more times. These may follow the period, question mark or exclamation mark. In a regular expression, the backslash, @samp{\}, followed by the double quotation mark, @samp{"}, indicates the class of string-quote characters. Usually, the double quotation mark is the only character in this class. The asterisk, @samp{*}, indicates that the items in the previous group (the group surrounded by square brackets, @samp{[]}) may be repeated zero or more times.
es: La segunda parte del patr@'on es el grupo de cerrar par@'entesis y marcas de cita, que pueden aparecer cero o m@'as veces. Estos pueden seguir el periodo, marca de pregunta o marca de exclamaci@'on. En una expresi@'on regular la barra, @samp{\}, seguido por las dobes comillas, @samp{"}, indica los casos de caracteres string-quote. Normalmente, las dobles comillas es el @'unico caracter en esta clase. El asterisco, @samp{*}, indica que los @'{@dotless{i}}tems en el grupo previo (el grupo alrededor por comillas cuadradas, @samp{[]} puede ser repetido cero o m@'as veces.

source: The third part of the pattern is one or other of: either the end of a line, or two blank spaces, or a tab. The double back-slashes are used to prevent Emacs from reading the parentheses and vertical bars as part of the search pattern; the parentheses are used to mark the group and the vertical bars are used to indicated that the patterns to either side of them are alternatives. The dollar sign is used to indicate the end of a line and both the two spaces and the tab are each inserted as is to indicate what they are.
es: La tercera parte del patr@'on es uno u otro de: si el fin de una l@'{@dotless{i}}nea, o dos espacios en blanco, o un tabulador. Las barras invertidas dobles son usadas para prevenir a Emacs desde leer los par@'entesis y barras verticales como parte del patr@'on de b@'usqueda; los par@'entesis son usados para marcar el grupo y las barras verticales usadas para indicarse que los patrones de un lado de ellos son alternativas. El signo del d@'olar es usados para indicar el fin de una l@'{@dotless{i}}nea y ambos espacios y el tabulador son cada uno insertados como est@'an para indicar lo que ellos son.

source: Finally, the last part of the pattern indicates that the end of the line or the whitespace following the period, question mark or exclamation mark may, but need not, be followed by one or more carriage returns. In the pattern, the carriage return is inserted as an actual carriage return between square brackets but here it is shown as @key{RET}.
es: Finalmente, la @'ultima parte del patr@'on indica que el fin de la l@'{@dotless{i}}nea o el espacio en blanco siguiendo el periodo, marca de pregunta o marca de exclamaci@'on, pero no necesita, el retorno de carro es insertado como un retorno de carro devuelve par@'entesis cuadrados pero aqu@'{@dotless{i}} eso muestra @key{RET}.

source: The @code{re-search-forward} Function
es: La funci@'on @code{re-search-forward}

source: The @code{re-search-forward} function is very like the @code{search-forward} function. (@xref{search-forward, , The @code{search-forward} Function}.)
es: La funci@'on @code{re-search-forward} es similar a la funci@'on @code{search-forward}. (@xref{search-forward, , La Funci@'on @code{search-forward}}.)

source: @code{re-search-forward} searches for a regular expression. If the search is successful, it leaves point immediately after the last character in the target. If the search is backwards, it leaves point just before the first character in the target. You may tell @code{re-search-forward} to return @code{t} for true. (Moving point is therefore a `side effect'.)
es: @code{re-search-forward} busca una expresi@'on regular. Si la b@'usqueda es exitosa, deja el punto inmediatamente despu@'es del @'ultimo caracter en el objetivo. Si la b@'usqueda es hacia atr@'as, deja el punto antes del primer caracter en el objetivo. Se puede contar @code{re-search-forward} para devolver @code{t} a cierto. (Moviendo el punto es por ello un `efecto lateral'.)

source: Like @code{search-forward}, the @code{re-search-forward} function takes four arguments:
es: Como @code{search-forward}, la funci@'on @code{re-search-forward} toma cuatro argumentos:

source: The first argument is the regular expression that the function searches for. The regular expression will be a string between quotation marks.
es: El primer argumento es la expresi@'on regular que la funci@'on busca. La expresi@'on regular ser@'a una cadena entre comillas.

source: The optional second argument limits how far the function will search; it is a bound, which is specified as a position in the buffer.
es: El segundo argumento opcional limita c@'omo la funci@'on busca; es un emparejamiento, que se especifica como una posici@'on en el b@'uffer.

source: The optional third argument specifies how the function responds to failure: @code{nil} as the third argument causes the function to signal an error (and print a message) when the search fails; any other value causes it to return @code{nil} if the search fails and @code{t} if the search succeeds.
es: El tercer argumento opcional especifica c@'omo la funci@'on responde al fallo: @code{nil} como tercer argumento que causa la funci@'on para se@~nalar un error (e imprime un mensaje) cuando la b@'usqueda falla; cualquier otro valor causa devolver @code{nil} si la b@'usqueda falla y @code{t} si la b@'usqueda tiene @'exito.

source: The optional fourth argument is the repeat count. A negative repeat count causes @code{re-search-forward} to search backwards.
es: El cuarto argumento opcional es el contaje repetido. Un contaje negativo repetido causa @code{re-search-forward} para buscar hacia atr@'as.

source: The template for @code{re-search-forward} looks like this:
es: La plantilla para @code{re-search-forward} se parece a esto:

source: The second, third, and fourth arguments are optional. However, if you want to pass a value to either or both of the last two arguments, you must also pass a value to all the preceding arguments. Otherwise, the Lisp interpreter will mistake which argument you are passing the value to.
es: El segundo, tercer, y cuarto argumentos son opcionales. Sin embargo, si se quiere pasar un valor a uno o ambos de los @'ultimos dos argumentos, se debe tambi@'en pasar un valor a todos los argumentos precedentes. De otro modo, el int@'erprete Lisp errar@'a a qu@'e argumento est@'as pasando el valor.

source: In the @code{forward-sentence} function, the regular expression will be the value of the variable @code{sentence-end}. In simple form, that is:
es: En la funci@'on @code{forward-sentence}, la expresi@'on regular ser@'a el valor de la variable @code{sentence-end}. En forma simple, esto es:

source: The limit of the search will be the end of the paragraph (since a sentence cannot go beyond a paragraph). If the search fails, the function will return @code{nil}; and the repeat count will be provided by the argument to the @code{forward-sentence} function.
es: El l@'{@dotless{i}}mite de la b@'usqueda ser@'a el fin del p@'arrafo (desde una frase no puede ir bajo un p@'arrafo). Si la b@'usqueda falla, la funci@'on devuelve @code{nil}, y el contaje repite ser@'a provisto por el argumento para la funci@'on @code{forward-sentence}.

source: The command to move the cursor forward a sentence is a straightforward illustration of how to use regular expression searches in Emacs Lisp. Indeed, the function looks longer and more complicated than it is; this is because the function is designed to go backwards as well as forwards; and, optionally, over more than one sentence. The function is usually bound to the key command @kbd{M-e}.
es: El comando mueve el cursor hacia adelante una frase es una ilustraci@'on honesta de c@'omo usar b@'usquedas de expresiones regulares en Emacs Lisp. En realidad, la funci@'on parece m@'as larga y m@'as complicada de lo que es; esto es porque la funci@'on est@'a dise@~nada para ir hacia atr@'as tan bien como hacia adelante; y, opcionalmente, a trav@'es de una frase. La funci@'on est@'a normalmente asociada al comando @kbd{M-e}.

source: Complete forward-sentence
es: Completa forward-sentence

source: Complete @code{forward-sentence} function definition
es: Completa la definici@'on @code{forward-sentence}

source: Here is the code for @code{forward-sentence}:
es: Aqu@'{@dotless{i}} est@'a la c@'odigo para @code{forward-sentence}:

source: (defun forward-sentence (&optional arg) "Move forward to next `sentence-end'. With argument, repeat. With negative argument, move backward repeatedly to `sentence-beginning'.
es: (defun forward-sentence (&optional arg) "Ve al siguiente `sentence-end'. Con el argumento, repite. Con el argumento negativo, mueve atr@'as repetidamente a `sentence-beginning'.

source: The variable `sentence-end' is a regular expression that matches ends of sentences. Also, every paragraph boundary terminates sentences as well."
es: La variable `sentence-end' es una expresi@'on regular que empareja el fin de frases. Tambi@'en, cada p@'arrafo asociado termina las frases bien.

source: (defun forward-sentence (&optional arg) "Move forward to next sentence-end. With argument, repeat. With negative argument, move backward repeatedly to sentence-beginning. Sentence ends are identified by the value of sentence-end treated as a regular expression. Also, every paragraph boundary terminates sentences as well."
es: (defun forward-sentence (&optional arg) "Mueve hacia adelante a la siguiente sentence-end. Con el argumento, repetir. Con el argumento negativo, mueve hacia atr@'as repetidamente a sentence-beginning. La frase que finalizan son identificadas por el valor de sentence-end tratada como expresi@'on regular. Tambi@'en, cada p@'arrafo l@'{@dotless{i}}mite termina las frases bien"

source: The function looks long at first sight and it is best to look at its skeleton first, and then its muscle. The way to see the skeleton is to look at the expressions that start in the left-most columns:
es: La funci@'on se ve larga a primera vista y es mejor mirar primero el esqueleto, y entonces su m@'usculo. El camino para ver el esqueleto es mirar en las expresiones que empiezan las columnas m@'as a la izquierda:

source: This looks much simpler! The function definition consists of documentation, an @code{interactive} expression, an @code{or} expression, a @code{let} expression, and @code{while} loops.
es: @exclamdown{}Esto parece bastante simple! La definici@'on de la funci@'on consiste de documentaci@'on una expresi@'on @code{interactive}, una expresi@'on @code{or}, una expresi@'on @code{let}, y bucles @code{while}.

source: Let's look at each of these parts in turn.
es: Permite mirar cada una de estas partes.

source: We note that the documentation is thorough and understandable.
es: Notamos que la documentaci@'on es profunda y comprensible.

source: The function has an @code{interactive "p"} declaration. This means that the processed prefix argument, if any, is passed to the function as its argument. (This will be a number.) If the function is not passed an argument (it is optional) then the argument @code{arg} will be bound to 1.
es: La funci@'on tiene una declaraci@'on @code{interactive "p"}. Esto signifca que el argumento prefijo, si cualquiera es pasado a la funci@'on como su argumento. (Esto ser@'a un n@'umero.) Si la funci@'on no pasa un argumento (eso es opcional) entonces el argumento @code{arg} ser@'a asociado a 1.

source: When @code{forward-sentence} is called non-interactively without an argument, @code{arg} is bound to @code{nil}. The @code{or} expression handles this. What it does is either leave the value of @code{arg} as it is, but only if @code{arg} is bound to a value; or it sets the value of @code{arg} to 1, in the case when @code{arg} is bound to @code{nil}.
es: Cuando @code{forward-sentence} se llama no interactivamente sin un argumento, @code{arg} est@'a asignado @code{nil}. La expresi@'on @code{or} maneja esto. Lo que hace es dejar el valor de @code{arg} como eso es, pero solo si @code{arg} est@'a asignado a un valor; o eso asigna el valor de @code{arg} a 1, en el caso de @code{arg} est@'a asignado a @code{nil}.

source: Next is a @code{let}. That specifies the values of two local variables, @code{point} and @code{sentence-end}. The local value of point, from before the search, is used in the @code{constrain-to-field} function which handles forms and equivalents. The @code{sentence-end} variable is set by the @code{sentence-end} function.
es: Lo siguiente es un @code{let}. Que especifica los valores de dos variables locales @code{point} y @code{sentence-end}. El valor local de punto, desde antes de la b@'usqueda, es usada en la funci@'on @code{constrain-to-field} que maneja formularios y equivalentes. La variable @code{sentence-end} est@'a asignada por la funci@'on @code{sentence-end}.

source: The @code{while} loops
es: Los bucles @code{while}
