Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: When the Lisp interpreter first starts evaluating the expressions in the function, the value of @code{total} should be set to zero, since we have not added anything to it. Then the function should add the number of pebbles in the first row to the total, and then add the number of pebbles in the second to the total, and then add the number of pebbles in the third row to the total, and so on, until there are no more rows left to add.
es: Cuando el int@'erprete Lisp primero empieza evaluando las expresiones de la funci@'on, el valor de @code{total} estar@'{@dotless{i}}a asignado a cero, ya que no hemos a@~nadido cualquier cosa a eso. Entonces la funci@'on a@~nadir@'{@dotless{i}}a el n@'umero de asteriscos en la primera fila al total, y entonces a@~nade el n@'umero de asteriscos en la segunda al total, y entonces a@~nade el n@'umero de asteriscos a la tercera fila al total, y as@'{@dotless{i}}, hasta que no hay m@'as filas a la izquierda para a@~nadir.

source: Both @code{total} and @code{row-number} are used only inside the function, so they can be declared as local variables with @code{let} and given initial values. Clearly, the initial value for @code{total} should be 0. The initial value of @code{row-number} should be 1, since we start with the first row. This means that the @code{let} statement will look like this:
es: Ambos @code{total} y @code{row-number} se usan solo dentro de la funci@'on, as@'{@dotless{i}} ellos pueden ser declarados como variables locales con @code{let} y valores iniciales dados. Claramente, el valor inicial para total ser@'{@dotless{i}}a 0. El valor inicial de @code{row-number} ser@'{@dotless{i}}a 1, desde que se comienza con la primera fila. Esto significa que la frase @code{let} se parece a esto:

source: After the internal variables are declared and bound to their initial values, we can begin the @code{while} loop. The expression that serves as the test should return a value of @code{t} for true so long as the @code{row-number} is less than or equal to the @code{number-of-rows}. (If the expression tests true only so long as the row number is less than the number of rows in the triangle, the last row will never be added to the total; hence the row number has to be either less than or equal to the number of rows.)
es: Despu@'es de que las variables internas se declaran y se asignan a sus valores iniciales se podr@'{@dotless{i}}a empezar el bucle @code{while}. La expresi@'on que sirve como el test devolver@'{@dotless{i}}a un valor de @code{t} para la verdad tan grande como el @code{row-number} que es menor o igual al @code{number-of-rows}. (La expresi@'on devuelve cierto solo si el n@'umero de fila es menor que el n@'umero de filas en el tri@'angulo, la @'ultima fila nunca ser@'a a@~nadida al total; aqu@'{@dotless{i}} el n@'umero de fila tiene que ser menor o igual el n@'umero de filas.))

source: <= @r{(less than or equal)}
es: <= @r{(menos que igual)}

source: Lisp provides the @code{<=} function that returns true if the value of its first argument is less than or equal to the value of its second argument and false otherwise. So the expression that the @code{while} will evaluate as its test should look like this:
es: Lisp provee la funci@'on @code{<=} que devuelve cierto si el valor de su primer argumento es menor o igual al valor de su segundo argumento y falso de otro modo. As@'{@dotless{i}} la expresi@'on que el @code{while} evaluar@'a como si su test se ver@'{@dotless{i}}a como esto:

source: The total number of pebbles can be found by repeatedly adding the number of pebbles in a row to the total already found. Since the number of pebbles in the row is equal to the row number, the total can be found by adding the row number to the total. (Clearly, in a more complex situation, the number of pebbles in the row might be related to the row number in a more complicated way; if this were the case, the row number would be replaced by the appropriate expression.)
es: El n@'umero de asteriscos puede encontrarse repetidamente a@~nadiendo el n@'umero de asteriscos en una fila al total ya encontrado. Puesto que el n@'umero de asteriscos en la fila es igual al n@'umero de la fila, el total puede encontrarse a@~nadiendo el n@'umero de filas al total. (Claramente, en una situaci@'on m@'as compleja, el n@'umero de asteriscos en la fila podr@'{@dotless{i}}a ser relacionada al n@'umero de la fila en un camino m@'as complicado; si este fuera el caso, el n@'umero de fila ser@'{@dotless{i}}a reemplazado por la expresi@'on apropiada.)

source: What this does is set the new value of @code{total} to be equal to the sum of adding the number of pebbles in the row to the previous total.
es: Lo que esto hace es asignar el nuevo valor de @code{total} a ser igual a la suma de a@~nadiendo el n@'umero de asteriscos en la fila al total previo.

source: After setting the value of @code{total}, the conditions need to be established for the next repetition of the loop, if there is one. This is done by incrementing the value of the @code{row-number} variable, which serves as a counter. After the @code{row-number} variable has been incremented, the true-or-false-test at the beginning of the @code{while} loop tests whether its value is still less than or equal to the value of the @code{number-of-rows} and if it is, adds the new value of the @code{row-number} variable to the @code{total} of the previous repetition of the loop.
es: Despu@'es de configurar el valor de @code{total}, las condiciones deben ser establecidas para la siguiente repetici@'on del bucle, si hay alguna. Esto se hace incrementando el valor de la variable @code{row-number}, que sirve como un contador. Despu@'es que la variable @code{row-number} ha sido incrementada, el true-or-false-test al principio del bucle @code{while} chequea si su valor es todav@'{@dotless{i}}a menor o igual al valor del @code{number-of-rows} y si eso es, a@~nade el nuevo valor de la variable @code{row-number} al @code{total} de la repetici@'on del bucle.

source: The built-in Emacs Lisp function @code{1+} adds 1 to a number, so the @code{row-number} variable can be incremented with this expression:
es: La funci@'on construida en Emacs Lisp @code{1+} a@~nade 1 a un n@'umero, as@'{@dotless{i}} la variable @code{row-number} puede ser incrementado con esta expresi@'on:

source: Putting the function definition together
es: Poniendo la definici@'on de la funci@'on junta

source: We have created the parts for the function definition; now we need to put them together.
es: Nosotros hemos creado las partes para la definici@'on de la funci@'on; ahora necesitamos ponerlas juntas.

source: First, the contents of the @code{while} expression:
es: Primero, los contenidos de la expresi@'on @code{while}:

source: (while (<= row-number number-of-rows) ; @r{true-or-false-test} (setq total (+ total row-number)) (setq row-number (1+ row-number))) ; @r{incrementer}
es: (while (<= row-number number-of-rows) ; @r{true-or-false-test} (setq total (+ total row-number)) (setq row-number (1+ row-number))) ; @r{incremento}

source: Along with the @code{let} expression varlist, this very nearly completes the body of the function definition. However, it requires one final element, the need for which is somewhat subtle.
es: Tener la expresi@'on @code{let} de varlist, se acerca a completar el cuerpo de la definici@'on de funci@'on. Sin embargo, eso requiere un elemento final, la necesidad para la que es alguna cosa peque@~na.

source: The final touch is to place the variable @code{total} on a line by itself after the @code{while} expression. Otherwise, the value returned by the whole function is the value of the last expression that is evaluated in the body of the @code{let}, and this is the value returned by the @code{while}, which is always @code{nil}.
es: El toque final es emplazar la variable @code{total} en una l@'{@dotless{i}}nea por s@'{@dotless{i}} misma despu@'es de la expresi@'on @code{while}. De otro modo, el valor devuelto por la funci@'on completa es el valor de la @'ultima expresi@'on que es evaluada en el cuerpo del @code{let}, y este es el valor devuelto por el @code{while} que es siempre @code{nil}.

source: This may not be evident at first sight. It almost looks as if the incrementing expression is the last expression of the whole function. But that expression is part of the body of the @code{while}; it is the last element of the list that starts with the symbol @code{while}. Moreover, the whole of the @code{while} loop is a list within the body of the @code{let}.
es: Esto puede no ser evidente a primera vista. Eso casi se ve como si la expresi@'on de incremento es la @'ultima expresi@'on de la funci@'on completa. Pero esta expresi@'on es parte del cuerpo del @code{while}; eso es el @'ultimo elemento de la lista que empieza con el s@'{@dotless{i}}mbolo @code{while}. M@'as all@'a, el bucle @code{while} completo es una lista con el cuerpo del @code{let}.

source: In outline, the function will look like this:
es: En l@'{@dotless{i}}nea (@emph{outline}), la funci@'on se parece a esto:

source: (defun @var{name-of-function} (@var{argument-list}) "@var{documentation}@dots{}" (let (@var{varlist}) (while (@var{true-or-false-test}) @var{body-of-while}@dots{} ) @dots{} )) ; @r{Need final expression here.}
es: (defun @var{name-of-function} (@var{argument-list}) "@var{documentation}@dots{}" (let (@var{varlist}) (while (@var{true-or-false-test}) @var{body-of-while}@dots{} ) @dots{} )) ; @r{Necesita la expresi@'on final aqu@'{@dotless{i}}.}

source: The result of evaluating the @code{let} is what is going to be returned by the @code{defun} since the @code{let} is not embedded within any containing list, except for the @code{defun} as a whole. However, if the @code{while} is the last element of the @code{let} expression, the function will always return @code{nil}. This is not what we want! Instead, what we want is the value of the variable @code{total}. This is returned by simply placing the symbol as the last element of the list starting with @code{let}. It gets evaluated after the preceding elements of the list are evaluated, which means it gets evaluated after it has been assigned the correct value for the total.
es: El resultado de evaluar el @code{let} es que lo que est@'a yendo para devolver el @code{defun} desde el @code{let} que no est@'a embebido con cualquier lista que contiene, excepto para la @code{defun} como un todo. Sin embargo, si el @code{while} es el @'ultimo elemento de la expresi@'on @code{let}, la funci@'on siempre devolver@'a @code{nil}. @exclamdown{}Esto no es lo que quiero! En vez de eso, lo que queremos es el valor de la variable @code{total}. Eso devuelve simplemente emplazando el s@'{@dotless{i}}mbolo como el @'ultimo elemento de la lista empezando con @code{let}. Eso se eval@'ua despu@'es de los elementos precedentes de la lista evaluada, que significa que eso se evalu@'o despu@'es de haber sido asignado el valor correcto para el total.

source: It may be easier to see this by printing the list starting with @code{let} all on one line. This format makes it evident that the @var{varlist} and @code{while} expressions are the second and third elements of the list starting with @code{let}, and the @code{total} is the last element:
es: Eso puede ser f@'acil de ver imprimiendo la lista empezando con @code{let} todo en una l@'{@dotless{i}}nea. Este formato hace evidente que las expresiones @var{varlist} y @code{while} son el segundo el tercer elementos de la lista empezando con @code{let}, y el @code{total} es el @'ultimo elemento:

source: Putting everything together, the @code{triangle} function definition looks like this:
es: Poniendo cualquier cosa junta, la definici@'on de funci@'on @code{triangle} se parece a esto:

source: (defun triangle (number-of-rows) ; @r{Version with} ; @r{ incrementing counter.} "Add up the number of pebbles in a triangle. The first row has one pebble, the second row two pebbles, the third row three pebbles, and so on. The argument is NUMBER-OF-ROWS."
es: (defun triangle (number-of-rows) ; @r{Versi@'on con} ; @r{ contador de incremento.} "A@~nade el n@'umero de asteriscos en un tri@'angulo. La primera fila tiene un asterisco, la segunda fila dos asteriscos, la tercera fila tres asteriscos, y as@'{@dotless{i}}. El argumento es NUMBER-OF-ROWS."

source: After you have installed @code{triangle} by evaluating the function, you can try it out. Here are two examples:
es: Despu@'es de haber instalado @code{triangle} para evaluar la funci@'on, se puede probar. Aqu@'{@dotless{i}} hay dos ejemplos:

source: The sum of the first four numbers is 10 and the sum of the first seven numbers is 28.
es: La suma del primero de cuatro n@'umeros es 10 y la suma de los primeros siete n@'umeros es 28.

source: Another common way to write a @code{while} loop is to write the test so that it determines whether a counter is greater than zero. So long as the counter is greater than zero, the loop is repeated. But when the counter is equal to or less than zero, the loop is stopped. For this to work, the counter has to start out greater than zero and then be made smaller and smaller by a form that is evaluated repeatedly.
es: Otro camino com@'un para escribir un bucle @code{while} es escribir el test as@'{@dotless{i}} que determina si un contador es mayor que cero. As@'{@dotless{i}} tan largo es el contador mayor que cero, el bucle se repite. Pero cuando el contador es igual o menor que cero, el bucle se para. Para este trabajo, el contador tiene que empezar mayor que cero y entonces se hace m@'as peque@~no y peque@~no por una forma que es evaluada repetidamente.

source: The test will be an expression such as @code{(> counter 0)} which returns @code{t} for true if the value of @code{counter} is greater than zero, and @code{nil} for false if the value of @code{counter} is equal to or less than zero. The expression that makes the number smaller and smaller can be a simple @code{setq} such as @code{(setq counter (1- counter))}, where @code{1-} is a built-in function in Emacs Lisp that subtracts 1 from its argument.
es: El test ser@'a una expresi@'on tal como @code{(> counter 0)} que devuelve @code{t} @emph{cierto} si el valor de @code{counter} es mayor que cero, y @code{nil} @emph{falso} si el valor de @code{counter} es igual a o menor que cero. La expresi@'on hace que el n@'umero menor y menor puede ser un simple @code{setq} tal como @code{(setq counter (1- counter)}, donde @code{1-} es una funci@'on construida en Emacs Lisp que sustrae 1 de su argumento.

source: The template for a decrementing @code{while} loop looks like this:
es: La plantilla para decrementar el bucle @code{while} se ve as@'{@dotless{i}}:

source: (while (> counter 0) ; @r{true-or-false-test} @var{body}@dots{} (setq counter (1- counter))) ; @r{decrementer}
es: (while (> counter 0) ; @r{test-verdadero-o-falso} @var{body}@dots{} (setq counter (1- counter))) ; @r{decremento}

source: Example with decrementing counter
es: Ejemplo con el contador que se decrementa

source: To illustrate a loop with a decrementing counter, we will rewrite the @code{triangle} function so the counter decreases to zero.
es: Para ilustrar un bucle con un contador de decremento, reescribir@'a la funci@'on @code{triangle} as@'{@dotless{i}} como el contador se decrementa a cero.

source: This is the reverse of the earlier version of the function. In this case, to find out how many pebbles are needed to make a triangle with 3 rows, add the number of pebbles in the third row, 3, to the number in the preceding row, 2, and then add the total of those two rows to the row that precedes them, which is 1.
es: Esto es lo inverso de la versi@'on temprana de la funci@'on. En este caso, para encontrar cu@'antos asteriscos son necesarios para crear un tri@'angulo con 3 filas, a@~nade el n@'umero de asteriscos en la tercera fila, 3, para el n@'umero en la fila precedente, 2, y entonces a@~nade el total de estas dos filas a la fila que lo precede, 1.

source: Likewise, to find the number of pebbles in a triangle with 7 rows, add the number of pebbles in the seventh row, 7, to the number in the preceding row, which is 6, and then add the total of those two rows to the row that precedes them, which is 5, and so on. As in the previous example, each addition only involves adding two numbers, the total of the rows already added up and the number of pebbles in the row that is being added to the total. This process of adding two numbers is repeated again and again until there are no more pebbles to add.
es: M@'as all@'a, para encontrar el n@'umero de asteriscos en un tri@'angulo con 7 filas, a@~nade el n@'umero de asteriscos en la fila siete, 7, al n@'umero en la fila precedente, que es 6, y entonces a@~nade el total de estas dos filas a la fila esta que lo precede, que es 5, y as@'{@dotless{i}}. Como en el ejemplo previo, cada adici@'on solo involucra la adici@'on de dos n@'umeros, el total de las filas ya se a@~nadi@'o y el n@'umero de asteriscos en la fila que est@'a siendo a@~nadida al total. Este proceso de a@~nadir dos n@'umeros se repite de nuevo y de nuevo hasta que no haya m@'as asteriscos que a@~nadir.

source: We know how many pebbles to start with: the number of pebbles in the last row is equal to the number of rows. If the triangle has seven rows, the number of pebbles in the last row is 7. Likewise, we know how many pebbles are in the preceding row: it is one less than the number in the row.
es: Sabemos con cu@'antos asteriscos empezar: el n@'umero de asteriscos en la @'ultima fila es igual al n@'umero de filas. Si el tri@'angulo tiene siete filas, el n@'umero de asteriscos en la @'ultima fila es 7. M@'as all@'a, sabemos cu@'antos asteriscos est@'an en la fila precedente: eso es uno menos que el n@'umero en la fila.

source: We start with three variables: the total number of rows in the triangle; the number of pebbles in a row; and the total number of pebbles, which is what we want to calculate. These variables can be named @code{number-of-rows}, @code{number-of-pebbles-in-row}, and @code{total}, respectively.
es: Empezamos con tres variables: el n@'umero total de filas en el tri@'angulo; el n@'umero de asteriscos en una fila; y el n@'umero total de asteriscos, que es lo que queremos calcular. Estas variables pueden llamarse @code{number-of-rows}, @code{number-of-pebbles-in-row}, y @code{total}, respectivamente.

source: Both @code{total} and @code{number-of-pebbles-in-row} are used only inside the function and are declared with @code{let}. The initial value of @code{total} should, of course, be zero. However, the initial value of @code{number-of-pebbles-in-row} should be equal to the number of rows in the triangle, since the addition will start with the longest row.
es: Ambos @code{total} y @code{number-of-pebbles-in-row} se usan solo dentro de la funci@'on y se declaran con @code{let}. El valor inicial de @code{total} ser@'{@dotless{i}}a cero. Sin embargo, el valor inicial de @code{number-of-pebbles-in-row} ser@'{@dotless{i}}a igual al n@'umero de filas en el tri@'angulo, desde la adici@'on empezar@'a con la fila m@'as larga.

source: This means that the beginning of the @code{let} expression will look like this:
es: Esto significa que el principio de la expresi@'on @code{let} se ver@'a as@'{@dotless{i}}:

source: The total number of pebbles can be found by repeatedly adding the number of pebbles in a row to the total already found, that is, by repeatedly evaluating the following expression:
es: El n@'umero total de asteriscos puede encontrarse repetidamente a@~nadiendo el n@'umero de asteriscos en una fila para el total ya encontrado, que, se eval@'ua repetidamente en la siguiente expresi@'on:

source: After the @code{number-of-pebbles-in-row} is added to the @code{total}, the @code{number-of-pebbles-in-row} should be decremented by one, since the next time the loop repeats, the preceding row will be added to the total.
es: Despu@'es el @code{number-of-pebbles-in-row} se a@~nade al @code{total}, el @code{number-of-pebbles-in-row} ser@'{@dotless{i}}a decrementado por uno, desde que la siguiente vez el bucle repite, la fila precedente ser@'a a@~nadida al total.

source: The number of pebbles in a preceding row is one less than the number of pebbles in a row, so the built-in Emacs Lisp function @code{1-} can be used to compute the number of pebbles in the preceding row. This can be done with the following expression:
es: El n@'umero de asteriscos en una fila precedente es uno menos que el n@'umero de asteriscos en una fila, as@'{@dotless{i}} la funci@'on Emacs Lisp construida @code{1-} puede usarse para computar el n@'umero de asteriscos de la fila precedente. Esto puede ser hecho con la siguiente expresi@'on:

source: Finally, we know that the @code{while} loop should stop making repeated additions when there are no pebbles in a row. So the test for the @code{while} loop is simply:
es: Finalmente, sabemos que el bucle @code{while} parar@'{@dotless{i}}a creando repetidas adiciones cuando no hay asteriscos en una fila. As@'{@dotless{i}} el test para el bucle @code{while} es simple:

source: We can put these expressions together to create a function definition that works. However, on examination, we find that one of the local variables is unneeded!
es: Se pueden poner estas expresiones juntas para crear una definici@'on de funci@'on que funcione. Sin embargo, al examinarlas, encontraremos que una de la variables locales @exclamdown{}es innecesaria!

source: The function definition looks like this:
es: La definici@'on de funci@'on se ve como esto:

source: ;;; @r{First subtractive version.} (defun triangle (number-of-rows) "Add up the number of pebbles in a triangle." (let ((total 0) (number-of-pebbles-in-row number-of-rows)) (while (> number-of-pebbles-in-row 0) (setq total (+ total number-of-pebbles-in-row)) (setq number-of-pebbles-in-row (1- number-of-pebbles-in-row))) total))
es: ;;; @r{Primero la versi@'on substractiva.} (defun triangle (number-of-rows) "A@~nade el n@'umero de asteriscos en un tri@'angulo." (let ((total 0) (number-of-pebbles-in-row number-of-rows)) (while (> number-of-pebbles-in-row 0) (setq total (+ total number-of-pebbles-in-row)) (setq number-of-pebbles-in-row (1- number-of-pebbles-in-row))) total))

source: As written, this function works.
es: Como se dijo, esta funci@'on funciona.

source: However, we do not need @code{number-of-pebbles-in-row}.
es: Sin embargo, no se necesita @code{number-of-pebbles-in-row}.

source: Argument as local variable
es: Argumento como variable local

source: When the @code{triangle} function is evaluated, the symbol @code{number-of-rows} will be bound to a number, giving it an initial value. That number can be changed in the body of the function as if it were a local variable, without any fear that such a change will effect the value of the variable outside of the function. This is a very useful characteristic of Lisp; it means that the variable @code{number-of-rows} can be used anywhere in the function where @code{number-of-pebbles-in-row} is used.
es: Cuando la funci@'on @code{triangle} se eval@'ua, el s@'{@dotless{i}}mbolo @code{number-of-rows} ser@'a asociado al n@'umero, dando un valor inicial. Este n@'umero puede ser cambiado en el cuerpo de la funci@'on si hubiera una variable local, sin miedo de que tal cambio se efectuar@'a el valor de la variable fuera de la funci@'on. Esto es una caracter@'{@dotless{i}}stica muy @'util de Lisp; eso significa que la variable @code{number-of-rows} puede ser usada en cualquier lugar en la funci@'on donde @code{number-of-pebbles-in-row} se usa.

source: Here is a second version of the function written a bit more cleanly:
es: Aqu@'{@dotless{i}} hay una segunda versi@'on de la funci@'on escrita un poco m@'as limpiamente:
