Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Two @code{while} loops follow. The first @code{while} has a true-or-false-test that tests true if the prefix argument for @code{forward-sentence} is a negative number. This is for going backwards. The body of this loop is similar to the body of the second @code{while} clause, but it is not exactly the same. We will skip this @code{while} loop and concentrate on the second @code{while} loop.
es: Sigue dos bucles @code{while}. El primer @code{while} tiene un true-or-false-test que chequea cierto si el argumento prefijo para @code{forward-sentence} es un n@'umero negativo. Esto es para volver hacia atr@'as. El cuerpo de este bucle es similar al cuerpo de la segunda cl@'ausula @code{while}, pero eso no es exactamente el mismo. Se obviar@'a este bucle @code{while} y concentra en el segundo bucle @code{while}.

source: The second @code{while} loop is for moving point forward. Its skeleton looks like this:
es: El segundo bucle @code{while} est@'a moviendo el punto hacia adelante. Su esqueleto se parece a esto:

source: The @code{while} loop is of the decrementing kind. (@xref{Decrementing Loop, , A Loop with a Decrementing Counter}.) It has a true-or-false-test that tests true so long as the counter (in this case, the variable @code{arg}) is greater than zero; and it has a decrementer that subtracts 1 from the value of the counter every time the loop repeats.
es: El bucle @code{while} es el tipo de decremento. (@xref{Bucle que se decrementa, , Un Bucle con un Contador de Decremento}.) Eso tiene un true-or-false-test que chequea cierto tan largo con el contador (en este caso, la variable @code{arg}) es mayor que cero; y eso tiene un decremento que elimina 1 desde el valor del contador cada vez que el bucle se repite.

source: If no prefix argument is given to @code{forward-sentence}, which is the most common way the command is used, this @code{while} loop will run once, since the value of @code{arg} will be 1.
es: Si ning@'un argumento prefijo es dado para @code{forward-sentece}, que es el camino m@'as com@'un es usado, este bucle @code{while} ejecutar@'a una vez, desde que el valor de @code{arg} ser@'a 1.

source: The body of the @code{while} loop consists of a @code{let} expression, which creates and binds a local variable, and has, as its body, an @code{if} expression.
es: El cuerpo del cuerpo @code{while} consite de una expresi@'on @code{let}, que crea y asocia una variable local, y tiene, su cuerpo, una expresi@'on @code{if}.

source: The body of the @code{while} loop looks like this:
es: El cuerpo del bucle @code{while} se parece a esto:

source: The @code{let} expression creates and binds the local variable @code{par-end}. As we shall see, this local variable is designed to provide a bound or limit to the regular expression search. If the search fails to find a proper sentence ending in the paragraph, it will stop on reaching the end of the paragraph.
es: La expresi@'on @code{let} crea y asocia la variable local @code{par-end}. Como se ve, esta variable local est@'a dise@~nada para proporcionar una asociaci@'on o l@'{@dotless{i}}mite para la b@'usqueda de la expresi@'on regular. Si la b@'usqueda falla para encontrar una frase apropiada finalizando en el p@'arrafo, eso se parar@'a logrando el fin del p@'arrafo.

source: But first, let us examine how @code{par-end} is bound to the value of the end of the paragraph. What happens is that the @code{let} sets the value of @code{par-end} to the value returned when the Lisp interpreter evaluates the expression
es: Pero primero, perm@'{@dotless{i}}tenos examinar c@'omo @code{par-end} se asocia a la variable del fin del p@'arrafo. Lo que ocurre es que el @code{let} asigna el valor de @code{par-end} al valor devuelto cuando el int@'erprete eval@'ua la expresi@'on.

source: In this expression, @code{(end-of-paragraph-text)} moves point to the end of the paragraph, @code{(point)} returns the value of point, and then @code{save-excursion} restores point to its original position. Thus, the @code{let} binds @code{par-end} to the value returned by the @code{save-excursion} expression, which is the position of the end of the paragraph. (The @code{end-of-paragraph-text} function uses @code{forward-paragraph}, which we will discuss shortly.)
es: En esta expresi@'on, @code{(end-of-paragraph-text)} mueve el punto al fin del p@'arrafo, @code{(point)} devuelve el valor del punto, y entonces @code{save-excursion} restaura el punto a su posici@'on original. De este modo, el @code{let} asocia @code{par-end} al valor devuelto por la expresi@'on @code{save-excursion}, que es la posici@'on del fin del p@'arrafo. (La funci@'on @code{end-of-paragraph-text} usa @code{forward-paragraph}, que se discutir@'a pronto.)

source: Emacs next evaluates the body of the @code{let}, which is an @code{if} expression that looks like this:
es: Emacs eval@'ua el cuerpo del @code{let}, que es una expresi@'on @code{if} que se parece a esto:

source: The @code{if} tests whether its first argument is true and if so, evaluates its then-part; otherwise, the Emacs Lisp interpreter evaluates the else-part. The true-or-false-test of the @code{if} expression is the regular expression search.
es: El test @code{if} si su primer argumento es cierto y si as@'{@dotless{i}}, eval@'ua su parte then; de otro modo, el int@'erprete Emacs Lisp eval@'ua la parte else. El true-or-false-test de la expresi@'on @code{if} es la b@'usqueda de la expresi@'on regular.

source: It may seem odd to have what looks like the `real work' of the @code{forward-sentence} function buried here, but this is a common way this kind of operation is carried out in Lisp.
es: Puede estar mal tener que mirar como el `trabajo real' de la funci@'on @code{forward-sentence} es vista aqu@'{@dotless{i}}, pero esto es un camino com@'un de este tipo de operaci@'on traida en Lisp.

source: The regular expression search
es: La b@'usqueda de expresiones regulares

source: The @code{re-search-forward} function searches for the end of the sentence, that is, for the pattern defined by the @code{sentence-end} regular expression. If the pattern is found---if the end of the sentence is found---then the @code{re-search-forward} function does two things:
es: La funci@'on @code{re-search-forward} busca el fin de la frase, que es, para el patr@'on definido por la expresi@'on regular @code{sentence-end}. Si el patr@'on es encontrado --- si el fin de la frase se encuentra --- entonces la funci@'on @code{re-search-forward} hace dos cosas:

source: The @code{re-search-forward} function carries out a side effect, which is to move point to the end of the occurrence found.
es: La funci@'on @code{re-search-forward} trae un efecto lateral, que es mover el punto al final de la ocurrencia encontrada.

source: The @code{re-search-forward} function returns a value of true. This is the value received by the @code{if}, and means that the search was successful.
es: La funci@'on @code{re-search-forward} devuelve un valor de verdad. Esto es el valor recibido por el @code{if}, y significa que la b@'usqueda fu@'e exitosa.

source: The side effect, the movement of point, is completed before the @code{if} function is handed the value returned by the successful conclusion of the search.
es: El efecto lateral, el movimiento del punto se completa antes de la funci@'on @code{if} y es manejado por el valor devuelto por la exitosa conclusi@'on de la b@'usqueda.

source: When the @code{if} function receives the value of true from a successful call to @code{re-search-forward}, the @code{if} evaluates the then-part, which is the expression @code{(skip-chars-backward " \t\n")}. This expression moves backwards over any blank spaces, tabs or carriage returns until a printed character is found and then leaves point after the character. Since point has already been moved to the end of the pattern that marks the end of the sentence, this action leaves point right after the closing printed character of the sentence, which is usually a period.
es: Cuando la funci@'on @code{if} recibe el valor de verdad desde una llamada exitosa a @code{re-search-forward}, el @code{if} eval@'ua la parte then que es la expresi@'on @code{(skip-chars-backward "\t\n")}. Esta expresi@'on se mueve atr@'as a trav@'es de espacios en blanco, los tabuladores o retornos de carro hasta un caracter impreso es encontrado y entonces deja el punto correcto despu@'es del caracter impreso cerrado de la frase, que es normalmente un periodo.

source: On the other hand, if the @code{re-search-forward} function fails to find a pattern marking the end of the sentence, the function returns false. The false then causes the @code{if} to evaluate its third argument, which is @code{(goto-char par-end)}: it moves point to the end of the paragraph.
es: Por otro lado, si la funci@'on @code{re-search-forward} falla para encontrar un patr@'on marcando el fin de la frase, la funci@'on devuelve falso. Lo falso causa el @code{if} para evaluar su tercer argumento, que es @code{(goto-char par-end)}: eso mueve el punto al final del p@'arrafo.

source: (And if the text is in a form or equivalent, and point may not move fully, then the @code{constrain-to-field} function comes into play.)
es: (Y si el texto est@'a en una forma o equivalente, y apunta a que no puede moverse completamente entonces la funci@'on @code{constrain-to-field} empieza a funcionar.)

source: Regular expression searches are exceptionally useful and the pattern illustrated by @code{re-search-forward}, in which the search is the test of an @code{if} expression, is handy. You will see or write code incorporating this pattern often.
es: Las b@'usquedas de expresiones regulares son excepcionalmente @'utiles y el patr@'on ilustrado por @code{re-search-forward}, en el que la b@'usqueda es el test de una expresi@'on @code{if}, es manejable. Se ver@'a o escribir@'a c@'odigo incorporando este patr@'on con frecuencia.

source: The @code{forward-paragraph} function moves point forward to the end of the paragraph. It is usually bound to @kbd{M-@}} and makes use of a number of functions that are important in themselves, including @code{let*}, @code{match-beginning}, and @code{looking-at}.
es: La funci@'on @code{forward-paragraph} mueve el punto al fin del p@'arrafo. Eso est@'a normalmente asociado a @kbd{M-@}} y hace uso de un n@'umero de funciones que son importantes en s@'{@dotless{i}}, incluyendo @code{let*}, @code{match-beginning}, y @code{looking-at}.

source: The function definition for @code{forward-paragraph} is considerably longer than the function definition for @code{forward-sentence} because it works with a paragraph, each line of which may begin with a fill prefix.
es: La definici@'on de funci@'on para @code{forward-paragraph} es considerablemente mayor que la definici@'on de funci@'on para @code{forward-sentence} porque eso funciona como un p@'arrafo, cada l@'{@dotless{i}}nea puede empezar con un prefijo de relleno @emph{fill prefix}.

source: A fill prefix consists of a string of characters that are repeated at the beginning of each line. For example, in Lisp code, it is a convention to start each line of a paragraph-long comment with @samp{;;; }. In Text mode, four blank spaces make up another common fill prefix, creating an indented paragraph. (@xref{Fill Prefix, , , emacs, The GNU Emacs Manual}, for more information about fill prefixes.)
es: Un prefijo de relleno @emph{fill prefix} consiste en una cadena de caracteres que se repite al principio de cada l@'{@dotless{i}}nea. Por ejemplo, en c@'odigo Lisp, es una convenci@'on para empezar cada l@'{@dotless{i}}nea de un comentario de p@'arrafo largo con @samp{;;; }. En modo Texto, cuatro espacios en blanco crean otro prefijo de relleno @emph{fill prefix} com@'un, creando un p@'arrafo indentado. (@xref{Fill Prefix, , , emacs, The GNU Emacs Manual} para m@'as informaci@'on acerca de prefijos de relleno @emph{fill prefix}.)

source: The existence of a fill prefix means that in addition to being able to find the end of a paragraph whose lines begin on the left-most column, the @code{forward-paragraph} function must be able to find the end of a paragraph when all or many of the lines in the buffer begin with the fill prefix.
es: La existencia de un prefijo de relleno significa que adem@'as de ser capaz de encontrar el fin de un p@'arrafo cuyas l@'{@dotless{i}}neas empiezan m@'as a la izquierda, la funci@'on @code{forward-paragraph} debe ser capaz de encontrar el fin de un p@'arrafo cuando todas o muchas de las l@'{@dotless{i}}neas en el b@'uffer empiezan con el prefijo de relleno @emph{fill prefix}.

source: Moreover, it is sometimes practical to ignore a fill prefix that exists, especially when blank lines separate paragraphs. This is an added complication.
es: M@'as all@'a, es algunas veces pr@'actico ignorar un prefijo de relleno @emph{fill prefix} que existe, especialmente cuando las l@'{@dotless{i}}neas en blanco separen p@'arrafos. Esto es una complicaci@'on a@~nadida.

source: Shortened @code{forward-paragraph} function definition
es: Definici@'on de funci@'on @code{forward-paragraph}

source: Rather than print all of the @code{forward-paragraph} function, we will only print parts of it. Read without preparation, the function can be daunting!
es: En vez de imprimir toda la funci@'on @code{forward-paragraph}, nosotros solo imprimiremos partes de la misma. @exclamdown{}Lee sin preparaci@'on, la funci@'on puede estar para desanimar!

source: In outline, the function looks like this:
es: En esquema, la funci@'on se parece a esto:

source: The first parts of the function are routine: the function's argument list consists of one optional argument. Documentation follows.
es: Las primeras partes de la funci@'on son rutinas: la funci@'on lista argumentos que consisten de un argumento opcional. La documentaci@'on sigue.

source: The lower case @samp{p} in the @code{interactive} declaration means that the processed prefix argument, if any, is passed to the function. This will be a number, and is the repeat count of how many paragraphs point will move. The @code{or} expression in the next line handles the common case when no argument is passed to the function, which occurs if the function is called from other code rather than interactively. This case was described earlier. (@xref{forward-sentence, The @code{forward-sentence} function}.) Now we reach the end of the familiar part of this function.
es: La letra min@'uscula @samp{p} en la declaraci@'on @code{interactive} significa que el argumento prefijo se procesa, si se pasa a la funci@'on. Eso ser@'a un n@'umero, y es el contaje repetido de cu@'antos p@'arrafos se mover@'a. La expresi@'on @code{or} en la siguiente l@'{@dotless{i}}nea maneja el caso com@'un cuando no hay argumentos que se pasan a la funci@'on, esto ocurre si la funci@'on se llama desde otro c@'odigo en vez de interactivamente. Este caso se describe pronto. (@xref{forward-sentence, La funci@'on @code{forward-sentence}}.) Ahora se logra el fin de la parte familiar de esta funci@'on.

source: The @code{let*} expression
es: La expresi@'on @code{let*}

source: The next line of the @code{forward-paragraph} function begins a @code{let*} expression. This is a different than @code{let}. The symbol is @code{let*} not @code{let}.
es: La siguiente l@'{@dotless{i}}nea de la funci@'on @code{forward-paragraph} empieza una expresi@'on @code{let*}. Esto es tan diferente como @code{let}. El s@'{@dotless{i}}mbolo es @code{let*} no @code{let}.

source: The @code{let*} special form is like @code{let} except that Emacs sets each variable in sequence, one after another, and variables in the latter part of the varlist can make use of the values to which Emacs set variables in the earlier part of the varlist.
es: La forma especial @code{let*} es como @code{let} excepto que Emacs asigna cada variable en secuencia, una despu@'es de otra, y las variables en la @'ultima parte de la varlist hacen uso de los valores para los que Emacs asign@'o variable al principio la varlist.

source: (@ref{append save-excursion, , @code{save-excursion} in @code{append-to-buffer}}.)
es: (@ref{append save-excursion, , @code{save-excursion} en @code{append-to-buffer}}.)

source: In the @code{let*} expression in this function, Emacs binds a total of seven variables: @code{opoint}, @code{fill-prefix-regexp}, @code{parstart}, @code{parsep}, @code{sp-parstart}, @code{start}, and @code{found-start}.
es: En la expresi@'on @code{let*} en esta funci@'on, Emacs asigna un total de siete variables: @code{opoint}, @code{fill-prefix-regexp}, @code{parstart}, @code{parsep}, @code{sp-parstart}, @code{start}, y @code{found-start}.

source: The variable @code{parsep} appears twice, first, to remove instances of @samp{^}, and second, to handle fill prefixes.
es: La variable @code{parsep} aparece dos veces, primero, para borrar instancias de @samp{^}, y segundo, para manejar prefijos rellenos.

source: The variable @code{opoint} is just the value of @code{point}. As you can guess, it is used in a @code{constrain-to-field} expression, just as in @code{forward-sentence}.
es: La variable @code{opoint} es solo el valor de @code{point}. Como se puede adivinar, eso se usa en una expresi@'on @code{constrain-to-field}, solo como en @code{forward-sentence}.

source: The variable @code{fill-prefix-regexp} is set to the value returned by evaluating the following list:
es: La variable @code{fill-prefix-regexp} se asigna al valor devuelto para evaluar la siguiente lista:

source: This is an expression whose first element is the @code{and} special form.
es: Esta es una expresi@'on cuyo primer elemento es la forma especial @code{and}.

source: As we learned earlier (@pxref{kill-new function, , The @code{kill-new} function}), the @code{and} special form evaluates each of its arguments until one of the arguments returns a value of @code{nil}, in which case the @code{and} expression returns @code{nil}; however, if none of the arguments returns a value of @code{nil}, the value resulting from evaluating the last argument is returned. (Since such a value is not @code{nil}, it is considered true in Lisp.) In other words, an @code{and} expression returns a true value only if all its arguments are true.
es: Como se aprendi@'o antes la (@pxref{Funci@'on kill-new, , La funci@'on @code{kill-new}}), la forma especial @code{and} eval@'ua cada uno de sus argumentos hasta uno de los argumentos y devuelve un valor de @code{nil} en el que el caso de la expresi@'on @code{and} devuelve @code{nil}; sin embargo, si ninguno de los argumentos devuelve un valor de @code{nil}, el valor resultante de evaluar el @'ultimo argumento es devuelto. (Puesto que tal valor no es @code{nil}, eso es considerado verdad en Lisp.) En otras palabras, una expresi@'on @code{and} devuelve un valor de verdad solo si todos sus argumentos son verdad.

source: In this case, the variable @code{fill-prefix-regexp} is bound to a non-@code{nil} value only if the following four expressions produce a true (i.e., a non-@code{nil}) value when they are evaluated; otherwise, @code{fill-prefix-regexp} is bound to @code{nil}.
es: En este caso, la variable @code{fill-prefix-regexp} est@'a asociado a un valor no @code{nil} solo si el las siguientes cuatro expresiones producen un valor true (por ej., un no @code{nil}) cuando son evaluados; de otro modo, @code{fill-prefix-regexp} est@'a asociado a @code{nil}.

source: When this variable is evaluated, the value of the fill prefix, if any, is returned. If there is no fill prefix, this variable returns @code{nil}.
es: Cuando esta variable se eval@'ua, el valor del prefijo de relleno @emph{fill prefix}, si cualquiera, est@'a devuelto. Si no hay prefijo relleno, la variable devuelve @code{nil}.

source: This expression checks whether an existing fill prefix is an empty string, that is, a string with no characters in it. An empty string is not a useful fill prefix.
es: Esta expresi@'on chequea si un prefijo lleno es una cadena vac@'{@dotless{i}}a, que es, una cadena sin caracteres en eso. Una cadena vac@'{@dotless{i}}a no es @'util un prefijo relleno @emph{fill prefix}.

source: This expression returns @code{nil} if the variable @code{paragraph-ignore-fill-prefix} has been turned on by being set to a true value such as @code{t}.
es: Esta expresi@'on devuelve @code{nil} si la variable @code{paragraph-ignore-fill-prefix} ha sido cambiado siendo asignado un valor de verdad tal como @code{t}.

source: This is the last argument to the @code{and} special form. If all the arguments to the @code{and} are true, the value resulting from evaluating this expression will be returned by the @code{and} expression and bound to the variable @code{fill-prefix-regexp},
es: Este es el @'ultimo argumento para la forma especial @code{and}. Si todos los argumentos de @code{and} son verdaderos, el valor resultante de evaluar esta expresi@'on ser@'a devuelto por la expresi@'on @code{and} y asociado a la variable @code{fill-prefix-regexp},

source: The result of evaluating this @code{and} expression successfully is that @code{fill-prefix-regexp} will be bound to the value of @code{fill-prefix} as modified by the @code{regexp-quote} function. What @code{regexp-quote} does is read a string and return a regular expression that will exactly match the string and match nothing else. This means that @code{fill-prefix-regexp} will be set to a value that will exactly match the fill prefix if the fill prefix exists. Otherwise, the variable will be set to @code{nil}.
es: El resultado de evaluar esta expresi@'on @code{and} con @'exito es que @code{fill-prefix-regexp} se asociar@'a al valor de @code{fill-prefix} como fu@'e modificado por la funci@'on @code{regexp-quote}. Lo que @code{regexp-quote} hace es leer una cadena y devolver la expresi@'on regular que asociar@'a exactamente la cadena y nada m@'as. Esto significa que @code{fill-prefix-regexp} ser@'a asignada a un valor que asociar@'a el prefijo si el prefijo existe. De otro modo, la variable ser@'a asignada a @code{nil}.

source: The next two local variables in the @code{let*} expression are designed to remove instances of @samp{^} from @code{parstart} and @code{parsep}, the local variables which indicate the paragraph start and the paragraph separator. The next expression sets @code{parsep} again. That is to handle fill prefixes.
es: Las dos variables locales siguientes en la expresi@'on @code{let*} est@'an dise@~nadas para eliminar instancias de @samp{^} desde @code{parstart} y @code{parsep}, las variables locales indican que el p@'arrafo empieza como separador de p@'arrafo. La siguiente expresi@'on asigna @code{parsep} de nuevo. Esto es manejar prefijos rellenos.

source: This is the setting that requires the definition call @code{let*} rather than @code{let}. The true-or-false-test for the @code{if} depends on whether the variable @code{fill-prefix-regexp} evaluates to @code{nil} or some other value.
es: Esta es la configuraci@'on que requiere la llamada de la definici@'on @code{let*} en vez de @code{let}. El true-or-false-test para el @code{if} depende de si la variable @code{fill-prefix-regexp} eval@'ua a @code{nil} o alg@'un otro valor.

source: If @code{fill-prefix-regexp} does not have a value, Emacs evaluates the else-part of the @code{if} expression and binds @code{parsep} to its local value. (@code{parsep} is a regular expression that matches what separates paragraphs.)
es: Si @code{fill-prefix-regexp} no tiene un valor, Emacs eval@'ua la parte else de la expresi@'on @code{if} y asocia @code{parsep} a su valor local. (@code{parsep} es una expresi@'on regular que asocia lo que los p@'arrafos separan.)
