Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The @code{print-elements-recursively} function first tests whether there is any content in the list; if there is, the function prints the first element of the list, the @sc{car} of the list. Then the function `invokes itself', but gives itself as its argument, not the whole list, but the second and subsequent elements of the list, the @sc{cdr} of the list.
es: La funci@'on @code{print-elements-recursively} primero chequea si hay cualquier contenido en la lista; si lo hay, la funci@'on imprime el primer elemento de la lista, el @sc{car} de la lista. Entonces la funci@'on se `invoca en s@'{@dotless{i}}', pero da a s@'{@dotless{i}} mismo como su argumento, no la lista completa, pero el segundo y subsiguientes elementos de la lista, el @sc{cdr} de la lista.

source: Put another way, if the list is not empty, the function invokes another instance of code that is similar to the initial code, but is a different thread of execution, with different arguments than the first instance.
es: Pon otro camino, si la lista no est@'a vac@'{@dotless{i}}a, la funci@'on invoca otra instancia de c@'odigo que es similar al c@'odigo inicial, pero es un hilo diferente de ejecuci@'on, con diferentes argumentos a la primera instancia.

source: Put in yet another way, if the list is not empty, the first robot assembles a second robot and tells it what to do; the second robot is a different individual from the first, but is the same model.
es: Veamos una manera m@'as, si la lista no est@'a vac@'{@dotless{i}}a, el primer robot ensambla un segundo robot que cuenta qu@'e hacer; el segundo robot es un individuo diferente desde el principio, pero es el mismo modelo.

source: When the second evaluation occurs, the @code{when} expression is evaluated and if true, prints the first element of the list it receives as its argument (which is the second element of the original list). Then the function `calls itself' with the @sc{cdr} of the list it is invoked with, which (the second time around) is the @sc{cdr} of the @sc{cdr} of the original list.
es: Cuando la segunda evaluaci@'on ocurre, la expresi@'on @code{when} se eval@'ua y si es verdad, se imprime el primer elemento de la lista que recibe como su argumento (que es el segundo elemento de la lista original). Entonces la funci@'on `llamarse a s@'{@dotless{i}} mismo' con la @sc{cdr} del @sc{cdr} de la lista original.

source: Note that although we say that the function `calls itself', what we mean is that the Lisp interpreter assembles and instructs a new instance of the program. The new instance is a clone of the first, but is a separate individual.
es: Note que aunque nosotros decimos que la funci@'on `se llama a s@'{@dotless{i}} misma', lo que significa es que el int@'erprete Lisp ensambla e instruye una nueva instancia del programa. La nueva instancia es un clon del primero, pero es un individuo separado.

source: Each time the function `invokes itself', it invokes itself on a shorter version of the original list. It creates a new instance that works on a shorter list.
es: Cada vez que la funci@'on `se invoca a s@'{@dotless{i}} misma', se invoca a s@'{@dotless{i}} misma en una versi@'on de la lista original. Eso crea una nueva instancia que funciona como una lista ordenada.

source: Eventually, the function invokes itself on an empty list. It creates a new instance whose argument is @code{nil}. The conditional expression tests the value of @code{list}. Since the value of @code{list} is @code{nil}, the @code{when} expression tests false so the then-part is not evaluated. The function as a whole then returns @code{nil}.
es: Finalmente, la funci@'on se invoca a s@'{@dotless{i}} misma en una lista vac@'{@dotless{i}}a. Eso crea una nueva instancia cuyo argumento es @code{nil}. La expresi@'on condicional chequea el valor de @code{lista}. Desde el valor de @code{lista} a @code{nil}, la expresi@'on @code{when} devuelve falso as@'{@dotless{i}} la then-part no est@'a evaluada. La funci@'on es como un todo que entonces devuelve @code{nil}.

source: When you evaluate the expression @code{(print-elements-recursively animals)} in the @file{*scratch*} buffer, you see this result:
es: Cuando se eval@'ua la expresi@'on @code{(print-elements-recursively animals)} en el b@'uffer @file{*scratch*}, se ver@'a este resultado:

source: Recursive triangle function
es: Funci@'on recursiva tri@'angulo

source: The @code{triangle} function described in a previous section can also be written recursively. It looks like this:
es: La funci@'on @code{triangle} describe en una secci@'on previa si puede ser escrita recursivamente. Se ve as@'{@dotless{i}}:

source: You can install this function by evaluating it and then try it by evaluating @code{(triangle-recursively 7)}. (Remember to put your cursor immediately after the last parenthesis of the function definition, before the comment.) The function evaluates to 28.
es: Se puede instalar esta funci@'on evaluando y entonces se intenta evaluar @code{(triangle-recursively 7)}. (Recuerda poner tu cursor inmediatamente despu@'es de los @'ultimos par@'entesis de la definici@'on de la funci@'on, antes del comentario.) La funci@'on se eval@'ua a 28.

source: To understand how this function works, let's consider what happens in the various cases when the function is passed 1, 2, 3, or 4 as the value of its argument.
es: Para comprender c@'omo funciona la funci@'on, hay que considerar qu@'e ocurre en varios casos cuando la funci@'on se le pasa 1, 2, 3, o 4 como el valor a su argumento.

source: Recursive Example arg of 1 or 2
es: Ejemplo recursivo y argumento con valor 1 o 2

source: An argument of 1 or 2
es: Un argumento de 1 o 2

source: First, what happens if the value of the argument is 1?
es: Primero, veamos qu@'e ocurre si el valor del argumento es 1.

source: The function has an @code{if} expression after the documentation string. It tests whether the value of @code{number} is equal to 1; if so, Emacs evaluates the then-part of the @code{if} expression, which returns the number 1 as the value of the function. (A triangle with one row has one pebble in it.)
es: La funci@'on tiene una expresi@'on @code{if} despu@'es de la cadena de documentaci@'on. Esto chequea si el valor de @code{number} es igual a 1; si es as@'{@dotless{i}}, Emacs eval@'ua la then-part de la expresi@'on @code{if}, que devuelve el n@'umero 1 como el valor de la funci@'on. (Un tri@'angulo con una fila tiene un asterisco dentro.)

source: Suppose, however, that the value of the argument is 2. In this case, Emacs evaluates the else-part of the @code{if} expression.
es: Sup@'on, sin embargo, que el valor del argumento es 2. En este caso, Emacs eval@'ua la parte else de la expresi@'on @code{if}.

source: The else-part consists of an addition, the recursive call to @code{triangle-recursively} and a decrementing action; and it looks like this:
es: La parte else consiste de una adici@'on, la llamada recursiva para @code{triangle-recursively} y una acci@'on de decremento; y se ve as@'{@dotless{i}}:

source: When Emacs evaluates this expression, the innermost expression is evaluated first; then the other parts in sequence. Here are the steps in detail:
es: Cuando Emacs eval@'ua esta expresi@'on, la expresi@'on interna es evaluada primero; entonces las otras partes en secuencia. Aqu@'{@dotless{i}} est@'an los pasos en detalle:

source: Step 1 @w{ } Evaluate the innermost expression.
es: Paso 1 @w{ } Eval@'ua la expresi@'on interna.

source: The innermost expression is @code{(1- number)} so Emacs decrements the value of @code{number} from 2 to 1.
es: La expresi@'on interna es @code{(1- number)} as@'{@dotless{i}} Emacs decrementa el valor de @code{number} desde 2 a 1.

source: Step 2 @w{ } Evaluate the @code{triangle-recursively} function.
es: Paso 2 @w{ } Eval@'ua la funci@'on @code{triangle-recursively}.

source: The Lisp interpreter creates an individual instance of @code{triangle-recursively}. It does not matter that this function is contained within itself. Emacs passes the result Step 1 as the argument used by this instance of the @code{triangle-recursively} function
es: El int@'erprete Lisp crea una instancia individual de @code{triangle-recursively}. Eso no importa que esta funci@'on est@'a contenida con s@'{@dotless{i}} misma. Emacs pasa el resultado Paso 1 como el argumento usado por esta instancia de la funci@'on @code{triangle-recursively}

source: In this case, Emacs evaluates @code{triangle-recursively} with an argument of 1. This means that this evaluation of @code{triangle-recursively} returns 1.
es: En este caso, Emacs eval@'ua @code{triangle-recursively} con un argumento de 1. Esto significa que esta evaluaci@'on de @code{triangle-recursively} devuelve 1.

source: Step 3 @w{ } Evaluate the value of @code{number}.
es: Paso 3 @w{ } Eval@'ua el valor de @code{number}.

source: The variable @code{number} is the second element of the list that starts with @code{+}; its value is 2.
es: La variable @code{number} es el segundo elemento de la lista que empieza con @code{+}; su valor es 2.

source: Step 4 @w{ } Evaluate the @code{+} expression.
es: Paso 4 @w{ } Eval@'ua la expresi@'on @code{+}.

source: The @code{+} expression receives two arguments, the first from the evaluation of @code{number} (Step 3) and the second from the evaluation of @code{triangle-recursively} (Step 2).
es: La expresi@'on @code{+} recibe dos argumentos, el primero desde la evaluaci@'on de @code{number} (Paso 3) y el segundo desde la evaluaci@'on de @code{triangle-recursively} (Paso 2).

source: The result of the addition is the sum of 2 plus 1, and the number 3 is returned, which is correct. A triangle with two rows has three pebbles in it.
es: El resultado de la adici@'on es la suma de 2 + 1, y el n@'umero 3 es devuelto, que es correcto. Un tri@'angulo con dos filas tiene tres asteriscos ah@'{@dotless{i}}.

source: An argument of 3 or 4
es: Un argumento de 3 o 4

source: Suppose that @code{triangle-recursively} is called with an argument of 3.
es: Sup@'on que @code{triangle-recursively} es llamado con un argumento de 3.

source: Step 1 @w{ } Evaluate the do-again-test.
es: Paso 1 @w{ } Eval@'ua la do-again-test.

source: The @code{if} expression is evaluated first. This is the do-again test and returns false, so the else-part of the @code{if} expression is evaluated. (Note that in this example, the do-again-test causes the function to call itself when it tests false, not when it tests true.)
es: La expresi@'on @code{if} se eval@'ua primero. Esto es el test do-again y devuelve falso, as@'{@dotless{i}} la parte else de la expresi@'on @code{if} es evaluada. (Note que en este ejemplo, el do-again-test causa la funci@'on para llamarse a s@'{@dotless{i}} misma cuando eso se chequea como falso, no cuando eso se chequea como verdadero.)

source: Step 2 @w{ } Evaluate the innermost expression of the else-part.
es: Paso 2 @w{ } Eval@'ua la expresi@'on propia de la parte else.

source: The innermost expression of the else-part is evaluated, which decrements 3 to 2. This is the next-step-expression.
es: La expresi@'on propia de la parte que es evaluada, decrementa 3 a 2. Esta la next-step-expression.

source: Step 3 @w{ } Evaluate the @code{triangle-recursively} function.
es: Paso 3 @w{ } Eval@'ua la funci@'on @code{triangle-recursively}.

source: The number 2 is passed to the @code{triangle-recursively} function.
es: El n@'umero 2 es pasado a la funci@'on @code{triangle-recursively}.

source: We already know what happens when Emacs evaluates @code{triangle-recursively} with an argument of 2. After going through the sequence of actions described earlier, it returns a value of 3. So that is what will happen here.
es: Nosotros ya sabemos qu@'e ocurre cuando Emacs eval@'ua @code{triangle-recursively} con un argumento de 2. Despu@'es de ir a trav@'es de la secuencia de acciones descritas temprano, eso devuelve un valor de 3. As@'{@dotless{i}} que es lo que ocurrir@'a aqu@'{@dotless{i}}.

source: Step 4 @w{ } Evaluate the addition.
es: Paso 4 @w{ } Eval@'ua la adici@'on.

source: 3 will be passed as an argument to the addition and will be added to the number with which the function was called, which is 3.
es: 3 ser@'a pasado como un argumento para la adici@'on y ser@'a a@~nadido al n@'umero con el que la funci@'on se llam@'o, que es 3.

source: The value returned by the function as a whole will be 6.
es: El valor devuelto por la funci@'on como un todo ser@'a 6.

source: Now that we know what will happen when @code{triangle-recursively} is called with an argument of 3, it is evident what will happen if it is called with an argument of 4:
es: Ahora que sabemos qu@'e ocurrir@'a cuando @code{triangle-recursively} llama con un argumento 3, es evidente lo que ocurrir@'a si se llama con el argumento 4:

source: In the recursive call, the evaluation of
es: En la llamada recursiva, la evaluaci@'on de

source: will return the value of evaluating
es: devuelve el valor de evaluar

source: which is 6 and this value will be added to 4 by the addition in the third line.
es: que es 6 este valor ser@'a a@~nadido a 4 por la adici@'on en la tercera l@'{@dotless{i}}nea.

source: The value returned by the function as a whole will be 10.
es: El valor devuelto por la funci@'on como un todo ser@'a 10.

source: Each time @code{triangle-recursively} is evaluated, it evaluates a version of itself---a different instance of itself---with a smaller argument, until the argument is small enough so that it does not evaluate itself.
es: Cada vez que @code{triangle-recursively} se eval@'ua, se interpreta una versi@'on de s@'{@dotless{i}} misma --- una instancia diferente en s@'{@dotless{i}} --- con un peque@~no argumento, hasta que el argumento es suficientemente peque@~no as@'{@dotless{i}} que no se eval@'ua en s@'{@dotless{i}}.

source: Note that this particular design for a recursive function requires that operations be deferred.
es: Note que este particular dise@~no para una funci@'on recursiva requiere que las operaciones sean diferidas.

source: Before @code{(triangle-recursively 7)} can calculate its answer, it must call @code{(triangle-recursively 6)}; and before @code{(triangle-recursively 6)} can calculate its answer, it must call @code{(triangle-recursively 5)}; and so on. That is to say, the calculation that @code{(triangle-recursively 7)} makes must be deferred until @code{(triangle-recursively 6)} makes its calculation; and @code{(triangle-recursively 6)} must defer until @code{(triangle-recursively 5)} completes; and so on.
es: Antes de que @code{(triangle-recursively 7)} pueda calcular su respuesta, debe llamarse a @code{(triangle-recursively 6)}; y antes a @code{(triangle-recursively 5)}; y as@'{@dotless{i}}. Esto es decir, que el c@'alculo de @code{(triangle-recursively 7)} a crear debe ser diferido hasta que @code{(triangle-recursively 6)} haga su c@'alculo; y @code{(triangle-recursively 5)} lo complete; y as@'{@dotless{i}}.

source: If each of these instances of @code{triangle-recursively} are thought of as different robots, the first robot must wait for the second to complete its job, which must wait until the third completes, and so on.
es: Si cada una de estas instancias de @code{triangle-recursively} son pensadas como diferentes robots, el primer robot debe esperar por el segundo para completar su trabajo, que debe esperar hasta los terceros completos, y as@'{@dotless{i}}.

source: There is a way around this kind of waiting, which we will discuss in @ref{No Deferment, , Recursion without Deferments}.
es: Hay un camino alrededor de este tipo de espera, que se discutir@'a en @ref{Sin Aplazar, , Recursi@'on sin Defermentos.}

source: Recursion with cond
es: Recursi@'on con cond

source: Recursion Example Using @code{cond}
es: Ejemplo de recursi@'on usando @code{cond}

source: The version of @code{triangle-recursively} described earlier is written with the @code{if} special form. It can also be written using another special form called @code{cond}. The name of the special form @code{cond} is an abbreviation of the word @samp{conditional}.
es: La versi@'on de @code{triangle-recursively} antes descrita se escribi@'o con la forma especial @code{if}. Eso puede tambi@'en ser escrita usando otra forma especial llamada @code{cond}. El nombre de la forma especial @code{cond} es una abreviaci@'on de la palabra @samp{conditional}.

source: Although the @code{cond} special form is not used as often in the Emacs Lisp sources as @code{if}, it is used often enough to justify explaining it.
es: Aunque la forma especial @code{cond} no se usa con frecuencia en las fuentes de Emacs como @code{if}, se usa con suficiente frecuencia para justificarse explicando.

source: The template for a @code{cond} expression looks like this:
es: La plantilla para una expresi@'on @code{cond} se parece a:

source: where the @var{body} is a series of lists.
es: donde el @var{body} es una serie de listas.

source: Written out more fully, the template looks like this:
es: Escrito de manera m@'as completa, la plantilla se parece a esto:

source: When the Lisp interpreter evaluates the @code{cond} expression, it evaluates the first element (the @sc{car} or true-or-false-test) of the first expression in a series of expressions within the body of the @code{cond}.
es: Cuando el int@'erprete Lisp eval@'ua la expresi@'on @code{cond}, eval@'ua el primer elemento (el @sc{car} o true-or-false-test) de la primera expresi@'on en una serie de expresiones con el cuerpo del @code{cond}.

source: If the true-or-false-test returns @code{nil} the rest of that expression, the consequent, is skipped and the true-or-false-test of the next expression is evaluated. When an expression is found whose true-or-false-test returns a value that is not @code{nil}, the consequent of that expression is evaluated. The consequent can be one or more expressions. If the consequent consists of more than one expression, the expressions are evaluated in sequence and the value of the last one is returned. If the expression does not have a consequent, the value of the true-or-false-test is returned.
es: Si el true-or-false-test devuelve @code{nil} el resto de esta expresi@'on, el consecuente, se descarta y el true-or-false-test de la siguiente expresi@'on se eval@'ua. Cuando una expresi@'on encuentra un true-or-false-test cuyo valor no es @code{nil}, el consecuente de esta expresi@'on se eval@'ua. El consecuente puede ser una o m@'as expresiones. Si el consecuente consiste de m@'as de una expresi@'on, las expresiones son evaluadas en secuencia y el valor del @'ultimo se devuelve. Si la expresi@'on no tiene un consecuente, se devuelve el valor del true-or-false-test.

source: If none of the true-or-false-tests test true, the @code{cond} expression returns @code{nil}.
es: Si ninguno del test true-or-false-tests es cierto, la expresi@'on @code{cond} devuelve @code{nil}.

source: Written using @code{cond}, the @code{triangle} function looks like this:
es: Escrito usando @code{cond}, la funci@'on @code{triangle} se parece a esto:

source: In this example, the @code{cond} returns 0 if the number is less than or equal to 0, it returns 1 if the number is 1 and it evaluates @code{(+ number (triangle-using-cond (1- number)))} if the number is greater than 1.
es: En este ejemplo, el @code{cond} devuelve 0 si el n@'umero es menor o igual a 0, eso devuelve 1 si el n@'umero es 1 y eso eval@'ua @code{(+ number (triangle-using-cond (1- number)))} si el n@'umero es m@'as grandes que 1.

source: Here are three common recursive patterns. Each involves a list. Recursion does not need to involve lists, but Lisp is designed for lists and this provides a sense of its primal capabilities.
es: Aqu@'{@dotless{i}} hay tres patrones recursivos. Cada uno involucra una lista. La recursi@'on no se necesita para involucrar listas, pero Lisp se dise@~na para listas y esto provee un sentido de sus capacidades primarias.

source: Every
es: Cada

source: Recursive Pattern: @emph{every}
es: Patr@'on recursivo: @emph{every}

source: Every, type of recursive pattern
es: Every, tipo de patr@'on recursivo

source: Recursive pattern: every
es: Patr@'on recursivo: every

source: In the @code{every} recursive pattern, an action is performed on every element of a list.
es: En el patr@'on recursivo @code{every}, se desarrolla una acci@'on por cada elemento de una lista.

source: The basic pattern is:
es: El patr@'on b@'asico es:

source: If a list be empty, return @code{nil}.
es: Si una lista es vac@'{@dotless{i}}a, devuelve @code{nil}.

source: Else, act on the beginning of the list (the @sc{car} of the list) @itemize @minus @item through a recursive call by the function on the rest (the @sc{cdr}) of the list, @item and, optionally, combine the acted-on element, using @code{cons}, with the results of acting on the rest. @end itemize
es: Si no, se va al principio de la lista (el @sc{car} de la lista) actuando @itemize @item a trav@'es de una llamada recursiva por la funci@'on en el resto (el @sc{cdr}) de la lista, @item y, opcionalmente, se combina el elemento sobre el que act@'ua, usando @code{cons}, con los resultados de actuar en el resto. @end itemize

source: Here is example:
es: Aqu@'{@dotless{i}} est@'a el ejemplo:

source: (defun square-each (numbers-list) "Square each of a NUMBERS LIST, recursively." (if (not numbers-list) ; do-again-test nil (cons (* (car numbers-list) (car numbers-list)) (square-each (cdr numbers-list))))) ; next-step-expression
es: (defun square-each (numbers-list) "El cuadrado de cada LISTA DE NUMEROS, recursivamente." (if (not numbers-list) ; test-hazlo-de-nuevo nil (cons (* (car numbers-list) (car numbers-list)) (square-each (cdr numbers-list))))) ; expresion-siguiente-paso

source: If @code{numbers-list} is empty, do nothing. But if it has content, construct a list combining the square of the first number in the list with the result of the recursive call.
es: Si @code{numbers-list} est@'a vac@'{@dotless{i}}o, no hay que hacer nada. Pero si tiene contenido, se construye una lista combinando el cuadrado del primer n@'umero en la lista con el resultado de la llamada recursiva.

source: (The example follows the pattern exactly: @code{nil} is returned if the numbers' list is empty. In practice, you would write the conditional so it carries out the action when the numbers' list is not empty.)
es: (El ejemplo sigue el patr@'on exactamente: se devuelve @code{nil} si la lista de n@'umeros es vac@'{@dotless{i}}a. En la pr@'actica, se escribir@'{@dotless{i}}a el condicional, as@'{@dotless{i}} se ejecuta la acci@'on cuando la lista de n@'umeros no es vac@'{@dotless{i}}a.)

source: The @code{print-elements-recursively} function (@pxref{Recursion with list, , Recursion with a List}) is another example of an @code{every} pattern, except in this case, rather than bring the results together using @code{cons}, we print each element of output.
es: La funci@'on @code{print-elements-recursively} (@pxref{Recursi@'on con lista, , Recursi@'on con una Lista}) es otro ejemplo de un patr@'on @code{every}, excepto en este caso, en vez de traer los resultados juntos usando @code{cons}, se imprime cada elemento de salida.

source: The @code{print-elements-recursively} function looks like this:
es: La funci@'on @code{print-elements-recursively} se parece a esto:

source: (setq animals '(gazelle giraffe lion tiger))
es: (setq animales '(gacela jirafa leon tigre))

source: The pattern for @code{print-elements-recursively} is:
es: El patr@'on para @code{print-elements-recursively} es:

source: When the list is empty, do nothing.
es: Cuando la lista est@'a vac@'{@dotless{i}}a, no hacer nada.
