Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: In this experiment with the @code{+}, what we did was cause the Lisp interpreter to evaluate the @code{+} and look for the value of the variable instead of the function definition. We did this by placing the cursor right after the symbol rather than after the parenthesis of the enclosing list as we did before. As a consequence, the Lisp interpreter evaluated the preceding s-expression, which in this case was @code{+} by itself.
es: En este experimento con el @code{+}, lo que se hizo fu@'e causar que el int@'erprete Lisp eval@'ue el @code{+} y busque el valor de la variable en vez de la definici@'on de la funci@'on. Hicimos esto colocando el cursor justo despu@'es del s@'{@dotless{i}}mbolo en lugar de ponerlo al final de los par@'entesis que cierran la lista como hicimos antes. Como consecuencia, el int@'erprete Lisp evalu@'o la s-expresi@'on anterior, que en este caso fu@'e el @code{+} en s@'{@dotless{i}}.

source: Since @code{+} does not have a value bound to it, just the function definition, the error message reported that the symbol's value as a variable was void.
es: Ya que @code{+} no tiene un valor asociado, solo la definici@'on de funci@'on, el mensaje de error informa que el valor del s@'{@dotless{i}}mbolo como una variable estaba vac@'{@dotless{i}}o.

source: Symbol's value as variable is void:@: +
es: El valor de s@'{@dotless{i}}mbolo como variable est@'a vac@'{@dotless{i}}o:@: +

source: Passing information to functions
es: Pasando informaci@'on para funciones

source: To see how information is passed to functions, let's look again at our old standby, the addition of two plus two. In Lisp, this is written as follows:
es: Para ver c@'omo la informaci@'on se pasa a las funciones, veamos de nuevo a nuestro viejo recurso, la adici@'on de dos m@'as dos. En Lisp, esto se escribe como sigue:

source: If you evaluate this expression, the number 4 will appear in your echo area. What the Lisp interpreter does is add the numbers that follow the @code{+}.
es: Si se eval@'ua esta expresi@'on, el n@'umero 4 aparecer@'a en tu @'area echo. Lo que el int@'erprete de Lisp hace es sumar los n@'umeros despues del @code{+}.

source: @samp{argument} defined
es: @samp{argumento} definido

source: The numbers added by @code{+} are called the @dfn{arguments} of the function @code{+}. These numbers are the information that is given to or @dfn{passed} to the function.
es: Los n@'umeros sumados por @code{+} son llamados @dfn{argumentos} de la funci@'on @code{+}. Estos n@'umeros son la informaci@'on que se da o @dfn{pasa} a la funci@'on.

source: The word `argument' comes from the way it is used in mathematics and does not refer to a disputation between two people; instead it refers to the information presented to the function, in this case, to the @code{+}. In Lisp, the arguments to a function are the atoms or lists that follow the function. The values returned by the evaluation of these atoms or lists are passed to the function. Different functions require different numbers of arguments; some functions require none at all.@footnote{It is curious to track the path by which the word `argument' came to have two different meanings, one in mathematics and the other in everyday English. According to the @cite{Oxford English Dictionary}, the word derives from the Latin for @samp{to make clear, prove}; thus it came to mean, by one thread of derivation, `the evidence offered as proof', which is to say, `the information offered', which led to its meaning in Lisp. But in the other thread of derivation, it came to mean `to assert in a manner against which others may make counter assertions', which led to the meaning of the word as a disputation. (Note here that the English word has two different definitions attached to it at the same time. By contrast, in Emacs Lisp, a symbol cannot have two different function definitions at the same time.)}
es: La palabra `argumento' viene del @'ambito de las matem@'aticas y no se refiere a una disputa entre 2 personas, sino que se refiere a la informaci@'on presentada a la funci@'on, en este caso, al @code{+}. En Lisp, los argumentos de una funci@'on son los @'atomos o listas que siguen a la funci@'on. Los valores devueltos por la evaluaci@'on de estos @'atomos o listas son pasados a la funci@'on. Funciones diferentes requieren diferentes n@'umeros de argumentos; algunas funciones no requieren ninguno en absoluto.@footnote{Es curioso trazar la ruta por la cual la palabra `argumento' llego a tener dos significados distintos, uno en matem@'aticas y el otro en el ingl@'es cotidiano. De acuerdo al @cite{Oxford English Dictionary}, la palabra deriva del Lat@'{@dotless{i}}n para @samp{dejar claro, probar}, por lo tanto, paso a significar, por un hilo de derivaci@'on, `la evidencia ofrecida como prueba', es decir `la informaci@'on que se ofrece', que conduce a su significado en Lisp. Pero en el otro hilo de derivaci@'on, paso a significar `afirmar de una manera lo que otros pueden afirmar en contra', lo que llevó a la disputa del significado de la palabra. (N@'otese aqu@'{@dotless{i}} que la palabra Ingl@'esa tiene dos definiciones diferentes adjuntas al mismo tiempo. En contraste, en Emacs Lisp, un s@'{@dotless{i}}mbolo no puede tener dos definiciones de funci@'on diferentes al mismo tiempo.)}

source: Arguments' Data Types
es: Tipos de argumentos de datos

source: Types of data
es: Tipos de datos

source: Arguments' data types
es: Tipos de dato de los argumentos

source: The type of data that should be passed to a function depends on what kind of information it uses. The arguments to a function such as @code{+} must have values that are numbers, since @code{+} adds numbers. Other functions use different kinds of data for their arguments.
es: Los tipos de datos que deber@'{@dotless{i}}an ser pasados a una funci@'on dependen de que tipo de informaci@'on usan. Los argumentos de una funci@'on como @code{+} deben tener valores que son n@'umeros, puesto que @code{+} a@~nade n@'umeros. Otras funciones usan diferentes tipos de datos para sus argumentos.

source: concat
es: concatenar

source: For example, the @code{concat} function links together or unites two or more strings of text to produce a string. The arguments are strings. Concatenating the two character strings @code{abc}, @code{def} produces the single string @code{abcdef}. This can be seen by evaluating the following:
es: Por ejemplo, la funci@'on @code{concat} concatena o une dos o m@'as cadenas de texto para producir una cadena. Los argumentos son cadenas. La concatenaci@'on de los dos caracteres de cadenas @code{abc}, @code{def} produce una cadena @code{abcdef}. Esto puede ser visto evaluando lo siguiente:

source: The value produced by evaluating this expression is @code{"abcdef"}.
es: El valor producido para evaluar esta expresi@'on es @code{"abcdef"}.

source: A function such as @code{substring} uses both a string and numbers as arguments. The function returns a part of the string, a substring of the first argument. This function takes three arguments. Its first argument is the string of characters, the second and third arguments are numbers that indicate the beginning and end of the substring. The numbers are a count of the number of characters (including spaces and punctuation) from the beginning of the string.
es: Una funci@'on tal como @code{substring} usa como argumento tanto una cadena como n@'umeros. La funci@'on devuelve una parte de la cadena, una subcadena del primer argumento. Esta funci@'on toma tres argumentos. Su primer argumento es la cadena de caracteres, el segundo y tercer argumento son n@'umeros que indican el principio y el fin de la subcadena. Los n@'umeros son un conteo del n@'umero de caracteres (incluyendo espacios y puntuaciones) desde el principio de la cadena.

source: For example, if you evaluate the following:
es: Por ejemplo, si eval@'ua lo siguiente:

source: (substring "The quick brown fox jumped." 16 19)
es: (substring "El r@'apido zorro marr@'on salt@'o." 10 15)

source: you will see @code{"fox"} appear in the echo area. The arguments are the string and the two numbers.
es: se ver@'a @code{"zorro"} en el @'area echo. Los argumentos son la cadena y los dos n@'umeros.

source: Note that the string passed to @code{substring} is a single atom even though it is made up of several words separated by spaces. Lisp counts everything between the two quotation marks as part of the string, including the spaces. You can think of the @code{substring} function as a kind of `atom smasher' since it takes an otherwise indivisible atom and extracts a part. However, @code{substring} is only able to extract a substring from an argument that is a string, not from another type of atom such as a number or symbol.
es: N@'otese que la cadena pasada a @code{substring} es un solo @'atomo apesar de estar compuesto de varias palabras separadas por espacios. Lisp considera que cualquier cosa entre dos marcas de cita es parte de la cadena, incluyendo los espacios. Se puede pensar la funci@'on @code{substring} como un tipo de `acelerador de particulas' ya que toma un @'atomo indivisible y extrae una parte. Sin embargo, @code{substring} solo es capaz de extraer una subcadena desde un argumento que es una cadena, no otro tipo de @'atomo tal como un n@'umero o s@'{@dotless{i}}mbolo.

source: An Argument as the Value of a Variable or List
es: Un argumento como el valor de una variable o lista

source: An argument can be a symbol that returns a value when it is evaluated. For example, when the symbol @code{fill-column} by itself is evaluated, it returns a number. This number can be used in an addition.
es: Un argumento puede ser un s@'{@dotless{i}}mbolo que devuelva un valor cuando es evaluado. Por ejemplo, evaluar el s@'{@dotless{i}}mbolo @code{fill-column} en si, devuelve un n@'umero. Este n@'umero puede ser usado en una adici@'on.

source: Position the cursor after the following expression and type @kbd{C-x C-e}:
es: Posicionar el cursor despu@'es de la siguiente expresi@'on y presiona @kbd{C-x C-e}:

source: The value will be a number two more than what you get by evaluating @code{fill-column} alone. For me, this is 74, because my value of @code{fill-column} is 72.
es: El valor ser@'a dos m@'as el n@'umero que se obtiene al evaluar solamente @code{fill-column}. En m@'{@dotless{i}} caso, este es 74, porque mi valor de @code{fill-column} es 72.

source: As we have just seen, an argument can be a symbol that returns a value when evaluated. In addition, an argument can be a list that returns a value when it is evaluated. For example, in the following expression, the arguments to the function @code{concat} are the strings @w{@code{"The "}} and @w{@code{" red foxes."}} and the list @code{(number-to-string (+ 2 fill-column))}.
es: Como acabamos de ver, un argumento puede ser un s@'{@dotless{i}}mbolo que devuelve un valor cuando se eval@'ua. Adem@'as, un argumento puede ser una lista que devuelve un valor cuando es evaluada. Por ejemplo, en la siguiente expresi@'on, los argumentos de la funci@'on @code{concat} son las cadenas @w{@code{"Los"}} y @w{@code{" zorros rojos."}} y la lista @code{(number-to-string (+ 2 fill-column))}.

source: (concat "The " (number-to-string (+ 2 fill-column)) " red foxes.")
es: (concat "Los " (number-to-string (+ 2 fill-column)) " zorros rojos.")

source: If you evaluate this expression---and if, as with my Emacs, @code{fill-column} evaluates to 72---@code{"The 74 red foxes."} will appear in the echo area. (Note that you must put spaces after the word @samp{The} and before the word @samp{red} so they will appear in the final string. The function @code{number-to-string} converts the integer that the addition function returns to a string. @code{number-to-string} is also known as @code{int-to-string}.)
es: Si se eval@'ua esta expresi@'on---y si, como con mi Emacs, @code{fill-column} se eval@'ua a 72---aparecer@'a @code{"Los 74 zorros rojos."} en el @'area echo. (N@'otese que se debe poner espacio despu@'es de la palabra @samp{Los} y antes de la palabra @samp{rojos} y as@'{@dotless{i}} es como aparecer@'a en la cadena final. La funci@'on @code{number-to-string} convierte el entero que devuelve la funci@'on de adici@'on a una cadena. @code{number-to-string} tambi@'en se conoce como @code{int-to-string}.)

source: Variable number of arguments
es: N@'umero variable de argumentos

source: Arguments, variable number of
es: Argumentos, n@'umero variable de

source: Some functions, such as @code{concat}, @code{+} or @code{*}, take any number of arguments. (The @code{*} is the symbol for multiplication.) This can be seen by evaluating each of the following expressions in the usual way. What you will see in the echo area is printed in this text after @samp{@result{}}, which you may read as `evaluates to'.
es: Algunas funciones, como @code{concat}, @code{+}, o @code{*}, toman cualquier n@'umero de argumentos. (El @code{*} es el s@'{@dotless{i}}mbolo para multiplicar.) Esto puede ser visto evaluando cada una de las siguientes expresiones de la forma habitual. Lo que ver@'as en el @'area echo se imprime en este texto despu@'es de @samp{@result{}}, que se puede leer como `evaluar a'.

source: In the first set, the functions have no arguments:
es: En el primer conjunto, las funciones no tienen argumentos:

source: In this set, the functions have one argument each:
es: En este conjunto, las funciones tienen un argumento cada una:

source: In this set, the functions have three arguments each:
es: En este conjunto, las funciones tienen tres argumentos cada una:

source: Using the Wrong Type Object as an Argument
es: Usando el tipo incorrecto de objeto como un argumento

source: Wrong type of argument
es: Tipo incorrecto de argumento

source: Argument, wrong type of
es: Argumento, tipo incorrecto de

source: When a function is passed an argument of the wrong type, the Lisp interpreter produces an error message. For example, the @code{+} function expects the values of its arguments to be numbers. As an experiment we can pass it the quoted symbol @code{hello} instead of a number. Position the cursor after the following expression and type @kbd{C-x C-e}:
es: Cuando a una funci@'on se le pasa un argumento del tipo incorrecto, el interpr@'ete Lisp produce un mensaje de error. Por ejemplo, la funci@'on @code{+} espera que los valores de sus argumentos sean n@'umeros. Como un experimento podemos pasar el s@'{@dotless{i}}mbolo citado @code{hola} en vez de un n@'umero. Coloca el cursor despu@'es de la siguiente expresi@'on y presiona @kbd{C-x C-e}:

source: (+ 2 'hello)
es: (+ 2 'hola)

source: When you do this you will generate an error message. What has happened is that @code{+} has tried to add the 2 to the value returned by @code{'hello}, but the value returned by @code{'hello} is the symbol @code{hello}, not a number. Only numbers can be added. So @code{+} could not carry out its addition.
es: Al hacer esto se generar@'a un mensaje de error. Lo qu@'e ha ocurrido es que @code{+} ha intentado a@~nadir el 2 al valor devuelto por @code{'hola}, pero el valor devuelto por @code{'hola} es el s@'{@dotless{i}}mbolo @code{hola}, no un n@'umero. Solo los n@'umeros pueden ser a@~nadidos. Por tanto @code{+} no pudo llevar a cabo su adici@'on.

source: You will create and enter a @file{*Backtrace*} buffer that says:
es: Se crear@'a e introducir@'a un b@'uffer @file{*Backtrace*} que dice:

source: ---------- Buffer: *Backtrace* ---------- Debugger entered--Lisp error: " (wrong-type-argument number-or-marker-p hello) +(2 hello) eval((+ 2 (quote hello))) eval-last-sexp-1(nil) eval-last-sexp(nil) call-interactively(eval-last-sexp) ---------- Buffer: *Backtrace* ----------
es: ---------- Buffer: *Backtrace* ---------- Debugger entered--Lisp error: (wrong-type-argument number-or-marker-p hola) +(2 hola) eval((+ 2 (quote hola))) eval-last-sexp-1(nil) eval-last-sexp(nil) call-interactively(eval-last-sexp) ---------- Buffer: *Backtrace* ----------

source: As usual, the error message tries to be helpful and makes sense after you learn how to read it.@footnote{@code{(quote hello)} is an expansion of the abbreviation @code{'hello}.}
es: Como de costumbre, el mensaje de error intenta ser @'util y tiene sentido despu@'es de aprender c@'omo leerlo.@footnote{@code{(quote hola)} es una expansi@'on de la abreviatura @code{'hola}.}

source: The first part of the error message is straightforward; it says @samp{wrong type argument}. Next comes the mysterious jargon word @w{@samp{number-or-marker-p}}. This word is trying to tell you what kind of argument the @code{+} expected.
es: La primera parte del mensaje de error es sencilla; dice @samp{wrong type argument} (tipo de argumento incorrecto). A continuación viene la misteriosa palabra tecnica @w{@samp{number-or-marker-p}}. Esta palabra est@'a intentando decirte qu@'e tipo de argumento espera @code{+}.

source: The symbol @code{number-or-marker-p} says that the Lisp interpreter is trying to determine whether the information presented it (the value of the argument) is a number or a marker (a special object representing a buffer position). What it does is test to see whether the @code{+} is being given numbers to add. It also tests to see whether the argument is something called a marker, which is a specific feature of Emacs Lisp. (In Emacs, locations in a buffer are recorded as markers. When the mark is set with the @kbd{C-@@} or @kbd{C-@key{SPC}} command, its position is kept as a marker. The mark can be considered a number---the number of characters the location is from the beginning of the buffer.) In Emacs Lisp, @code{+} can be used to add the numeric value of marker positions as numbers.
es: El s@'{@dotless{i}}mbolo @code{number-or-marker-p} dice que el int@'erprete Lisp est@'a intentando determinar si la informaci@'on presentada (el valor del argumento) es un n@'umero o una marca (un objeto especial que representa una posici@'on de buffer). Lo que hace es probar si se le estan dando numeros a sumar a @code{+}. Tambi@'en chequea si el argumento es algo llamado un marcador, que es una caracteristica espec@'{@dotless{i}}fica de Emacs Lisp. (En Emacs, las ubicaciones en un b@'uffer se registran como marcadores. Cuando se establece la marca con el comando @kbd{C-@@} o @kbd{C-@key{SPC}}, su posici@'on se guarda como un marcador. La marca puede ser considerada como un n@'umero---el n@'umero de caracteres es la localizaci@'on desde el principio del b@'uffer.) En Emacs Lisp, @code{+} se puede utilizar para a@~nadir el valor num@'erico de los marcadores como n@'umeros.

source: The @samp{p} of @code{number-or-marker-p} is the embodiment of a practice started in the early days of Lisp programming. The @samp{p} stands for `predicate'. In the jargon used by the early Lisp researchers, a predicate refers to a function to determine whether some property is true or false. So the @samp{p} tells us that @code{number-or-marker-p} is the name of a function that determines whether it is true or false that the argument supplied is a number or a marker. Other Lisp symbols that end in @samp{p} include @code{zerop}, a function that tests whether its argument has the value of zero, and @code{listp}, a function that tests whether its argument is a list.
es: La @samp{p} de @code{number-or-marker-p} es la encarnaci@'on de una pr@'actica iniciada en los primeros d@'{@dotless{i}}as de la programaci@'on Lisp. La @samp{p} significa `predicado'. En la jerga usada por los primeros investigadores de Lisp, un predicado se refiere a una funci@'on para determinar si alguna propiedad es verdadera o falsa. As@'{@dotless{i}} la @samp{p} nos dice que @code{number-or-marker-p} es el nombre de una funci@'on que determina si el argumento dado es un n@'umero o una marca. Otros s@'{@dotless{i}}mbolos Lisp que finalizan en @samp{p} incluyen @code{zerop}, una funci@'on que chequea si su argumento tienen el valor de cero, y @code{listp}, una funci@'on que prueba si su argumento es una lista.

source: Finally, the last part of the error message is the symbol @code{hello}. This is the value of the argument that was passed to @code{+}. If the addition had been passed the correct type of object, the value passed would have been a number, such as 37, rather than a symbol like @code{hello}. But then you would not have got the error message.
es: Finalmente, la @'ultima parte del mensaje de error es el s@'{@dotless{i}}mbolo @code{hola}. Este es el valor del argumento dado a @code{+}. Si a la adici@'on se le hubiese pasado el tipo correcto de objeto, el valor habr@'{@dotless{i}}a sido un n@'umero, como 37, en lugar de un s@'{@dotless{i}}mbolo como @code{hola}. Pero entonces no habr@'{@dotless{i}}as obtenido el mensaje de error.

source: Wrong type argument:@: number-or-marker-p, hello
es: Mal tipo de argumento:@: number-or-marker-p, hello

source: The @code{message} Function
es: La funci@'on @code{message}

source: Like @code{+}, the @code{message} function takes a variable number of arguments. It is used to send messages to the user and is so useful that we will describe it here.
es: Al igual que @code{+}, la funci@'on @code{message} toma un n@'umero variable de argumentos. Se utiliza para enviar mensajes al usuario y es tan @'util que vamos a describirla.

source: A message is printed in the echo area. For example, you can print a message in your echo area by evaluating the following list:
es: Se impre un mensaje en el @'area echo. Por ejemplo, puede imprimir un mensaje en su @'area echo evaluando la siguiente lista:

source: (message "This message appears in the echo area!")
es: (message "@exclamdown{}Este mensaje aparece en el @'area echo!")

source: The whole string between double quotation marks is a single argument and is printed @i{in toto}. (Note that in this example, the message itself will appear in the echo area within double quotes; that is because you see the value returned by the @code{message} function. In most uses of @code{message} in programs that you write, the text will be printed in the echo area as a side-effect, without the quotes. @xref{multiply-by-seven in detail, , @code{multiply-by-seven} in detail}, for an example of this.)
es: Toda la cadena entre comillas dobles es un unico argumento y se imprime @i{en su totalidad}. (N@'otese que en este ejemplo, el mensaje en s@'{@dotless{i}} aparece en el @'area echo entre comillas dobles; esto se debe a que ves el valor devuelto por la funci@'on @code{message}. En la mayor@'{@dotless{i}}a de programas que escribiras, el texto ser@'a impreso en el @'area echo como un efecto secundario de @code{message}, sin las comillas. Ver @ref{multiply-by-seven en detalle, , @code{multiply-by-seven} en detalle}, para un ejemplo de esto.)

source: However, if there is a @samp{%s} in the quoted string of characters, the @code{message} function does not print the @samp{%s} as such, but looks to the argument that follows the string. It evaluates the second argument and prints the value at the location in the string where the @samp{%s} is.
es: Sin embargo, si hay un @samp{%s} en la cadena de caracteres citada, la funci@'on @code{message} no imprime el @samp{%s} como tal, pero mira el siguente argumento a continuaci@'on de la cadena. Se eval@'ua el segundo argumento e imprime el valor en la ubicaci@'on de la cadena donde est@'a el @samp{%s} .

source: You can see this by positioning the cursor after the following expression and typing @kbd{C-x C-e}:
es: Puede ver esto colocando el cursor despu@'es de la siguiente expresi@'on y presionar @kbd{C-x C-e}:

source: (message "The name of this buffer is: %s." (buffer-name))
es: (message "El nombre de este b@'uffer es: %s." (buffer-name))
