Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Our immediate goal is to generate a list that tells us how many function definitions contain fewer than 10 words and symbols, how many contain between 10 and 19 words and symbols, how many contain between 20 and 29 words and symbols, and so on.
es: Nuestro objetivo inmediato es generar una lista que cuenta, cuantas definiciones de funciones contienen menos de 10 palabras y s@'{@dotless{i}}mbolos, cuantas contienen entre 10 y 19 palabras y s@'{@dotless{i}}mbolos, cuantas contienen entre 20 y 29 palabras y s@'{@dotless{i}}mbolos, y as@'{@dotless{i}}.

source: With a sorted list of numbers, this is easy: count how many elements of the list are smaller than 10, then, after moving past the numbers just counted, count how many are smaller than 20, then, after moving past the numbers just counted, count how many are smaller than 30, and so on. Each of the numbers, 10, 20, 30, 40, and the like, is one larger than the top of that range. We can call the list of such numbers the @code{top-of-ranges} list.
es: Con una lista ordenada de n@'umeros, es f@'acil: se cuentan cuantos elementos de la lista son m@'as peque@~nos de 10, entonces, se devuelven los n@'umeros contados, se cuenta cuantos son m@'as peque@~nos de 20, entonces se devuelven los n@'umeros contados, despu@'es se cuentan los que son m@'as peque@~nos de 30, y as@'{@dotless{i}}. Cada uno de los n@'umeros, 10, 20, 30, 40, y como, es m@'as grande que el tope de este rango. Se puede llamar a la lista de tales n@'umeros, la lista @code{top-of-ranges}.

source: If we wished, we could generate this list automatically, but it is simpler to write a list manually. Here it is:
es: Si se desea, se podr@'{@dotless{i}}a generar esta lista autom@'aticamente, pero es m@'as simple escribir una lista manualmente. Aqu@'{@dotless{i}} est@'a:

source: (defvar top-of-ranges '(10 20 30 40 50 60 70 80 90 100 110 120 130 140 150 160 170 180 190 200 210 220 230 240 250 260 270 280 290 300) "List specifying ranges for `defuns-per-range'.")
es: (defvar top-of-ranges '(10 20 30 40 50 60 70 80 90 100 110 120 130 140 150 160 170 180 190 200 210 220 230 240 250 260 270 280 290 300) "Listar especificando rangos para `defuns-per-range'.")

source: To change the ranges, we edit this list.
es: Para cambiar los rangos, se edita esta lista.

source: Next, we need to write the function that creates the list of the number of definitions within each range. Clearly, this function must take the @code{sorted-lengths} and the @code{top-of-ranges} lists as arguments.
es: Lo siguiente, que se necesita es escribir la funci@'on que crea la lista del n@'umero de definiciones con cada rango. Claramente, esta funci@'on debe tomar el @code{sorted-lengths} y las listas @code{top-of-ranges} listas como argumentos.

source: The @code{defuns-per-range} function must do two things again and again: it must count the number of definitions within a range specified by the current top-of-range value; and it must shift to the next higher value in the @code{top-of-ranges} list after counting the number of definitions in the current range. Since each of these actions is repetitive, we can use @code{while} loops for the job. One loop counts the number of definitions in the range defined by the current top-of-range value, and the other loop selects each of the top-of-range values in turn.
es: La funci@'on @code{defuns-per-range} debe hacer dos cosas una y otra vez: eso debe contar el n@'umero de definiciones con un rango espec@'{@dotless{i}}fico por el actual valor top-of-range; y eso debe dividir al siguiente gran valor en la lista @code{top-of-ranges} despu@'es de contar el n@'umero de definiciones en el rango actual. Desde que cada una de estas acciones es repetitiva, se puede usar los bucles @code{while} para el trabajo. Un bucle cuenta el n@'umero de definiciones en el rango definido por el valor actual top-of-range, y el otro bucle selecciona cada uno de los valores top-of-range en turno.

source: Several entries of the @code{sorted-lengths} list are counted for each range; this means that the loop for the @code{sorted-lengths} list will be inside the loop for the @code{top-of-ranges} list, like a small gear inside a big gear.
es: Varias entradas de la lista @code{sorted-lengths} se cuentan para cada rango; esto significa que el bucle para la lista @code{sorted-lengths} ser@'a dentro del bucle para la lista @code{top-of-ranges}, como un peque@~no adorno dentro de un gran adorno.

source: The inner loop counts the number of definitions within the range. It is a simple counting loop of the type we have seen before. (@xref{Incrementing Loop, , A loop with an incrementing counter}.) The true-or-false test of the loop tests whether the value from the @code{sorted-lengths} list is smaller than the current value of the top of the range. If it is, the function increments the counter and tests the next value from the @code{sorted-lengths} list.
es: El bucle interno cuenta el n@'umero de definiciones con el rango. Eso es un simple contaje del tipo en el que se ha visto antes. (@xref{Incrementando el Bucle, , Un bucle con un contador de incremento}). El test true-or-false del bucle chequea si el valor desde la lista @code{sorted-lengths} es m@'as peque@~na que el actual valor de lo alto del rango. Si es as@'{@dotless{i}}, la funci@'on incrementa el contador y se chequea el siguiente valor desde la lista @code{sorted-lengths}.

source: The inner loop looks like this:
es: El bucle interno se parece a esto:

source: The outer loop must start with the lowest value of the @code{top-of-ranges} list, and then be set to each of the succeeding higher values in turn. This can be done with a loop like this:
es: El bucle de fuera debe empezar con el valor m@'as bajo de la lista @code{top-of-ranges}, y entonces se asigna a cada uno de los valores superiores exitosos a su vez. Esto puede ser hecho con un bucle como este:

source: Put together, the two loops look like this:
es: Se ponen juntos, los dos bucles como este:

source: ;; @r{Count the number of elements within the current range.} (while @var{length-element-smaller-than-top-of-range} (setq number-within-range (1+ number-within-range)) (setq sorted-lengths (cdr sorted-lengths)))
es: ;; @r{Contar el n@'umero de elementos con el actual rango.} (while @var{length-element-smaller-than-top-of-range} (setq number-within-range (1+ number-within-range)) (setq sorted-lengths (cdr sorted-lengths)))

source: ;; @r{Move to next range.} (setq top-of-ranges (cdr top-of-ranges)))
es: ;; @r{Mover al siguiente rango.} (setq top-of-ranges (cdr top-of-ranges)))

source: In addition, in each circuit of the outer loop, Emacs should record the number of definitions within that range (the value of @code{number-within-range}) in a list. We can use @code{cons} for this purpose. (@xref{cons, , @code{cons}}.)
es: Adem@'as, en cada circuito del bucle exterior, Emacs grabar@'{@dotless{i}}a el n@'umero de definiciones con este rango (el valor de @code{number-within-range}) en una lista. Se puede usar @code{cons} para este prop@'osito. (@xref{cons, , @code{cons}}.)

source: The @code{cons} function works fine, except that the list it constructs will contain the number of definitions for the highest range at its beginning and the number of definitions for the lowest range at its end. This is because @code{cons} attaches new elements of the list to the beginning of the list, and since the two loops are working their way through the lengths' list from the lower end first, the @code{defuns-per-range-list} will end up largest number first. But we will want to print our graph with smallest values first and the larger later. The solution is to reverse the order of the @code{defuns-per-range-list}. We can do this using the @code{nreverse} function, which reverses the order of a list.
es: La funci@'on @code{cons} trabaja bien, excepto que la lista que se construye contendr@'a el n@'umero de definiciones para el alto rango y su principio el n@'umero de definiciones para el m@'as bajo rango a su fin. Esto es porque @code{cons} adjunta nuevos elementos de la lista al principio de la lista, y desde los dos bucles que hacen c@'alculos a trav@'es de la lista de tama@~nos desde lo bajo finaliza primero, el @code{defuns-per-range-list} finalizar@'a el primer n@'umero m@'as largo. Pero lo que se quiere es imprimir nuestro grafo con peque@~nos valores primero y el m@'as grande despu@'es. La soluci@'on es invertir el orden del @code{defuns-per-range-list}. Nosotros podemos hacer esto usando la funci@'on @code{nreverse}, que invierte el orden de una lista.

source: Note that the @code{nreverse} function is ``destructive''---that is, it changes the list to which it is applied; this contrasts with the @code{car} and @code{cdr} functions, which are non-destructive. In this case, we do not want the original @code{defuns-per-range-list}, so it does not matter that it is destroyed. (The @code{reverse} function provides a reversed copy of a list, leaving the original list as is.)
es: Note que la funci@'on @code{nreverse} es ``destructiva'' --- que es, cambiar la lista a la que se aplica; esto contrasta con las funciones @code{car} y @code{cdr}, que no son destructivas. En este caso, no se quiere que el original @code{defuns-per-range-list}, de manera que no hay materia que se destruya. (La funci@'on @code{reverse} provee un copia inversa de una lista, dejando la lista original como es.)

source: Put all together, the @code{defuns-per-range} looks like this:
es: Pon todo junto, el @code{defuns-per-range} se parece a esto:

source: (defun defuns-per-range (sorted-lengths top-of-ranges) "SORTED-LENGTHS defuns in each TOP-OF-RANGES range." (let ((top-of-range (car top-of-ranges)) (number-within-range 0) defuns-per-range-list)
es: (defun defuns-per-range (sorted-lengths top-of-ranges) "funciones de SORTED-LENGTHS en cada rango TOP-OF-RANGES." (let ((top-of-range (car top-of-ranges)) (number-within-range 0) defuns-per-range-list)

source: ;; @r{Outer loop.} (while top-of-ranges
es: ;; @r{Bucle Exterior.} (while top-of-ranges

source: ;; @r{Inner loop.} (while (and ;; @r{Need number for numeric test.} (car sorted-lengths) (< (car sorted-lengths) top-of-range))
es: ;; @r{Bucle Interno.} (while (and ;; @r{Necesita el n@'umero para el test num@'erico.} (car sorted-lengths) (< (car sorted-lengths) top-of-range))

source: ;; @r{Count number of definitions within current range.} (setq number-within-range (1+ number-within-range)) (setq sorted-lengths (cdr sorted-lengths)))
es: ;; @r{Contar n@'umero de definiciones con el rango actual.} (setq number-within-range (1+ number-within-range)) (setq sorted-lengths (cdr sorted-lengths)))

source: ;; @r{Exit inner loop but remain within outer loop.}
es: ;; @r{Sal del bucle interno pero permanece con el bucle externo.}

source: (setq defuns-per-range-list (cons number-within-range defuns-per-range-list)) (setq number-within-range 0) ; @r{Reset count to zero.}
es: (setq defuns-per-range-list (cons number-within-range defuns-per-range-list)) (setq number-within-range 0) ; @r{Resetear el contaje a cero.}

source: ;; @r{Move to next range.} (setq top-of-ranges (cdr top-of-ranges)) ;; @r{Specify next top of range value.} (setq top-of-range (car top-of-ranges)))
es: ;; @r{Mover al siguiente rango.} (setq top-of-ranges (cdr top-of-ranges)) ;; @r{Especifica el siguiente mejor rango de valores.} (setq top-of-range (car top-of-ranges)))

source: ;; @r{Exit outer loop and count the number of defuns larger than} ;; @r{ the largest top-of-range value.} (setq defuns-per-range-list (cons (length sorted-lengths) defuns-per-range-list))
es: ;; @r{Salir del bucle externo y contar el n@'umero de defuns m@'as ;; largas que} ;; @r{el valor m@'as largo del valor top-of-range.} (setq defuns-per-range-list (cons (length sorted-lengths) defuns-per-range-list))

source: ;; @r{Return a list of the number of definitions within each range,} ;; @r{ smallest to largest.} (nreverse defuns-per-range-list)))
es: ;; @r{Devuelve una lista del n@'umero de definiciones con cada rango,} ;; @r{ del m@'as peque@~no al m@'as largo.} (nreverse defuns-per-range-list)))

source: The function is straightforward except for one subtle feature. The true-or-false test of the inner loop looks like this:
es: La funci@'on es simple excepto para una peque@~na funcionalidad. El test verdadero-o-falso para el bucle interno se parece a esto:

source: instead of like this:
es: en vez de algo como esto:

source: The purpose of the test is to determine whether the first item in the @code{sorted-lengths} list is less than the value of the top of the range.
es: El prop@'osito del test es determinar si el primer @'{@dotless{i}}tem en la lista @code{sorted-lengths} es menor que el valor de lo mejor del rango.

source: The simple version of the test works fine unless the @code{sorted-lengths} list has a @code{nil} value. In that case, the @code{(car sorted-lengths)} expression function returns @code{nil}. The @code{<} function cannot compare a number to @code{nil}, which is an empty list, so Emacs signals an error and stops the function from attempting to continue to execute.
es: La versi@'on simple del test trabaja bien a menos que la lista @code{sorted-lengths} tiene un valor @code{nil}. En este caso, la expresi@'on @code{(car sorted-lengths)} devuelve @code{nil}. La funci@'on @code{<} no se puede compara un n@'umero a @code{nil}, que es una lista vac@'{@dotless{i}}a, as@'{@dotless{i}} Emacs se@~nala un error y para la funci@'on desde el intento de continuar la ejecuci@'on.

source: The @code{sorted-lengths} list always becomes @code{nil} when the counter reaches the end of the list. This means that any attempt to use the @code{defuns-per-range} function with the simple version of the test will fail.
es: La lista @code{sorted-lengths} siempre llega a ser @code{nil} cuando el contador logra el fin de la lista. Esto significa que cualquier intento de usar la funci@'on @code{defuns-per-range} con la versi@'on simple del test fallar@'a.

source: We solve the problem by using the @code{(car sorted-lengths)} expression in conjunction with the @code{and} expression. The @code{(car sorted-lengths)} expression returns a non-@code{nil} value so long as the list has at least one number within it, but returns @code{nil} if the list is empty. The @code{and} expression first evaluates the @code{(car sorted-lengths)} expression, and if it is @code{nil}, returns false @emph{without} evaluating the @code{<} expression. But if the @code{(car sorted-lengths)} expression returns a non-@code{nil} value, the @code{and} expression evaluates the @code{<} expression, and returns that value as the value of the @code{and} expression.
es: Se resuelve el problema usando @code{(car sorted-lengths)} en conjunci@'on con la expresi@'on @code{and}. La expresi@'on @code{(car sorted-lengths)} devuelve un valor no @code{nil} tan largo como la lista que tiene al menos un n@'umero con eso, pero devuelve @code{nil} si la lista est@'a vac@'{@dotless{i}}a. La expresi@'on @code{and} primero eval@'ua el @code{(car sorted-lengths)}, y si eso es @code{nil}, devuelve falso @emph{sin} evaluar la expresi@'on @code{<} y devuelve este valor como el valor de la expresi@'on @code{and}.

source: This way, we avoid an error.
es: Este camino, evita un error.

source: Here is a short test of the @code{defuns-per-range} function. First, evaluate the expression that binds (a shortened) @code{top-of-ranges} list to the list of values, then evaluate the expression for binding the @code{sorted-lengths} list, and then evaluate the @code{defuns-per-range} function.
es: Aqu@'{@dotless{i}} hay un peque@~no test de la funci@'on @code{defuns-per-range}. Primero, eval@'ua la expresi@'on que ajusta (una resumida) lista @code{top-of-ranges} a la lista de valores, entonces eval@'ua la expresi@'on para ajustar la lista @code{sorted-lengths}, y entonces eval@'ua la funci@'on @code{defuns-per-range}.

source: ;; @r{(Shorter list than we will use later.)} (setq top-of-ranges '(110 120 130 140 150 160 170 180 190 200))
es: ;; @r{(La lista ordenada que usar@'a despu@'es.)} (setq top-of-ranges '(110 120 130 140 150 160 170 180 190 200))

source: The list returned looks like this:
es: La lista devuelta se parece a esto:

source: Indeed, there are two elements of the @code{sorted-lengths} list smaller than 110, two elements between 110 and 119, two elements between 120 and 129, and so on. There are four elements with a value of 200 or larger.
es: Dentro, hay dos elementos de la lista @code{sorted-lengths} menores de 110, dos elementos entre 110 y 119, dos elementos entre 120 y 129 y as@'{@dotless{i}}. Hay cuatro elementos con un valor de 200 o superior.

source: Readying a graph
es: Leyendo un grafo

source: Graph prototype
es: Grafo prototipo

source: Prototype graph
es: Prototipo de grafo

source: Body of graph
es: Cuerpo de grafo

source: Our goal is to construct a graph showing the numbers of function definitions of various lengths in the Emacs lisp sources.
es: Nuestro objetivo es construir un grafo mostrando los n@'umeros de definiciones de funci@'on de varios tama@~nos en las fuentes de Emacs lisp.

source: As a practical matter, if you were creating a graph, you would probably use a program such as @code{gnuplot} to do the job. (@code{gnuplot} is nicely integrated into GNU Emacs.) In this case, however, we create one from scratch, and in the process we will re-acquaint ourselves with some of what we learned before and learn more.
es: Como una materia pr@'actica, si se estuviese creando un grafo, probablemente usar@'{@dotless{i}}as un programa tal como @code{gnuplot} para hacer el trabajo. (@code{gnuplot} est@'a bien integrado dentro de GNU Emacs.) En este caso, sin embargo, creamos uno desde cero, y en el proceso lo reconstruimos nosotros mismos con algo de lo que se aprende antes y as@'{@dotless{i}} poder aprender m@'as.

source: In this chapter, we will first write a simple graph printing function. This first definition will be a @dfn{prototype}, a rapidly written function that enables us to reconnoiter this unknown graph-making territory. We will discover dragons, or find that they are myth. After scouting the terrain, we will feel more confident and enhance the function to label the axes automatically.
es: En este cap@'{@dotless{i}}tulo, primero se escribe un grafo simple imprimiendo la funci@'on. Esta primera definici@'on ser@'a un @dfn{prototipo}, una funci@'on escrita r@'apidamente nos permite reconocer este territorio de crear un grafo. Se descubren dragones, o resulta que son mitos. Despu@'es de olisquear el terreno, nos sentiremos m@'as confidentes y mejoraremos la funci@'on para etiquetar las coordenadas autom@'aticamente.

source: Columns of a graph
es: Columnas de un grafo

source: Printing the Columns of a Graph
es: Imprimiendo las columnas de un grafo

source: Since Emacs is designed to be flexible and work with all kinds of terminals, including character-only terminals, the graph will need to be made from one of the `typewriter' symbols. An asterisk will do; as we enhance the graph-printing function, we can make the choice of symbol a user option.
es: Puesto que Emacs est@'a dise@~nado para ser flexible y trabajar con todo tipo de terminales, incluyendo los terminales de caracteres, el grafo necesitar@'a ser hecho desde s@'{@dotless{i}}mbolos de `escritura'. Un asterisco har@'a; como nosotros mejoramos la funci@'on de impresi@'on del grafo, se puede crear la elecci@'on del s@'{@dotless{i}}mbolo como una opci@'on de usuario.

source: We can call this function @code{graph-body-print}; it will take a @code{numbers-list} as its only argument. At this stage, we will not label the graph, but only print its body.
es: Se puede llamar a esta funci@'on @code{graph-body-print}; se tomar@'a un @code{numbers-list} como su @'unico argumento. En esta fase, no se etiquetar@'a el grafo, pero se imprime su cuerpo.

source: The @code{graph-body-print} function inserts a vertical column of asterisks for each element in the @code{numbers-list}. The height of each line is determined by the value of that element of the @code{numbers-list}.
es: La funci@'on @code{graph-body-print} inserta una columna vertical de asteriscos para cada elemento en la lista @code{numbers-list}. La altura de cada l@'{@dotless{i}}nea est@'a determinada por el valor de este elemento de la @code{numbers-list}.

source: Inserting columns is a repetitive act; that means that this function can be written either with a @code{while} loop or recursively.
es: Insertar columnas es un acto repetitivo; que significa que esta funci@'on debe ser escrita con un bucle @code{while} o recursivamente.

source: Our first challenge is to discover how to print a column of asterisks. Usually, in Emacs, we print characters onto a screen horizontally, line by line, by typing. We have two routes we can follow: write our own column-insertion function or discover whether one exists in Emacs.
es: Nuestro primer reto es descubrir como imprimir una columna de asteriscos. Normalmente, en Emacs, se imprimen caracteres dentro de una pantalla horizontalmente, l@'{@dotless{i}}nea a l@'{@dotless{i}}nea, escribiendo. Se tienen dos rutas que se pueden seguir: escribir nuestra funci@'on column-insertion o descubrir si una que exista en Emacs.

source: To see whether there is one in Emacs, we can use the @kbd{M-x apropos} command. This command is like the @kbd{C-h a} (@code{command-apropos}) command, except that the latter finds only those functions that are commands. The @kbd{M-x apropos} command lists all symbols that match a regular expression, including functions that are not interactive.
es: Para ver si hay uno en Emacs, se puede usar el comando @kbd{M-x apropos}. Este comando es como el comando @kbd{C-h a} (@code{command-apropos}), excepto que @'ultimo encuentra solo estas funciones que son comandos. El comando @kbd{M-x apropos} lista todos los s@'{@dotless{i}}mbolos que se asocian a una expresi@'on regular, incluyendo funciones que no son interactivas.

source: What we want to look for is some command that prints or inserts columns. Very likely, the name of the function will contain either the word `print' or the word `insert' or the word `column'. Therefore, we can simply type @kbd{M-x apropos RET print\|insert\|column RET} and look at the result. On my system, this command once too takes quite some time, and then produced a list of 79 functions and variables. Now it does not take much time at all and produces a list of 211 functions and variables. Scanning down the list, the only function that looks as if it might do the job is @code{insert-rectangle}.
es: Lo que se quiere buscar es alg@'un comando que imprima o inserte columnas. Muy probablemente, el nombre de la funci@'on contendr@'a la palabra `print' o la palabra `insert' o la palabra `column'. Por esta raz@'on, podemos simplemente escribir @kbd{M-x apropos RET print \|insert\|column RET} y se ve el resultado. En mi sistema, este comando toma todav@'{@dotless{i}}a alg@'un tiempo, y entonces se produce una lista de 79 funciones y variables. Ahora no se tarda mucho y se produce una lista de 211 funciones y variables. Escaneando la lista, la @'unica funci@'on que se ve como si se pudiera hacer el trabajo que es @code{insert-rectangle}.

source: Indeed, this is the function we want; its documentation says:
es: En realidad, esta es la funci@'on que queremos; su documentaci@'on dice:
