Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Write an expression that prints a message in the echo area when evaluated.
es: Escribe una expresi@'on que imprima un mensaje en el @'area eco cuando es evaluada.

source: Practicing evaluation
es: Practicando evaluaci@'on

source: Evaluation practice
es: Evaluaci@'on pr@'actica

source: Before learning how to write a function definition in Emacs Lisp, it is useful to spend a little time evaluating various expressions that have already been written. These expressions will be lists with the functions as their first (and often only) element. Since some of the functions associated with buffers are both simple and interesting, we will start with those. In this section, we will evaluate a few of these. In another section, we will study the code of several other buffer-related functions, to see how they were written.
es: Antes de aprender como escribir una definici@'on de funci@'on en Emacs Lisp, es @'util gastar un poco de tiempo evaluando varias expresiones que ya han sido escritas. Estas expresiones ser@'an listas con funciones como su primer (y con frecuencia @'unico) elemento. Dado que algunas de las funciones asociadas con b@'uffers son a la vez simples e interesantes, vamos a iniciar con estas. En esta secci@'on, vamos a evaluar algunas de este tipo. En otra secci@'on, estudiaremos el c@'odigo de varias otras funciones relacionadas con b@'uffers, para ver la forma c@'omo fueron escritas.

source: @i{Whenever you give an editing command} to Emacs Lisp, such as the command to move the cursor or to scroll the screen, @i{you are evaluating an expression,} the first element of which is a function. @i{This is how Emacs works.}
es: @i{Siempre que proporciona un comando de edici@'on} a Emacs Lisp, como el comando para mover el cursor o para desplazarse por la pantalla, @i{se est@'a evaluando una expresi@'on,} de la cual el primer elemento es una funci@'on. @i{As@'{@dotless{i}} es c@'omo funciona Emacs}.

source: @samp{interactive function} defined
es: @samp{funci@'on interactiva} definida

source: @samp{command} defined
es: @samp{comando} definido

source: When you type keys, you cause the Lisp interpreter to evaluate an expression and that is how you get your results. Even typing plain text involves evaluating an Emacs Lisp function, in this case, one that uses @code{self-insert-command}, which simply inserts the character you typed. The functions you evaluate by typing keystrokes are called @dfn{interactive} functions, or @dfn{commands}; how you make a function interactive will be illustrated in the chapter on how to write function definitions. @xref{Interactive, , Making a Function Interactive}.
es: Al presionar las teclas, se causa que el int@'erprete Lisp eval@'ue una expresi@'on que devuelve resultados. Incluso escribir texto plano implica eval@'uar una funci@'on Emacs Lisp, en este caso, se utiliza @code{self-insert-command}, que simplemente inserta el caracter escrito. Las funciones que se eval@'uan presionando atajos de teclado se llaman funciones @dfn{interactive}, o @dfn{comandos}; como crear una funci@'on interactive ser@'a ilustrado en el cap@'{@dotless{i}}tulo sobre c@'omo escribir definiciones de funciones. Ver @ref{Interactive, , Creando una Funci@'on Interactive}.

source: In addition to typing keyboard commands, we have seen a second way to evaluate an expression: by positioning the cursor after a list and typing @kbd{C-x C-e}. This is what we will do in the rest of this section. There are other ways to evaluate an expression as well; these will be described as we come to them.
es: Adem@'as de presionar comandos de teclado, hemos visto una segunda manera de evaluar una expresi@'on: colocar el cursor despu@'es de una lista y presionar @kbd{C-x C-e}. Esto es lo que se har@'a en el resto de esta secci@'on. Hay otras maneras de evaluar una expresi@'on; que ser@'an descritas cuando llegemos a ellas.

source: Besides being used for practicing evaluation, the functions shown in the next few sections are important in their own right. A study of these functions makes clear the distinction between buffers and files, how to switch to a buffer, and how to determine a location within it.
es: Ademas de utilizarse para practicar la evaluaci@'on, las funciones mostradas en las siguientes secciones son importantes por derecho propio. Un estudio de estas funciones deja claro la distinci@'on entre b@'uffers y ficheros, c@'omo cambiar a un b@'uffer, y como determinar una ubicaci@'on dentro de ella.

source: The two functions, @code{buffer-name} and @code{buffer-file-name}, show the difference between a file and a buffer. When you evaluate the following expression, @code{(buffer-name)}, the name of the buffer appears in the echo area. When you evaluate @code{(buffer-file-name)}, the name of the file to which the buffer refers appears in the echo area. Usually, the name returned by @code{(buffer-name)} is the same as the name of the file to which it refers, and the name returned by @code{(buffer-file-name)} is the full path-name of the file.
es: Las dos funciones, @code{buffer-name} y @code{buffer-file-name}, muestran la diferencia entre un fichero y un b@'uffer. Cuando se eval@'ua la siguiente expresi@'on, @code{(buffer-name)}, el nombre del buffer aparece en el area eco. Al evaluar @code{(buffer-file-name)}, el nombre del fichero al que se relaciona el b@'uffer aparece en el @'area echo. Normalmente, el nombre devuelto por @code{(buffer-name)} es el mismo que el nombre del fichero al que hace referencia, y el nombre devuelto por @code{(buffer-file-name)} es la ruta completa del fichero.

source: A file and a buffer are two different entities. A file is information recorded permanently in the computer (unless you delete it). A buffer, on the other hand, is information inside of Emacs that will vanish at the end of the editing session (or when you kill the buffer). Usually, a buffer contains information that you have copied from a file; we say the buffer is @dfn{visiting} that file. This copy is what you work on and modify. Changes to the buffer do not change the file, until you save the buffer. When you save the buffer, the buffer is copied to the file and is thus saved permanently.
es: Un fichero y un b@'uffer son dos entidades diferentes. Un fichero es informaci@'on grabada de manera permanente en el ordenador (a menos que se borre). Un b@'uffer, por otro lado, es informaci@'on dentro de Emacs que desaparecer@'a al final de la sesi@'on de edici@'on (o cuando se mate el b@'uffer). Normalmente, un b@'uffer contiene informaci@'on que se ha copiado desde un fichero; decimos que el b@'uffer est@'a @dfn{visitando} este fichero. Esta copia es la que se trabaja y modifica. Los cambios al b@'uffer no cambian el fichero, hasta ser guardados. Al guardar el b@'uffer, el b@'uffer se copia en el fichero y por lo tanto se guarda de forma permanente.

source: If you are reading this in Info inside of GNU Emacs, you can evaluate each of the following expressions by positioning the cursor after it and typing @kbd{C-x C-e}.
es: Si est@'a leyendo esto en Info dentro de GNU Emacs, puede evaluar cada una de las siguientes expresiones colocando el cursor despu@'es de estas y pulsando @kbd{C-x C-e}.

source: When I do this in Info, the value returned by evaluating @code{(buffer-name)} is @file{"*info*"}, and the value returned by evaluating @code{(buffer-file-name)} is @file{nil}.
es: Cuando hago esto en Info, el valor devuelto para la evaluaci@'on de @code{(buffer-name)} es @file{"*info*"}, y el valor devuelto por evaluar @code{(buffer-file-name)} es @file{nil}.

source: On the other hand, while I am writing this document, the value returned by evaluating @code{(buffer-name)} is @file{"introduction.texinfo"}, and the value returned by evaluating @code{(buffer-file-name)} is @file{"/gnu/work/intro/introduction.texinfo"}.
es: Por otro lado, mientras escribo este documento, el valor devuelto por la evaluaci@'on de @code{(buffer-name)} es @file{"introduction.texinfo"}, y el valor devuelto por la evaluaci@'on de @code{(buffer-file-name)} es @file{"/gnu/work/intro/introduction.texinfo"}.

source: @code{nil}, history of word
es: @code{nil}, historia de palabra

source: The former is the name of the buffer and the latter is the name of the file. In Info, the buffer name is @file{"*info*"}. Info does not point to any file, so the result of evaluating @code{(buffer-file-name)} is @file{nil}. The symbol @code{nil} is from the Latin word for `nothing'; in this case, it means that the buffer is not associated with any file. (In Lisp, @code{nil} is also used to mean `false' and is a synonym for the empty list, @code{()}.)
es: El primero es el nombre del b@'uffer y el segundo es el nombre del fichero. En Info, el nombre del b@'uffer es @file{"*info*"}. Info no apunta a ning@'un fichero, por lo que el resultado de evaluar @code{(buffer-file-name)}] es @file{nil}. El s@'{@dotless{i}}mbolo @code{nil} proviene del Latin, significa `nada'; en este caso, significa que el b@'uffer no est@'a asociado con ningun fichero. (En Lisp, @code{nil} tambi@'en se usa con el significado de `falso' y es sin@'omino para lista vac@'{@dotless{i}}a, @code{()}.)

source: When I am writing, the name of my buffer is @file{"introduction.texinfo"}. The name of the file to which it points is @file{"/gnu/work/intro/introduction.texinfo"}.
es: Cuando estoy escribiendo, el nombre de mi b@'uffer es @file{"introduction.texinfo"}. El nombre del fichero al que se apunta es @file{"/gnu/work/intro/introduction.texinfo"}.

source: (In the expressions, the parentheses tell the Lisp interpreter to treat @w{@code{buffer-name}} and @w{@code{buffer-file-name}} as functions; without the parentheses, the interpreter would attempt to evaluate the symbols as variables. @xref{Variables}.)
es: (En las expresiones, los par@'entesis hacen que el int@'erprete Lisp trate a @w{@code{buffer-name}} y @w{@code{buffer-file-name}} como funciones; sin los par@'entesis, el int@'erprete intentar@'{@dotless{i}}a evaluar los s@'{@dotless{i}}mbolos como variables. Ver @ref{Variables}.)

source: In spite of the distinction between files and buffers, you will often find that people refer to a file when they mean a buffer and vice-verse. Indeed, most people say, ``I am editing a file,'' rather than saying, ``I am editing a buffer which I will soon save to a file.'' It is almost always clear from context what people mean. When dealing with computer programs, however, it is important to keep the distinction in mind, since the computer is not as smart as a person.
es: A pesar de la distinci@'on entre ficheros y b@'uffers, con frecuencia encontrara que hay personas que se refieren a un fichero cuando quieren un b@'uffer y vice-versa. En realidad, la mayor@'{@dotless{i}}a de la gente dice, ``Estoy editando un fichero,'' en lugar de decir, ``Estoy editando un b@'uffer que pronto voy a guardar en un fichero.'' Esto casi siempre queda claro a partir del contexto de lo que las personas quieren decir. No obstante, al tratar con programas de ordenador, es importante tener la distinci@'on en mente, ya que el ordenador no es tan inteligente como una persona.

source: Buffer, history of word
es: Buffer, historia de palabra

source: The word `buffer', by the way, comes from the meaning of the word as a cushion that deadens the force of a collision. In early computers, a buffer cushioned the interaction between files and the computer's central processing unit. The drums or tapes that held a file and the central processing unit were pieces of equipment that were very different from each other, working at their own speeds, in spurts. The buffer made it possible for them to work together effectively. Eventually, the buffer grew from being an intermediary, a temporary holding place, to being the place where work is done. This transformation is rather like that of a small seaport that grew into a great city: once it was merely the place where cargo was warehoused temporarily before being loaded onto ships; then it became a business and cultural center in its own right.
es: Por cierto, la palabra `b@'uffer', viene del significado de la palabra como un coj@'in que amortigua la fuerza de una colisi@'on. En los primeros ordenadores, un b@'uffer amortiguaba la interacci@'on entre los ficheros y la unidad central de procesamiento de la cumputadora. Los tambores o cintas que contenian un fichero y la unidad de procesamiento eran piezas de equipamiento muy diferentes entre si, trabajando a sus propias velocidades, por rachas. El b@'uffer hizo posible que ambos trabajaran juntos de manera efectiva. Con el tiempo, el b@'uffer pasó de ser un intermediario, a un lugar de almacenamiento temporal, donde se realiza el trabajo. Esta transformaci@'on se parace bastante a la de un peque@~no puerto que se convierte en una gran ciudad: una vez fu@'e el lugar donde la carga era depositada temporalmente antes de ser cargada en los barcos; despues se convirtio en un centro comercial y cultural por derecho propio.

source: Not all buffers are associated with files. For example, a @file{*scratch*} buffer does not visit any file. Similarly, a @file{*Help*} buffer is not associated with any file.
es: No todos los b@'uffers est@'an asociados con ficheros. Por ejemplo, el b@'uffer @file{*scratch*} no visita ningun fichero. Del mismo modo, un b@'uffer @file{*Help*} no est@'a asociado a ningun fichero.

source: In the old days, when you lacked a @file{~/.emacs} file and started an Emacs session by typing the command @code{emacs} alone, without naming any files, Emacs started with the @file{*scratch*} buffer visible. Nowadays, you will see a splash screen. You can follow one of the commands suggested on the splash screen, visit a file, or press the spacebar to reach the @file{*scratch*} buffer.
es: Anta@~no, cuando se carecia de un fichero @file{~/.emacs} y se iniciava una sesi@'on Emacs escribiendo unicamente el comando @code{emacs}, sin nombrar ningun fichero, Emacs iniciaba con el b@'uffer @file{*scratch*} visible. Hoy en d@'{@dotless{i}}a, vera una pantalla de vienvenida. Se puede seguir uno de los comandos sugeridos en dicha pantalla, visitar un fichero, o presionar la barra espaciadora para llegar al b@'uffer @file{*scratch*}.

source: If you switch to the @file{*scratch*} buffer, type @code{(buffer-name)}, position the cursor after it, and then type @kbd{C-x C-e} to evaluate the expression. The name @code{"*scratch*"} will be returned and will appear in the echo area. @code{"*scratch*"} is the name of the buffer. When you type @code{(buffer-file-name)} in the @file{*scratch*} buffer and evaluate that, @code{nil} will appear in the echo area, just as it does when you evaluate @code{(buffer-file-name)} in Info.
es: Si cambia al b@'uffer @file{*scratch*}, escriba @code{(buffer-name)}, coloque el cursor al final de la expresi@'on, y presione @kbd{C-x C-e} para evaluar la expresi@'on. El nombre @code{*scratch*} ser@'a devuelto y aparecer@'a en el @'area echo. @code{*scratch*} es el nombre del b@'uffer. Al escribir y eval@'uar @code{(buffer-file-name)} en el b@'uffer @file{*scratch*}, @code{nil} aparecer@'a en el @'area echo, igual que cuando eval@'ua @code{(buffer-file-name)} en Info.

source: Incidentally, if you are in the @file{*scratch*} buffer and want the value returned by an expression to appear in the @file{*scratch*} buffer itself rather than in the echo area, type @kbd{C-u C-x C-e} instead of @kbd{C-x C-e}. This causes the value returned to appear after the expression. The buffer will look like this:
es: Por cierto, si se encuentra en el b@'uffer @file{*scratch*} y quiere que el valor devuelto por una expresi@'on aparesca en el b@'uffer en s@'{@dotless{i}} y no en el @'area echo, presione @kbd{C-u C-x C-e} en lugar de @kbd{C-x C-e}. Esto causa que el valor devuelto aparezca despu@'es de la expresi@'on. El b@'uffer se ver@'a as@'{@dotless{i}}:

source: You cannot do this in Info since Info is read-only and it will not allow you to change the contents of the buffer. But you can do this in any buffer you can edit; and when you write code or documentation (such as this book), this feature is very useful.
es: No se puede hacer esto en Info ya que Info es de solo lectura y no se permitir@'a cambiar el contenido del b@'uffer. Pero puedes hacer esto en cualquier b@'uffer que se puede editar; y cuando se escribe c@'odigo o documentaci@'on (como este libro), esta funcionalidad es muy @'util.

source: Getting a buffer
es: Teniendo un b@'uffer

source: The @code{buffer-name} function returns the @emph{name} of the buffer; to get the buffer @emph{itself}, a different function is needed: the @code{current-buffer} function. If you use this function in code, what you get is the buffer itself.
es: La funci@'on @code{buffer-name} devuelve el @emph{nombre} del b@'uffer; para obtener el b@'uffer @emph{en s@'{@dotless{i}}}, una funci@'on diferente es necesaria: la funci@'on @code{current-buffer}. Si usa esta funci@'on en el c@'odigo, lo que se obtiene es el b@'uffer en s@'{@dotless{i}}.

source: A name and the object or entity to which the name refers are different from each other. You are not your name. You are a person to whom others refer by name. If you ask to speak to George and someone hands you a card with the letters @samp{G}, @samp{e}, @samp{o}, @samp{r}, @samp{g}, and @samp{e} written on it, you might be amused, but you would not be satisfied. You do not want to speak to the name, but to the person to whom the name refers. A buffer is similar: the name of the scratch buffer is @file{*scratch*}, but the name is not the buffer. To get a buffer itself, you need to use a function such as @code{current-buffer}.
es: Un nombre y el objeto o entidad a la que se refiere el nombre son cosas diferentes entre si. Tu no eres tu nombre, eres una persona a la que se refieren los demas por tu nombre. Si pides hablar con Jorge y alguien te entrega una tarjeta con las letras @samp{J}, @samp{o}, @samp{r}, @samp{g}, y @samp{e} escritas, podr@'{@dotless{i}}as divertirte, pero no estar@'{@dotless{i}}as satisfecho. No quieres hablar con el nombre, sino con la persona a la que el nombre se refiere. Un b@'uffer es similar: el nombre del b@'uffer scratch es @file{*scratch*}, pero el nombre no es el b@'uffer. Para obtener un b@'uffer en s@'{@dotless{i}}, se necesita usar una funci@'on como @code{current-buffer}.

source: However, there is a slight complication: if you evaluate @code{current-buffer} in an expression on its own, as we will do here, what you see is a printed representation of the name of the buffer without the contents of the buffer. Emacs works this way for two reasons: the buffer may be thousands of lines long---too long to be conveniently displayed; and, another buffer may have the same contents but a different name, and it is important to distinguish between them.
es: Sin embargo, hay una ligera complicaci@'on: si eval@'uas @code{current-buffer} en una expresi@'on por s@'{@dotless{i}} sola, como haremos aqu@'{@dotless{i}}, lo que ves es una representaci@'on impresa del nombre del b@'uffer sin los contenidos del b@'uffer. Emacs funciona de esta forma por dos razones: el b@'uffer puede contener miles de l@'{@dotless{i}}neas---demasiado largo para ser mostrado convenientemente; y, otro b@'uffer puede tener los mismos contenidos pero un nombre diferente, y es importante distinguir entre ellos.

source: Here is an expression containing the function:
es: Aqu@'{@dotless{i}} hay una expresi@'on conteniendo la funci@'on:

source: If you evaluate this expression in Info in Emacs in the usual way, @file{#<buffer *info*>} will appear in the echo area. The special format indicates that the buffer itself is being returned, rather than just its name.
es: Si eval@'ua esta expresi@'on en Info de la manera habitual, @file{#<buffer *info*>} aparecer@'a en el @'area echo. El formato especial indica que el b@'uffer en s@'{@dotless{i}} est@'a siendo devuelto, en lugar de solo su nombre.

source: Incidentally, while you can type a number or symbol into a program, you cannot do that with the printed representation of a buffer: the only way to get a buffer itself is with a function such as @code{current-buffer}.
es: Por cierto, si bien puedes escribir un n@'umero o s@'{@dotless{i}}mbolo en un programa, no se puede hacer esto con la representaci@'on impresa del b@'uffer: la @'unica manera de obtener un b@'uffer en s@'{@dotless{i}} mismo es con una funci@'on tal como @code{current-buffer}.

source: A related function is @code{other-buffer}. This returns the most recently selected buffer other than the one you are in currently, not a printed representation of its name. If you have recently switched back and forth from the @file{*scratch*} buffer, @code{other-buffer} will return that buffer.
es: Un funci@'on relacionada es @code{other-buffer}. Esta devuelve el @'ultimo buffer seleccionado distino al que te encuentras actualmente, no una representaci@'on impresa de su nombre. Si recientemente has ido y vuelto del b@'uffer @file{*scratch*}, @code{other-buffer} devolver@'a este b@'uffer.

source: You can see this by evaluating the expression:
es: Se puede ver esto evaluando la expresi@'on:

source: You should see @file{#<buffer *scratch*>} appear in the echo area, or the name of whatever other buffer you switched back from most recently@footnote{Actually, by default, if the buffer from which you just switched is visible to you in another window, @code{other-buffer} will choose the most recent buffer that you cannot see; this is a subtlety that I often forget.}.
es: Ver@'as que @file{#<buffer *scratch*>} aparece en el @'area echo, o el nombre de cualquier otro b@'uffer cambiado anteriormente a partir del m@'as reciente@footnote{En realidad, por defecto, si el b@'uffer desde el que has cambiado es visible por t@'{@dotless{i}} en otra ventana, @code{other-buffer} elegir@'a el b@'uffer m@'as reciente que no puedes ver; esto es una sutileza que a menudo olvido.}

source: Switching to a buffer
es: Cambiando a un b@'uffer

source: The @code{other-buffer} function actually provides a buffer when it is used as an argument to a function that requires one. We can see this by using @code{other-buffer} and @code{switch-to-buffer} to switch to a different buffer.
es: La funci@'on @code{other-buffer} realmente proporciona un b@'uffer cuando se utiliza como argumento de una funci@'on que requiera uno. Podemos ver esto usando @code{other-buffer} y @code{switch-to-buffer} para cambiar a un b@'uffer diferente.
