Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Loop with a Decrementing Counter
es: Bucle que decrementa

source: Decrementing Example
es: Ejemplo de Decremento

source: More pebbles on the beach.
es: M@'as piedras en la playa.

source: Dec Example parts
es: Partes de Ejemplo Dec

source: Dec Example altogether
es: Ejemplo Dec junto

source: Save your time: @code{dolist} and @code{dotimes}
es: Ahorra tiempo: @code{dolist} y @code{dotimes}

source: Building Robots
es: Construyendo robots

source: Same model, different serial number ...
es: Mismo modelo, diferente n@'umero serie ...

source: Recursive Definition Parts
es: Partes de definici@'on recursiva

source: Walk until you stop ...
es: Paseo hasta que tu pares ...

source: Recursion with list
es: Recursi@'on con lista

source: Using a list as the test whether to recurse.
es: Usando una lista con el test si para recurso.

source: Recursive triangle function::
es: Funci@'on recursiva tri@'angulo::

source: Recursion with cond::
es: Recursi@'on con cond::

source: Recursive Patterns
es: Patrones recursivos

source: Often used templates.
es: Plantillas usadas con frecuencia.

source: No Deferment
es: Sin Aplazar

source: Don't store up work ...
es: No almacenar trabajo ...

source: No deferment solution
es: No aplazar la soluci@'on

source: Recursion in Place of a Counter
es: Recursi@'on en lugar de un contador

source: Recursive Example arg of 1 or 2::
es: Ejemplo recursivo y argumento con valor 1 o 2::

source: Recursive Example arg of 3 or 4
es: Ejemplo Recursivo de 3 o 4 argumentos

source: Every::
es: Cada::

source: Accumulate::
es: Acumular::

source: Keep
es: Guardar

source: Regular Expression Searches
es: B@'usquedas de expresiones regulares

source: The regular expression for @code{sentence-end}.
es: La expresi@'on regular para @code{sentence-end}.

source: Very similar to @code{search-forward}.
es: Muy similar a @code{search-forward}.

source: A straightforward example of regexp search.
es: Un ejemplo sencillo de b@'usqueda con expresiones regulares.

source: A somewhat complex example.
es: Un ejemplo complejo de alguna cosa.

source: How to create your own @file{TAGS} table.
es: C@'omo crear tu propia tabla @file{TAGS}.

source: Regexp Review::
es: Revisar regexp::

source: re-search Exercises
es: Ejercicios re-search

source: Complete forward-sentence::
es: Completa forward-sentence::

source: fwd-sentence while loops
es: Bucles while fwd-sentence

source: Two @code{while} loops.
es: Dos bucles @code{while}.

source: fwd-sentence re-search
es: Volver a buscar la frase en sentido directo

source: A regular expression search.
es: Una b@'usqueda de expresi@'on regular.

source: @code{forward-paragraph}: a Goldmine of Functions
es: @code{forward-paragraph}: una mina de oro de funciones

source: forward-paragraph in brief
es: forward-paragraph en breve

source: Key parts of the function definition.
es: Partes clave de la definici@'on de la funci@'on.

source: The @code{let*} expression.
es: La expresi@'on @code{let*}.

source: The forward motion @code{while} loop.
es: El bucle @code{while} con modo hacia adelante.

source: Counting: Repetition and Regexps
es: Contando: repetici@'on y regexps

source: Why Count Words::
es: Por qu@'e Contar Palabras::

source: Use a regexp, but find a problem.
es: Usa un regexp, pero encuentra un problema.

source: Start with case of no words in region.
es: Empezar en caso de que no haya palabras en la regi@'on.

source: Counting Exercise
es: Ejercicio de Contar

source: The @code{@value{COUNT-WORDS}} Function
es: La funci@'on @code{@value{COUNT-WORDS}}

source: Design @value{COUNT-WORDS}
es: Dise@~nar @value{COUNT-WORDS}

source: The definition using a @code{while} loop.
es: La definici@'on usando un bucle @code{while}.

source: Whitespace Bug
es: Error de espacio en blanco

source: The Whitespace Bug in @code{@value{COUNT-WORDS}}.
es: El error de espacio en blanco en @code{@value{COUNT-WORDS}}.

source: Counting Words in a @code{defun}
es: Contando palabras en una @code{defun}

source: Divide and Conquer::
es: Divide y vencer@'as::

source: Words and Symbols
es: Palabras y S@'{@dotless{i}}mbolos

source: What to count?
es: @questiondown{}Qu@'e contar?

source: Syntax
es: Sintaxis

source: What constitutes a word or symbol?
es: @questiondown{}Qu@'e constituye una palabra o s@'{@dotless{i}}mbolo?

source: Very like @code{@value{COUNT-WORDS}}.
es: Similar a @code{@value{COUNT-WORDS}}.

source: Several defuns
es: Varias funciones

source: Counting several defuns in a file.
es: Contando varias funciones en un fichero.

source: Find a File
es: Encontrar un fichero

source: Do you want to look at a file?
es: @questiondown{}Quieres buscar en un fichero?

source: A list of the lengths of many definitions.
es: Una lista de los tama@~nos de muchas definiciones.

source: Several files
es: Varios ficheros

source: Counting in definitions in different files.
es: Contando en definiciones en diferentes ficheros.

source: Several files recursively
es: Varios ficheros recursivamente

source: Recursively counting in different files.
es: Recursivamente contando en diferentes ficheros.

source: Prepare the data
es: Preparar los datos

source: Prepare the data for display in a graph.
es: Preparar los datos para mostrarlos en un grafo.

source: Count Words in @code{defuns} in Different Files
es: Contar palabras en @code{defuns} en diferentes ficheros

source: Return a list of the lengths of defuns.
es: Devolver una lista de tama@~nos de funciones.

source: Attach one list to another.
es: Adjuntar una lista a otra.

source: Prepare the Data for Display in a Graph
es: Preparar los datos para mostrarlos en un grafo

source: Data for Display in Detail::
es: Datos para mostrar en detalle::

source: Sorting
es: Ordenando

source: Sorting lists.
es: Ordenando listas.

source: Files List
es: Listar ficheros

source: Making a list of files.
es: Creando una lista de ficheros.

source: Counting function definitions
es: Contando definiciones de funci@'on

source: Columns of a graph::
es: Columnas de un grafo::

source: How to print the body of a graph.
es: C@'omo imprimir el cuerpo de un grafo.

source: Printed Axes::
es: Ejes Impresos::

source: Line Graph Exercise
es: Ejercicio de L@'{@dotless{i}}nea de Grafo

source: Your @file{.emacs} File
es: Tu fichero @file{.emacs}

source: Default Configuration::
es: Configuraci@'on por defecto::

source: You can write site-wide init files.
es: Se puede escribir site-wide ficheros init.

source: Emacs will write code for you.
es: Emacs escribir@'a c@'odigo para ti.

source: Beginning a .emacs File
es: Empezando un fichero .emacs

source: How to write a @code{.emacs file}.
es: C@'omo escribir un @code{fichero .emacs}.

source: Text and Auto-fill
es: Texto y Autorelleno

source: Automatically wrap lines.
es: Corta l@'{@dotless{i}}neas autom@'aticamente.

source: Mail Aliases
es: Alias de correo

source: Use abbreviations for email addresses.
es: Usar abreviaciones para direcciones de correo electr@'onico.

source: Indent Tabs Mode
es: Indentar modo de tabulaciones

source: Don't use tabs with @TeX{}
es: No usar tabulaciones con @TeX{}

source: Keybindings
es: Atajos de teclado

source: Create some personal keybindings.
es: Crear algunos atajos de teclado personales.

source: Keymaps
es: Mapas de teclado

source: More about key binding.
es: M@'as acerca de atajos de teclado.

source: Loading Files
es: Cargando ficheros

source: Load (i.e., evaluate) files automatically.
es: Cargar (por ej. evaluar) ficheros autom@'aticamente.

source: Autoload
es: Autocarga

source: Make functions available.
es: Crear funciones disponibles.

source: Simple Extension
es: Extensi@'on simple

source: Define a function; bind it to a key.
es: Definir una funci@'on; enlazarla a una tecla.

source: X11 Colors
es: Colores X11

source: Colors in X.
es: Colores en X.

source: Miscellaneous::
es: Miscel@'anea::

source: How to customize your mode line.
es: C@'omo personalizar tu mode line.

source: debug
es: depurar

source: How to use the built-in debugger.
es: C@'omo usar el depurador construido.

source: Start debugging when you call a function.
es: Empezar depurando cuando se llama a una funci@'on.

source: Start debugging when you quit with @kbd{C-g}.
es: Empezar depurando cuando se sale con @kbd{C-g}.

source: How to use Edebug, a source level debugger.
es: C@'omo usar Edebug, un depurador a nivel de fuentes.

source: Debugging Exercises
es: Ejercicios de depuraci@'on

source: Handling the Kill Ring
es: Manejando el anillo de la muerte

source: What the Kill Ring Does::
es: Qu@'e hace el anillo de la muerte::

source: yank
es: pegar

source: Paste a copy of a clipped element.
es: Pegar una copia de un elemento ya cortado.

source: Insert element pointed to.
es: Insertar elemento apuntado.

source: ring file
es: fichero anillo

source: The @code{current-kill} Function
es: La funci@'on @code{current-kill}

source: Code for current-kill::
es: C@'odigo para current-kill::

source: Understanding current-kill
es: Comprendiendo current-kill

source: @code{current-kill} in Outline
es: @code{current-kill} en outline

source: Body of current-kill::
es: Cuerpo de current-kill::

source: Digression concerning error
es: Disgresi@'on concerniente de error

source: How to mislead humans, but not computers.
es: C@'omo confundir humanos, pero no ordenadores.

source: Determining the Element
es: Determinando el elemento

source: A Graph with Labeled Axes
es: Un grafo con ejes etiquetados

source: Labeled Example::
es: Ejemplo etiquetado::

source: @code{let} expression in @code{print-graph}.
es: Expresi@'on @code{let} en @code{print-graph}.

source: Print a label for the vertical axis.
es: Imprimir una etiqueta para los ejes verticales.

source: Print a horizontal label.
es: Imprimir una etiqueta horizontal.

source: Print Whole Graph
es: Imprimir Grafo Entero

source: The function to print a complete graph.
es: La funci@'on para imprimir un grafo completo.

source: The @code{print-Y-axis} Function
es: La funci@'on @code{print-Y-axis}

source: print-Y-axis in Detail::
es: print-Y-axis en Detalle::

source: Height of label
es: Altura de etiqueta

source: What height for the Y axis?
es: @questiondown{}Qu@'e altura para el eje Y?

source: Compute a Remainder
es: Calcular un resto

source: How to compute the remainder of a division.
es: C@'omo calcular el resto de una divisi@'on.

source: Y Axis Element
es: Elemento del Eje Y

source: Construct a line for the Y axis.
es: Construir una l@'{@dotless{i}}nea para el eje Y.

source: Generate a list of Y axis labels.
es: Generar una lista de etiquetas del eje Y.

source: print-Y-axis Penultimate
es: Pen@'ultimo print-Y-axis

source: A not quite final version.
es: Una versi@'on no muy final.

source: The @code{print-X-axis} Function
es: La funci@'on @code{print-X-axis}

source: Similarities differences
es: Diferencias similares

source: Much like @code{print-Y-axis}, but not exactly.
es: Mucho como @code{print-Y-axis}, pero no exactamente.

source: X Axis Tic Marks
es: Eje X marca tic

source: Create tic marks for the horizontal axis.
es: Crear marcas de tic para los ejes horizontales.

source: Printing the Whole Graph
es: Imprimiendo el grafo completo

source: The final version
es: La versi@'on final

source: A few changes.
es: Unos pocos cambios

source: Test print-graph
es: Testear print-graph

source: Run a short test.
es: Ejecutar un r@'apido test.

source: Graphing words in defuns
es: Graficar palabras en funciones

source: Executing the final code.
es: Ejecutando el c@'odigo final.

source: How to write an anonymous function.
es: C@'omo escribir una funci@'on an@'onima.

source: Apply a function to elements of a list.
es: Aplicar una funci@'on a elementos de una lista.

source: Another Bug
es: Otro Error

source: Yet another bug @dots{} most insidious.
es: Todav@'{@dotless{i}}a otro error @dots{} m@'as insidioso.

source: Final printed graph
es: Grafo impreso final

source: The graph itself!
es: @exclamdown{}El grafo en s@'{@dotless{i}}!

source: Most of the GNU Emacs integrated environment is written in the programming language called Emacs Lisp. The code written in this programming language is the software---the sets of instructions---that tell the computer what to do when you give it commands. Emacs is designed so that you can write new code in Emacs Lisp and easily install it as an extension to the editor.
es: La mayor@'{@dotless{i}}a del entorno integrado GNU Emacs est@'a escrito en el lenguaje de programaci@'on llamado Emacs Lisp. El c@'odigo escrito en este lenguaje de programaci@'on es el software---el conjunto de instrucciones---que cuenta al ordenador qu@'e hacer cuando tu le das comandos. Emacs est@'a dise@~nado de forma que se puede escribir nuevo c@'odigo en Emacs Lisp y f@'acilmente instalarlo como una extensi@'on al editor.

source: (GNU Emacs is sometimes called an ``extensible editor'', but it does much more than provide editing capabilities. It is better to refer to Emacs as an ``extensible computing environment''. However, that phrase is quite a mouthful. It is easier to refer to Emacs simply as an editor. Moreover, everything you do in Emacs---find the Mayan date and phases of the moon, simplify polynomials, debug code, manage files, read letters, write books---all these activities are kinds of editing in the most general sense of the word.)
es: (GNU Emacs se define muchas veces como un ``editor extensible'', pero hace mucho m@'as que proporcionar capacidad de edici@'on. Es mejor referirse a Emacs como un ``entorno de computaci@'on extensible''. Sin embargo, esta frase es un poco pretenciosa. Es m@'as f@'acil referirse a Emacs simplemente como un editor. De hecho, cada cosa que se hace en Emacs---encontrar la fecha Maya y fases de la luna, simplificar polinomios, depurar c@'odigo, administrar ficheros, leer cartas, escribir libros---todas estas actividades son maneras de editar en un sentido amplio de la palabra.)

source: Why Study Emacs Lisp?
es: @questiondown{}Por qu@'e estudiar Emacs Lisp?

source: Although Emacs Lisp is usually thought of in association only with Emacs, it is a full computer programming language. You can use Emacs Lisp as you would any other programming language.
es: Aunque Emacs Lisp normalmente se asocia solo con Emacs, es un lenguaje de programaci@'on completo. Se puede usar Emacs Lisp del mismo modo que con cualquier otro lenguaje de programaci@'on.

source: Perhaps you want to understand programming; perhaps you want to extend Emacs; or perhaps you want to become a programmer. This introduction to Emacs Lisp is designed to get you started: to guide you in learning the fundamentals of programming, and more importantly, to show you how you can teach yourself to go further.
es: Quiz@'as se quiere comprender la programaci@'on; quiz@'as se quiere extender Emacs; o quiz@'as se quiere llegar a ser un programador. Esta introducci@'on a Emacs Lisp est@'a dise@~nada para ayudar a empezar en todo esto: para guiarse en el aprendizaje de los fundamentos de programaci@'on, y de manera m@'as importante, para ense@~nar como uno mismo puede ir m@'as all@'a.

source: All through this document, you will see little sample programs you can run inside of Emacs. If you read this document in Info inside of GNU Emacs, you can run the programs as they appear. (This is easy to do and is explained when the examples are presented.) Alternatively, you can read this introduction as a printed book while sitting beside a computer running Emacs. (This is what I like to do; I like printed books.) If you don't have a running Emacs beside you, you can still read this book, but in this case, it is best to treat it as a novel or as a travel guide to a country not yet visited: interesting, but not the same as being there.
es: A trav@'es de este libro, se ver@'an peque@~nos programas de ejemplo que se pueden ejecutar dentro de Emacs. Si se lee este documento en Info dentro de GNU Emacs, se pueden ejecutar los programas tal y como aparecen. (Esto es f@'acil de hacer y se explica cuando los ejemplos se presentan). Alternativamente, se puede leer esta introducci@'on como un libro impreso mientras se est@'a sentando con un ordenador ejecutando Emacs. (Esto es lo que me gusta hacer; me gustan los libros impresos.) Si no se est@'a ejecutando Emacs, todav@'{@dotless{i}}a se puede leer este libro, pero en este caso, lo mejor es tratarlo como una novela, o como una gu@'{@dotless{i}}a de v@'{i}aje a un pa@'{i}s a@'{u}n no visitado: interesante, pero no es lo mismo que estar all@'{@dotless{i}}.

source: Much of this introduction is dedicated to walkthroughs or guided tours of code used in GNU Emacs. These tours are designed for two purposes: first, to give you familiarity with real, working code (code you use every day); and, second, to give you familiarity with the way Emacs works. It is interesting to see how a working environment is implemented. Also, I hope that you will pick up the habit of browsing through source code. You can learn from it and mine it for ideas. Having GNU Emacs is like having a dragon's cave of treasures.
es: Gran parte de esta introducci@'on se dedica a paseos guiados de c@'odigo usado en GNU Emacs. Estos paseos est@'an dise@~nados para dos prop@'ositos: primero, familiarizarse con c@'odigo real que funciona (c@'odigo que se usa cada d@'{@dotless{i}}a); y, segundo, familiarizarse con c@'omo funciona Emacs. Es interesante ver c@'omo se implementa un entorno completamente operativo. Tambi@'en, espero que se adquiera el h@'abito de navegar a trav@'es del c@'odigo fuente. Se puede aprender mucho comparando c@'odigo de otros con el propio, ganando nuevas ideas. Tener GNU Emacs es como tener la cueva del drag@'on de los tesoros.

source: In addition to learning about Emacs as an editor and Emacs Lisp as a programming language, the examples and guided tours will give you an opportunity to get acquainted with Emacs as a Lisp programming environment. GNU Emacs supports programming and provides tools that you will want to become comfortable using, such as @kbd{M-.} (the key which invokes the @code{find-tag} command). You will also learn about buffers and other objects that are part of the environment. Learning about these features of Emacs is like learning new routes around your home town.
es: Adem@'as de aprender acerca de Emacs como editor y Emacs Lisp como lenguaje de programaci@'on, los ejemplos y visitas guiadas le dar@'an una oportunidad para familiarizarse con Emacs como un entorno de programaci@'on Lisp. GNU Emacs soporta programaci@'on y provee herramientas que llegar@'an a usarse c@'omodamente, como @kbd{M-.} (la clave que invoca el comando @code{find-tag}). Tambi@'en aprendera sobre b@'uffers y otros objetos que forman parte del entorno. Aprender estas funcionalidades de Emacs es como aprender nuevas rutas alrededor de tu hogar.

source: Finally, I hope to convey some of the skills for using Emacs to learn aspects of programming that you don't know. You can often use Emacs to help you understand what puzzles you or to find out how to do something new. This self-reliance is not only a pleasure, but an advantage.
es: Finalmente, espero poder transmitir algunas habilidades de Emacs para aprender aspectos de programaci@'on que no se conocen. Con frecuencia se puede usar Emacs para ayudar a comprender qu@'e puzzles encontrar o como hacer alguna cosa nueva. Este auto-descubrimiento no es solo un placer, tambi@'en es una ventaja.

source: For Whom This is Written
es: Para quien est@'a esto escrito

source: This text is written as an elementary introduction for people who are not programmers. If you are a programmer, you may not be satisfied with this primer. The reason is that you may have become expert at reading reference manuals and be put off by the way this text is organized.
es: Este texto est@'a escrito como una introducci@'on elemental para personas que no son programadoras. Quien ya programa, puede no estar satisfecho con este libro. La raz@'on es que un programador puede tener que convertirse en experto leyendo manuales de referencia y este texto no est@'a organizado como un manual de referencia.

source: An expert programmer who reviewed this text said to me:
es: Un programador experto que revis@'o este texto me dijo:

source: I prefer to learn from reference manuals. I ``dive into'' each paragraph, and ``come up for air'' between paragraphs.
es: Prefiero aprender desde manuales de referencia. Yo ``me sumerjo'' en cada p@'arrafo y ``subo a por aire'' entre p@'arrafos.

source: When I get to the end of a paragraph, I assume that that subject is done, finished, that I know everything I need (with the possible exception of the case when the next paragraph starts talking about it in more detail). I expect that a well written reference manual will not have a lot of redundancy, and that it will have excellent pointers to the (one) place where the information I want is.
es: Cuando llego al fin de un p@'arrafo, asumo que este asunto est@'a hecho, finalizado, que conozco cada cosa que necesito (con la posible excepci@'on del caso en el que el siguiente p@'arrafo empiece hablando acerca de eso mismo en m@'as detalle). Yo espero que un manual de referencia bien escrito no tendr@'a un mont@'on de redundancia, y tendr@'a excelentes punteros a (un) lugar donde est@'a la informaci@'on que quiero.

source: This introduction is not written for this person!
es: @exclamdown{}Esta introducci@'on no est@'a escrita para esta persona!

source: Firstly, I try to say everything at least three times: first, to introduce it; second, to show it in context; and third, to show it in a different context, or to review it.
es: Primero, intento decir cada cosa al menos tres veces: primero, introducirlo; segundo, mostrarlo en contexto; y tercero, mostrarlo en un contexto diferente, o revisarlo.

source: Secondly, I hardly ever put all the information about a subject in one place, much less in one paragraph. To my way of thinking, that imposes too heavy a burden on the reader. Instead I try to explain only what you need to know at the time. (Sometimes I include a little extra information so you won't be surprised later when the additional information is formally introduced.)
es: Segundo, yo no siempre pongo toda la informaci@'on acerca de un asunto en un mismo lugar, ni mucho menos en un p@'arrafo. Desde mi punto de vista, se necesita una carga bastante fuerte en el lector. En vez de eso intento explicar solo lo que se necesita saber en el momento. (Algunas veces incluyo una peque@~na informaci@'on extra, para que no haya sorpresas m@'as tarde cuando la informaci@'on adicional se presente formalmente.)

source: When you read this text, you are not expected to learn everything the first time. Frequently, you need only make, as it were, a `nodding acquaintance' with some of the items mentioned. My hope is that I have structured the text and given you enough hints that you will be alert to what is important, and concentrate on it.
es: Cuando uno lee este texto, no espera aprender todo la primera vez. Frecuentemente, solo necesita hacer un `reconocimiento' con alguno de los elementos mencionados. Mi esperanza es haber estructurado el texto y dar suficientes indicios que dejar@'an alerta de lo que es importante y concentrarse en ellos.

source: You will need to ``dive into'' some paragraphs; there is no other way to read them. But I have tried to keep down the number of such paragraphs. This book is intended as an approachable hill, rather than as a daunting mountain.
es: Es necesario ``sumergirse'' en algunos p@'arrafos; no hay otro modo de leerlos. Pero yo he intentado guardar el n@'umero de tales p@'arrafos. Este libro pretende ser como una colina asequible, en vez de una monta@~na abrumadora.
