Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: But first, a brief introduction to the @code{switch-to-buffer} function. When you switched back and forth from Info to the @file{*scratch*} buffer to evaluate @code{(buffer-name)}, you most likely typed @kbd{C-x b} and then typed @file{*scratch*}@footnote{Or rather, to save typing, you probably only typed @kbd{RET} if the default buffer was @file{*scratch*}, or if it was different, then you typed just part of the name, such as @code{*sc}, pressed your @kbd{TAB} key to cause it to expand to the full name, and then typed @kbd{RET}.} when prompted in the minibuffer for the name of the buffer to which you wanted to switch. The keystrokes, @kbd{C-x b}, cause the Lisp interpreter to evaluate the interactive function @code{switch-to-buffer}. As we said before, this is how Emacs works: different keystrokes call or run different functions. For example, @kbd{C-f} calls @code{forward-char}, @kbd{M-e} calls @code{forward-sentence}, and so on.
es: Pero primero, una breve introducci@'on a la funci@'on @code{switch-to-buffer}. Cuando cambia de ida y vuelta de Info al b@'uffer @file{*scratch*} para evaluar @code{(buffer-name)}, normalmente se presiona @kbd{C-x b} y se pasa @file{*scratch*}@footnote{O mejor, para evitar escribir, probablemente solo necesite pulsar @kbd{RET} si @file{*scratch*} es el buffer por defecto, de ser diferente, solo escriba parte del nombre, por ejemplo @code{*sc}, luego presione la tecla @kbd{TAB} para hacer que se expanda el nombre completo, y finalmente pulsa @kbd{RET}} en el minibuffer cuando se le solicita el nombre del b@'uffer al que se quiere cambiar. El atajo, @kbd{C-x b}, hace que el int@'erprete Lisp eval@'ue la funci@'on interactiva @code{switch-to-buffer}. Como hemos dicho anteriormente, as@'{@dotless{i}} es como funciona Emacs: diferentes atajos de teclado llaman o ejecutan diferentes funciones. Por ejemplo, @kbd{C-f} llama a @code{forward-char}, @kbd{M-e} llama a @code{forward-sentence}, etc'etera.

source: By writing @code{switch-to-buffer} in an expression, and giving it a buffer to switch to, we can switch buffers just the way @kbd{C-x b} does:
es: Escribiendo @code{switch-to-buffer} en una expresi@'on, y d@'andole un b@'uffer para cambiar, se puede cambiar de b@'uffers tal y como hace @kbd{C-x b}.

source: The symbol @code{switch-to-buffer} is the first element of the list, so the Lisp interpreter will treat it as a function and carry out the instructions that are attached to it. But before doing that, the interpreter will note that @code{other-buffer} is inside parentheses and work on that symbol first. @code{other-buffer} is the first (and in this case, the only) element of this list, so the Lisp interpreter calls or runs the function. It returns another buffer. Next, the interpreter runs @code{switch-to-buffer}, passing to it, as an argument, the other buffer, which is what Emacs will switch to. If you are reading this in Info, try this now. Evaluate the expression. (To get back, type @kbd{C-x b @key{RET}}.)@footnote{Remember, this expression will move you to your most recent other buffer that you cannot see. If you really want to go to your most recently selected buffer, even if you can still see it, you need to evaluate the following more complex expression: @smallexample (switch-to-buffer (other-buffer (current-buffer) t)) @end smallexample In this case, the first argument to @code{other-buffer} tells it which buffer to skip---the current one---and the second argument tells @code{other-buffer} it is OK to switch to a visible buffer. In regular use, @code{switch-to-buffer} takes you to an invisible window since you would most likely use @kbd{C-x o} (@code{other-window}) to go to another visible buffer.}
es: El s@'{@dotless{i}}mbolo @code{switch-to-buffer} es el primer elemento de la lista, por lo que el int@'erprete Lisp lo tratar@'a como una funci@'on y llevara a cavo las instrucciones adjuntas al mismo. Pero antes de hacer esto, el int@'erprete observara que @code{other-buffer} est@'a dentro de par@'entesis y trabaja en este s@'{@dotless{i}}mbolo primero. @code{other-buffer} es el primer (y en este caso, el @'unico) elemento de esta lista, por lo que el int@'erprete Lisp llama o ejecuta la funci@'on. Esto devuelve un buffer distinto al actual. A continuaci@'on, el int@'erprete ejecuta @code{switch-to-buffer}, pasando, como argumento, el b@'uffer devuelto, que es al que Emacs cambia. Si est@'as leyendo esto en Info, prueba esto ahora. Eval@'ua la expresi@'on. (Para volver, presiona @kbd{C-x b @key{RET}}.)@footnote{Recuerda, esta expresi@'on te desplaza al b@'uffer m@'as reciente que no puedas ver. Si realmente quieres ir al ultimo b@'uffers seleccionado, incluso si es visible, es necesario evaluar la siguiente expresi@'on m@'as compleja: @smallexample (switch-to-buffer (other-buffer (current-buffer) t)) @end smallexample En este caso, el primer argumento de @code{other-buffer} le dice a que b@'uffer saltar ---el actual--- y el segundo argumento le indica a @code{other-buffer} que esta BIEN cambiar a un b@'uffer visible. La utilidad de @code{switch-to-buffer} es llevarte a una ventana invisible ya que probablemente usar@'{@dotless{i}}as @kbd{C-x o} (@code{other-window}) para ir a otro b@'uffer visible}.

source: In the programming examples in later sections of this document, you will see the function @code{set-buffer} more often than @code{switch-to-buffer}. This is because of a difference between computer programs and humans: humans have eyes and expect to see the buffer on which they are working on their computer terminals. This is so obvious, it almost goes without saying. However, programs do not have eyes. When a computer program works on a buffer, that buffer does not need to be visible on the screen.
es: En los ejemplos de programaci@'on en secciones posteriores de este documento, se ve la funci@'on @code{set-buffer} con m@'as con frecuencia que @code{switch-to-buffer}. Esto es porque a diferencia de los programas de ordenador: los humanos tienen ojos y esperan ver el b@'uffer en el que ellos est@'an trabajando en sus terminales de ordenador. Esto es tan obvio, que casi no hace falta decirlo. Sin embargo, los programas no tienen ojos. Cuando un programa de ordenador trabaja en un b@'uffer, el b@'uffer no necesita ser visible en la pantalla.

source: @code{switch-to-buffer} is designed for humans and does two different things: it switches the buffer to which Emacs's attention is directed; and it switches the buffer displayed in the window to the new buffer. @code{set-buffer}, on the other hand, does only one thing: it switches the attention of the computer program to a different buffer. The buffer on the screen remains unchanged (of course, normally nothing happens there until the command finishes running).
es: @code{switch-to-buffer} est@'a dise@~nado para humanos y hace dos cosas diferentes: cambia el b@'uffer para el que la atenci@'on de Emacs est@'a dirigida; y cambia el b@'uffer mostrada en la ventana al nuevo b@'uffer. @code{set-buffer}, por otro lado, hace solo una cosa: eso cambia la atenci@'on del programa del ordenador a un b@'uffer. El b@'uffer en la pantalla permanece sin cambios (de acuerdo, normalmente no ocurre nada hasta que el comando finaliza ejecut@'andose).

source: @samp{call} defined
es: @samp{llamada} definida

source: Also, we have just introduced another jargon term, the word @dfn{call}. When you evaluate a list in which the first symbol is a function, you are calling that function. The use of the term comes from the notion of the function as an entity that can do something for you if you `call' it---just as a plumber is an entity who can fix a leak if you call him or her.
es: Tambi@'en, nosotros hemos introducido otro t@'ermino de jerga, la palabra @dfn{llamada}. Cuando tu eval@'uas una lista en el que el primer s@'{@dotless{i}}mbolo es una funci@'on, tu est@'as llamando a esta funci@'on. El uso del t@'ermino viene desde la noci@'on de la funci@'on como una entidad que puede hacer alguna cosa para t@'{@dotless{i}} si tu la `llamas' --- es decir, es una entidad que puede arreglar un problema si le llamas a @'el o a ella.

source: Buffer Size and the Location of Point
es: Tama@~no de b@'uffer y la localizaci@'on del punto

source: Size of buffer
es: Tama@~no del b@'uffer

source: Buffer size
es: Tama@~no del B@'uffer

source: Point location
es: Localizaci@'on del Punto

source: Location of point
es: Localizaci@'on del punto

source: Finally, let's look at several rather simple functions, @code{buffer-size}, @code{point}, @code{point-min}, and @code{point-max}. These give information about the size of a buffer and the location of point within it.
es: Finalmente, perm@'{@dotless{i}}tame en varias funciones simples, @code{buffer-size}, @code{point}, @code{point-min}, y @code{point-max}. Estas dan informaci@'on acerca del tama@~no de un b@'uffer y la localizaci@'on del punto con eso.

source: The function @code{buffer-size} tells you the size of the current buffer; that is, the function returns a count of the number of characters in the buffer.
es: La funci@'on @code{buffer-size} te cuenta el tama@~no del b@'uffer actual; que es, la funci@'on un contaje del n@'umero de caracteres en el buffer.

source: You can evaluate this in the usual way, by positioning the cursor after the expression and typing @kbd{C-x C-e}.
es: Se puede evaluar esto en el camino usual, posicionando el cursor despu@'es de la expresi@'on y escribiendo @kbd{C-x C-e}.

source: @samp{point} defined
es: definici@'on de @samp{punto}

source: In Emacs, the current position of the cursor is called @dfn{point}. The expression @code{(point)} returns a number that tells you where the cursor is located as a count of the number of characters from the beginning of the buffer up to point.
es: En Emacs, la posici@'on actual del cursor es llamada @dfn{punto}. La expresi@'on @code{(point)} devuelve un n@'umero que cuenta donde est@'a localizado como un contaje del n@'umero de caracteres desde el principio del b@'uffer al punto.

source: You can see the character count for point in this buffer by evaluating the following expression in the usual way:
es: Se puede ver el contaje de caracteres apuntar en este b@'uffer evaluando la siguiente expresi@'on en el camino normal:

source: As I write this, the value of @code{point} is 65724. The @code{point} function is frequently used in some of the examples later in this book.
es: Mientras escribo esto, el valor de @code{point} es 65724. La funci@'on @code{point} est@'a frecuentemente usada en alguno de los ejemplos posteriores en este libro.

source: The value of point depends, of course, on its location within the buffer. If you evaluate point in this spot, the number will be larger:
es: El valor del punto depende, de acuerdo, a la posici@'on que tiene en el b@'uffer. Si se eval@'ua punto en este lugar, el n@'umero ser@'a largo:

source: For me, the value of point in this location is 66043, which means that there are 319 characters (including spaces) between the two expressions. (Doubtless, you will see different numbers, since I will have edited this since I first evaluated point.)
es: Para m@'{@dotless{i}}, el valor del punto en esta posici@'on es 66043, lo que significa que hay 319 caracteres (incluyendo espacios) entre las dos expresiones. (Sin duda, se ver@'an diferentes n@'umeros, puesto que se ha editado esto desde que se evalu@'o (point).)

source: @samp{narrowing} defined
es: @samp{narrowing} definido

source: The function @code{point-min} is somewhat similar to @code{point}, but it returns the value of the minimum permissible value of point in the current buffer. This is the number 1 unless @dfn{narrowing} is in effect. (Narrowing is a mechanism whereby you can restrict yourself, or a program, to operations on just a part of a buffer. @xref{Narrowing & Widening, , Narrowing and Widening}.) Likewise, the function @code{point-max} returns the value of the maximum permissible value of point in the current buffer.
es: La funci@'on @code{point-min} es similar a @code{point}, pero eso devuelve del valor m@'{@dotless{i}}nimo permisible del punto en el b@'uffer actual. Este es el n@'umero 1 a menos que @dfn{narrowing} est@'e en efecto. (Narrowing, @emph{Encogiendo} es un mecanismo donde uno se puede encoger a uno mismo, o un programa, a operaciones en solo un parte de un b@'uffer. @ref{Encogiendo y extendiendo}.) As@'{@dotless{i}}, la funci@'on @code{point-max} devuelve el valor del valor m@'aximo permisible del punto en el b@'uffer actual.

source: Exercise
es: Ejercicio

source: Find a file with which you are working and move towards its middle. Find its buffer name, file name, length, and your position in the file.
es: Encuentra un fichero con que tu est@'as trabajando y mueve hasta la mitad. Encuentra el nombre de b@'uffer, el nombre del fichero, tama@~no, y su posici@'on en el fichero.

source: Definition writing
es: Escribiendo la Definici@'on

source: Function definition writing
es: Escribiendo la Definici@'on de Funci@'on

source: Writing a function definition
es: Escribiendo una definici@'on funci@'on

source: When the Lisp interpreter evaluates a list, it looks to see whether the first symbol on the list has a function definition attached to it; or, put another way, whether the symbol points to a function definition. If it does, the computer carries out the instructions in the definition. A symbol that has a function definition is called, simply, a function (although, properly speaking, the definition is the function and the symbol refers to it.)
es: Cuando el int@'erprete eval@'ua una lista, se ve si el primer s@'{@dotless{i}}mbolo en la lista tiene definici@'on adjunta; o, pone otro camino, si el s@'{@dotless{i}}mbolo apunta a una definici@'on de funci@'on. Si lo hace, el ordenador trae las instrucciones en la definici@'on. Un s@'{@dotless{i}}mbolo que tiene una definici@'on de funci@'on llamada, simplemente, una funci@'on (aunque apropiadamente hablando, la definici@'on es la funci@'on y el s@'{@dotless{i}}mbolo se refiere a eso).

source: Primitive Functions
es: Funciones primitivas

source: An Aside about Primitive Functions
es: Una v@'{@dotless{i}}a acerca de funciones primitivas

source: Primitive functions
es: Funciones primitivas

source: Functions, primitive
es: Funciones, primitiva

source: C language primitives
es: Primitivas en lenguaje C

source: Primitives written in C
es: Primitivas escritas en C

source: All functions are defined in terms of other functions, except for a few @dfn{primitive} functions that are written in the C programming language. When you write functions' definitions, you will write them in Emacs Lisp and use other functions as your building blocks. Some of the functions you will use will themselves be written in Emacs Lisp (perhaps by you) and some will be primitives written in C@. The primitive functions are used exactly like those written in Emacs Lisp and behave like them. They are written in C so we can easily run GNU Emacs on any computer that has sufficient power and can run C.
es: Todas las funciones est@'an definidas en t@'erminos de otras funciones, excepto por unas nuevas funciones @dfn{primitivas} que son escritas en el lenguaje de programaci@'on C. Cuando se escriben definiciones de funciones, se escriben en Emacs Lisp y se usan otras funciones como bloques en construcci@'on. Algunas de las funciones usadas en s@'{@dotless{i}} mismas est@'an escritas en Emacs Lisp (quiz@'as por t@'{@dotless{i}}) y algunas ser@'an primitivas escritas en C@. Las funciones primitivas est@'an escritas en C as@'{@dotless{i}} podemos f@'acilmente ejecutarlas en GNU Emacs en cualquier ordenador que tiene suficiente poder y puede ejecutar C.

source: Let me re-emphasize this: when you write code in Emacs Lisp, you do not distinguish between the use of functions written in C and the use of functions written in Emacs Lisp. The difference is irrelevant. I mention the distinction only because it is interesting to know. Indeed, unless you investigate, you won't know whether an already-written function is written in Emacs Lisp or C.
es: Perm@'{@dotless{i}}teme enfatizar esto: cuando se escribe c@'odigo en Emacs Lisp, no se distinge entre el uso de funciones escritas en C y el uso de funciones escritas en Emacs Lisp. La diferencia es irrevelante. Yo menciono la distinci@'on solo porque es interesante conocerla. A menos que se investigue, uno no se da cuenta si una funci@'on ya escrita es escrita en Emacs Lisp o C.

source: The @code{defun} Special Form
es: La forma especial @code{defun}

source: Special form of @code{defun}
es: Forma Especial de @code{defun}

source: @samp{function definition} defined
es: @samp{definici@'on funci@'on} definida

source: In Lisp, a symbol such as @code{mark-whole-buffer} has code attached to it that tells the computer what to do when the function is called. This code is called the @dfn{function definition} and is created by evaluating a Lisp expression that starts with the symbol @code{defun} (which is an abbreviation for @emph{define function}). Because @code{defun} does not evaluate its arguments in the usual way, it is called a @dfn{special form}.
es: En Lisp, un s@'{@dotless{i}}mbolo tal como @code{mark-whole-buffer} tiene c@'odigo adjunto que cuenta lo que el ordenador hace cuando la funci@'on es llamada. Este c@'odigo es llamado la @dfn{definici@'on de funci@'on} y es creado evaluando una expresi@'on Lisp que empieza con el s@'{@dotless{i}}mbolo @code{defun} (que es una abreviaci@'on para @emph{funci@'on define}). Porque @code{defun} no eval@'ua sus argumentos en el camino usual, eso se llama @dfn{forma especial}.

source: In subsequent sections, we will look at function definitions from the Emacs source code, such as @code{mark-whole-buffer}. In this section, we will describe a simple function definition so you can see how it looks. This function definition uses arithmetic because it makes for a simple example. Some people dislike examples using arithmetic; however, if you are such a person, do not despair. Hardly any of the code we will study in the remainder of this introduction involves arithmetic or mathematics. The examples mostly involve text in one way or another.
es: En secciones subsiguientes, miraremos en definiciones de funci@'on desde el c@'odigo fuente Emacs, tales como @code{mark-whole-buffer}. En esta secci@'on, describiremos una definici@'on de funci@'on simple, as@'{@dotless{i}} puedes ver como se ve. Esta definici@'on de funci@'on usa aritm@'etica porque es un ejemplo simple. Algunas personas no le gustan los ejemplos usando aritm@'etica; sin embargo, si usted es tal persona, no se asuste. En realidad, cualquier c@'odigo que se puede estudiar en esta introducci@'on va a recordar a aritm@'etica o matem@'aticas. Los ejemplos de manera mayoritaria involucran texto en un camino u otro.

source: A function definition has up to five parts following the word @code{defun}:
es: Una definici@'on de funci@'on tiene cinco partes siguiendo la palabra @code{defun}:

source: The name of the symbol to which the function definition should be attached.
es: El nombre del s@'{@dotless{i}}mbolo para el que la definici@'on de funci@'on ser@'{@dotless{i}}a adjunta.

source: A list of the arguments that will be passed to the function. If no arguments will be passed to the function, this is an empty list, @code{()}.
es: Una lista de los argumentos que ser@'an pasados a la funci@'on. Si no hay argumentos, tendremos una lista vac@'{@dotless{i}}a, @code{()}.

source: Documentation describing the function. (Technically optional, but strongly recommended.)
es: Documentaci@'on describiendo la funci@'on. (T@'ecnicamente opcional, pero fuertemente recomendada.)

source: Optionally, an expression to make the function interactive so you can use it by typing @kbd{M-x} and then the name of the function; or by typing an appropriate key or keychord.
es: Opcionalmente, una expresi@'on para crear la funci@'on interactive as@'{@dotless{i}} se puede usar escribiendo @kbd{M-x} y entonces el nombre de la funci@'on; o escribiendo una tecla apropiada o acorde.

source: @samp{body} defined
es: @samp{cuerpo} definido

source: The code that instructs the computer what to do: the @dfn{body} of the function definition.
es: El c@'odigo que instruye el ordenador qu@'e hacer: el @dfn{cuerpo} de la definici@'on de funci@'on.

source: It is helpful to think of the five parts of a function definition as being organized in a template, with slots for each part:
es: Es @'util pensar las cinco partes de una definici@'on de funci@'on siendo organizada en una plantilla, con slots para cada parte:

source: (defun @var{function-name} (@var{arguments}@dots{}) "@var{optional-documentation}@dots{}" (interactive @var{argument-passing-info}) ; @r{optional} @var{body}@dots{})
es: (defun @var{function-name} (@var{arguments}@dots{}) "@var{documentacion-opcional}@dots{}" (interactive @var{argument-passing-info}) ; @r{opcional} @var{body}@dots{})

source: As an example, here is the code for a function that multiplies its argument by 7. (This example is not interactive. @xref{Interactive, , Making a Function Interactive}, for that information.)
es: Por ejemplo, aqu@'{@dotless{i}} est@'a el c@'odigo para una funci@'on que multiplica sus argumentos por 7. (Este ejemplo no es interactivo. Ver @ref{Interactive, , Creando una Funci@'on Interactive}, para esta informaci@'on.)

source: (defun multiply-by-seven (number) "Multiply NUMBER by seven." (* 7 number))
es: (defun multiply-by-seven (number) "Multiplicar NUMBER por siete." (* 7 number))

source: This definition begins with a parenthesis and the symbol @code{defun}, followed by the name of the function.
es: Esta definici@'on empieza con un par@'entesis y el s@'{@dotless{i}}mbolo @code{defun} seguido por el nombre de la funci@'on.

source: @samp{argument list} defined
es: @samp{lista de argumentos} definida

source: The name of the function is followed by a list that contains the arguments that will be passed to the function. This list is called the @dfn{argument list}. In this example, the list has only one element, the symbol, @code{number}. When the function is used, the symbol will be bound to the value that is used as the argument to the function.
es: El nombre de la funci@'on est@'a seguido por una lista que contiene los argumentos que ser@'an pasados a la funci@'on. Esta lista es llamada por la @dfn{lista de argumentos}. En este ejemplo, la lista tiene solo un elemento, el s@'{@dotless{i}}mbolo @code{n@'umero}. Cuando la funci@'on es usada, el s@'{@dotless{i}}mbolo ser@'a asociado al valor que es usado como el argumento para la funci@'on
