Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The second line causes Emacs to turn on Auto Fill mode when it turns on Text mode. In Auto Fill mode, Emacs automatically breaks a line that is too wide and brings the excessively wide part of the line down to the next line. Emacs breaks lines between words, not within them.
es: La segunda l@'{@dotless{i}}nea causa que Emacs active el modo Auto Fill cuando cambia al modo Texto. En modo Auto Fill, Emacs autom@'aticamente rompe una l@'{@dotless{i}}nea que es demasiado amplio y trae la parte excesivamente amplia de la l@'{@dotless{i}}nea de debajo a la siguiente l@'{@dotless{i}}nea. Emacs rompe l@'{@dotless{i}}neas entre palabras con ellas.

source: When Auto Fill mode is turned off, lines continue to the right as you type them. Depending on how you set the value of @code{truncate-lines}, the words you type either disappear off the right side of the screen, or else are shown, in a rather ugly and unreadable manner, as a continuation line on the screen.
es: Cuando el modo Auto Fill est@'a desactivado, las l@'{@dotless{i}}neas contin@'uan a la derecha como se escriben. Dependiendo de como configuras el valor de @code{truncate-lines}, las palabras que se escribe si desaparecen al lado derecho de la pantalla, o lo dem@'as son mostradas, en un modo feo e ilegible, como una l@'{@dotless{i}}nea de continuaci@'on en la pantalla.

source: In addition, in this part of my @file{.emacs} file, I tell the Emacs fill commands to insert two spaces after a colon:
es: Adem@'as, en esta parte de mi fichero @file{.emacs}, yo cuento a Emacs el ajuste de comandos para insertar dos espacios despu@'es de dos puntos:

source: Here is a @code{setq} that `turns on' mail aliases, along with more reminders.
es: Aqu@'{@dotless{i}} hay un @code{setq} que `activa' el alias de correo, para m@'as ocasiones.

source: ;;; Mail mode ; To enter mail mode, type `C-x m' ; To enter RMAIL (for reading mail), ; type `M-x rmail' (setq mail-aliases t)
es: ;;; Modo Correo ; Para entrar en el modo correo, escribe `C-x m' ; Para introducir RMAIL (para leer el correo), ; escribe `M-x rmail' (setq mail-aliases t)

source: Mail aliases
es: Alias de correo

source: This @code{setq} command sets the value of the variable @code{mail-aliases} to @code{t}. Since @code{t} means true, the line says, in effect, ``Yes, use mail aliases.''
es: Este comando @code{setq} asigna el valor de la variable @code{mail-aliases} al @code{t}. Desde que @code{t} significa cierto, la l@'{@dotless{i}}nea dice, en efecto, ``S@'{@dotless{i}} uso alias de correo.''

source: Mail aliases are convenient short names for long email addresses or for lists of email addresses. The file where you keep your `aliases' is @file{~/.mailrc}. You write an alias like this:
es: Los alias de correo son nombres cortos convenientes para largas direcciones de correo o para listas de direcciones de correo. El fichero donde guardar tus `aliases' es @file{~/.mailrc}. Se escribe un alias como este:

source: When you write a message to George, address it to @samp{geo}; the mailer will automatically expand @samp{geo} to the full address.
es: Cuando se escribe un mensaje a Jorge, la direcci@'on a @samp{geo}; el correo autom@'aticamente expandir@'a @samp{geo} a la direcci@'on completa.

source: Tabs, preventing
es: Tabuladores, previniendo

source: By default, Emacs inserts tabs in place of multiple spaces when it formats a region. (For example, you might indent many lines of text all at once with the @code{indent-region} command.) Tabs look fine on a terminal or with ordinary printing, but they produce badly indented output when you use @TeX{} or Texinfo since @TeX{} ignores tabs.
es: Por defecto, Emacs inserta tabulaciones en lugar en m@'ultiples espacios cuando se formatea una regi@'on. (Por ejemplo, se podr@'{@dotless{i}}an indentar muchas l@'{@dotless{i}}neas de texto todo a la vez con el comando @code{indent-region}.) Los tabuladores se ven bien en un terminal o con impresi@'on ordinaria, pero ellos producen mala salida de indentaci@'on cuando se usa @TeX{} o Texinfo puesto que @TeX{} ignora tabuladores.

source: The following turns off Indent Tabs mode:
es: Lo siguiente desactiva el modo de Indentar Tabulaciones:

source: ;;; Prevent Extraneous Tabs (setq-default indent-tabs-mode nil)
es: ;;; Prevenir Tabulaciones Extra@~nas (setq-default indent-tabs-mode nil)

source: Note that this line uses @code{setq-default} rather than the @code{setq} command that we have seen before. The @code{setq-default} command sets values only in buffers that do not have their own local values for the variable.
es: Note que esta l@'{@dotless{i}}nea usa @code{setq-default} en vez de el comando @code{setq} que hemos visto antes. El comando @code{setq-default} asigna valores solo en b@'uffers que no tienen sus propios valores locales para la variable.

source: @xref{Just Spaces, , Tabs vs. Spaces, emacs, The GNU Emacs Manual}.
es: @xref{Solo Espacios, Tabuladores versus Espacios, emacs, El Manual de GNU Emacs}.

source: See sections ``Tabs vs.@: Spaces'' and ``Local Variables in Files'' in @cite{The GNU Emacs Manual}.
es: Ver secciones ``Tabuladores versus Espacios'' y ``Variables Locales en Ficheros'' en @cite{El Manual de GNU Emacs}.

source: Some Keybindings
es: Algunos atajos

source: Now for some personal keybindings:
es: Ahora para algunos atajos personales:

source: ;;; Compare windows (global-set-key "\C-cw" 'compare-windows)
es: ;;; Compara ventanas (global-set-key "\C-cw" 'compare-windows)

source: @code{compare-windows} is a nifty command that compares the text in your current window with text in the next window. It makes the comparison by starting at point in each window, moving over text in each window as far as they match. I use this command all the time.
es: @code{compare-windows} es un comando excelente que compara el texto en tu ventana actual con texto de la siguiente ventana. Eso hace la comparaci@'on empezando al punto en cada ventana, moviendo a trav@'es del texto en cada ventana tan lejos como ellos asocian. Yo uso este comando todo el tiempo.

source: This also shows how to set a key globally, for all modes.
es: Esto tambi@'en muestra como configurar una tecla globalmente, para todo los modos

source: Setting a key globally
es: Configurando una tecla globalmente

source: Global set key
es: Asignar tecla global

source: Key setting globally
es: Asignando tecla globalmente

source: The command is @code{global-set-key}. It is followed by the keybinding. In a @file{.emacs} file, the keybinding is written as shown: @code{\C-c} stands for `control-c', which means `press the control key and the @key{c} key at the same time'. The @code{w} means `press the @key{w} key'. The keybinding is surrounded by double quotation marks. In documentation, you would write this as @w{@kbd{C-c w}}. (If you were binding a @key{META} key, such as @kbd{M-c}, rather than a @key{CTRL} key, you would write @w{@code{\M-c}} in your @file{.emacs} file. @xref{Init Rebinding, , Rebinding Keys in Your Init File, emacs, The GNU Emacs Manual}, for details.)
es: El comando es @code{global-set-key}. Es seguido por el atajo. En un fichero @file{.emacs}, el atajo es escrito como se ve: @code{\C-c} que se asocia a `control-c', que significa `presionar la tecla de control y la tecla @key{c} al mismo tiempo'. La @code{w} significa `presionar la tecla @key{w}'. El atajo es rodeado por dobles comillas. En la documentaci@'on, se escribir@'{@dotless{i}}a esto como @w{@kbd{C-c w}}. (Si estuviera asociando una tecla @key{META}, tal como @kbd{M-c}, en vez de una tecla de @key{CTRL}, se escribir@'{@dotless{i}}a @w{@code{\M-c}} en su fichero @file{.emacs}. @xref{Reasociando Init, , Reasociando Teclas en Su Fichero Init, emacs, El Manual de GNU Emacs}, para m@'as detalles.)

source: The command invoked by the keys is @code{compare-windows}. Note that @code{compare-windows} is preceded by a single quote; otherwise, Emacs would first try to evaluate the symbol to determine its value.
es: El comando invocado por las teclas es @code{compare-windows}. Note que @code{compare-windows} es precedido por una comilla simple; de otro modo, Emacs primero intentar@'{@dotless{i}}a evaluar el s@'{@dotless{i}}mbolo para determinar su valor.

source: These three things, the double quotation marks, the backslash before the @samp{C}, and the single quote mark are necessary parts of keybinding that I tend to forget. Fortunately, I have come to remember that I should look at my existing @file{.emacs} file, and adapt what is there.
es: Estas tres cosas, las marcas de dobles comillas, la barra invertida antes de la @samp{C}, y la marca de comilla simple son partes necesarias de atajos de teclado que tiendo a olvidar. Afortunadamente, he llegado a recordar que mirar@'{@dotless{i}}a mi fichero @file{.emacs} existente, y lo adaptar@'{@dotless{i}}a a lo que hay.

source: As for the keybinding itself: @kbd{C-c w}. This combines the prefix key, @kbd{C-c}, with a single character, in this case, @kbd{w}. This set of keys, @kbd{C-c} followed by a single character, is strictly reserved for individuals' own use. (I call these `own' keys, since these are for my own use.) You should always be able to create such a keybinding for your own use without stomping on someone else's keybinding. If you ever write an extension to Emacs, please avoid taking any of these keys for public use. Create a key like @kbd{C-c C-w} instead. Otherwise, we will run out of `own' keys.
es: Como para el atajo en s@'{@dotless{i}}: @kbd{C-c w}, combina la tecla prefija, @kbd{C-c}, con un caracter simple, en este caso, @kbd{w}. Este conjunto de teclas, @kbd{C-c} seguido por un caracter simple, es estrictamente reservado para un uso propio individual. (Esto se llama teclas `propias', puesto que estas son para su propio uso). Siempre ser@'{@dotless{i}}a capaz de crear tal atajo para el uso propio sin pisar fuerte en alg@'un atajo m@'as. Si siempre se escribe una extensi@'on a Emacs, por favor, evite tomar cualquiera de estas teclas para uso p@'ublico. Se cree que una tecla como @kbd{C-c C-w} en vez de eso. De otra manera, ejecutar@'a sin sus `propias' teclas.

source: Here is another keybinding, with a comment:
es: Aqu@'{@dotless{i}} hay otro atajo, con un comentario:

source: ;;; Keybinding for `occur' ; I use occur a lot, so let's bind it to a key: (global-set-key "\C-co" 'occur)
es: ;;; Atajo para `occur' ; Yo uso mucho occur, as@'{@dotless{i}} permite asignarlo a una tecla: (global-set-key "\C-co" 'occur)

source: The @code{occur} command shows all the lines in the current buffer that contain a match for a regular expression. Matching lines are shown in a buffer called @file{*Occur*}. That buffer serves as a menu to jump to occurrences.
es: El comando @code{occur} muestra todas las l@'{@dotless{i}}neas en el buffer actual que contiene un emparejamiento para una expresi@'on regular. Asociar las l@'{@dotless{i}}neas que se muestran en un b@'uffer llamado @file{*Occur*}. Este buffer sirve como un menu para saltar a ocurrencias.

source: Unbinding key
es: Disociando la tecla

source: Key unbinding
es: Desasociar Tecla a Comando

source: Here is how to unbind a key, so it does not work:
es: Aqu@'{@dotless{i}} se muestra como desasignar una tecla, as@'{@dotless{i}} no funciona:

source: ;;; Unbind `C-x f' (global-unset-key "\C-xf")
es: ;;; Desasociar `C-x f' (global-unset-key "\C-xf")

source: There is a reason for this unbinding: I found I inadvertently typed @w{@kbd{C-x f}} when I meant to type @kbd{C-x C-f}. Rather than find a file, as I intended, I accidentally set the width for filled text, almost always to a width I did not want. Since I hardly ever reset my default width, I simply unbound the key.
es: Hay una raz@'on para esta no asociaci@'on: Yo encontr@'e inadvertidamente escrito @w{@kbd{C-x f}} cuando signific@'o escribir @kbd{C-x C-f}. En vez de encontrar un fichero, como se pretende, accidentalmente asigna el ancho para el fichero lleno, casi siempre a un tama@~no que no quer@'{@dotless{i}}a. Puesto que duramente se resete@'o mi ancho por defecto, yo simplemente disoci@'e la tecla.

source: list-buffers, @r{rebound}
es: list-buffers, @r{reasociar}

source: buffer-menu, @r{bound to key}
es: buffer-menu, @r{asociado a tecla}

source: The following rebinds an existing key:
es: Lo siguiente reasocia una tecla existente:

source: ;;; Rebind `C-x C-b' for `buffer-menu' (global-set-key "\C-x\C-b" 'buffer-menu)
es: ;;; Reasocia `C-x C-b' al `buffer-menu' (global-set-key "\C-x\C-b" 'buffer-menu)

source: By default, @kbd{C-x C-b} runs the @code{list-buffers} command. This command lists your buffers in @emph{another} window. Since I almost always want to do something in that window, I prefer the @code{buffer-menu} command, which not only lists the buffers, but moves point into that window.
es: Por defecto, @kbd{C-x C-b} ejecute el comando @code{list-buffers}. Este comando lista sus buffers en @emph{otra} ventana. Desde que casi siempre se quiere hacer alguna cosa en esta ventana, se prefiere el comando @code{buffer-menu}, que no solo lista los buffers, pero mueve el punto dentro de esta ventana.

source: Rebinding keys
es: Reasociando teclas

source: Emacs uses @dfn{keymaps} to record which keys call which commands. When you use @code{global-set-key} to set the keybinding for a single command in all parts of Emacs, you are specifying the keybinding in @code{current-global-map}.
es: Emacs usa @dfn{keymaps} para grabar qu@'e teclas llaman a qu@'e comandos. Cuando se use @code{global-set-key} para asignar los atajos de teclados a un simple comando en todo @code{current-global-map}.

source: Specific modes, such as C mode or Text mode, have their own keymaps; the mode-specific keymaps override the global map that is shared by all buffers.
es: Modos espec@'{@dotless{i}}ficos, tales como modo C o modo Texto, tiene sus propios mapas de teclado; mapas de teclado de modo espec@'{@dotless{i}}fico sobreescribe el mapa global que es compartido por todos los buffers.

source: The @code{global-set-key} function binds, or rebinds, the global keymap. For example, the following binds the key @kbd{C-x C-b} to the function @code{buffer-menu}:
es: La funci@'on @code{global-set-key} asocia, o reasocia, el mapa de teclado global. Por ejemplo, las siguientes asociaciones la tecla @kbd{C-x C-b} a la funci@'on @code{buffer-menu}:

source: Mode-specific keymaps are bound using the @code{define-key} function, which takes a specific keymap as an argument, as well as the key and the command. For example, my @file{.emacs} file contains the following expression to bind the @code{texinfo-insert-@@group} command to @kbd{C-c C-c g}:
es: Mapas de teclado espec@'{@dotless{i}}fico de modo son asociados usando la funci@'on @code{define-key}, que toma un mapa de teclado espec@'{@dotless{i}}fico como un argumento, tan bien como la tecla y el comando. Por ejemplo, mi fichero @file{.emacs} contiene la siguiente expresi@'on asociada al comando @code{texinfo-insert-@@group} comando a @kbd{C-c C-c g}:

source: The @code{texinfo-insert-@@group} function itself is a little extension to Texinfo mode that inserts @samp{@@group} into a Texinfo file. I use this command all the time and prefer to type the three strokes @kbd{C-c C-c g} rather than the six strokes @kbd{@@ g r o u p}. (@samp{@@group} and its matching @samp{@@end group} are commands that keep all enclosed text together on one page; many multi-line examples in this book are surrounded by @samp{@@group @dots{} @@end group}.)
es: La funci@'on @code{texinfo-insert-@@group} en s@'{@dotless{i}} es una peque@~na extensi@'on del modo Texinfo que inserta @samp{@@group} dentro de un fichero Texinfo. Se usa este comando todo el tiempo y se prefieren escribir los tres atajos @kbd{C-c C-c g} en vez de los seis atajos @kbd{@@ g r o u p}. (@samp{@@group} y su asociaci@'on @samp{@@end group} son comandos que guarda todo el texto cerrado junto a una p@'agina; muchos ejemplos multi-l@'{@dotless{i}}nea en este libro est@'an rodeados por @samp{@@group @dots{} @@end group}.)

source: Here is the @code{texinfo-insert-@@group} function definition:
es: Aqu@'{@dotless{i}} est@'a la definici@'on de funci@'on @code{texinfo-insert-@@group}:

source: (defun texinfo-insert-@@group () "Insert the string @@group in a Texinfo buffer." (interactive) (beginning-of-line) (insert "@@group\n"))
es: (defun texinfo-insert-@@group () "Inserta la cadena @@group en un b@'uffer Texinfo." (interactive) (beginning-of-line) (insert "@@group\n"))

source: (Of course, I could have used Abbrev mode to save typing, rather than write a function to insert a word; but I prefer key strokes consistent with other Texinfo mode key bindings.)
es: (De acuerdo, podr@'{@dotless{i}}a haber usado el modo Abbrev para dejar de escribir, en vez de escribir una funci@'on para insertar una palabra; pero prefiero atajos de teclado consitentes con otro modo Texinfo para atajos de teclado.)

source: You will see numerous @code{define-key} expressions in @file{loaddefs.el} as well as in the various mode libraries, such as @file{cc-mode.el} and @file{lisp-mode.el}.
es: Ver@'a numerosas expresiones @code{define-key} en @file{loaddefs.el} tan bien como en varios modos de librer@'{@dotless{i}}as, tal como @file{cc-mode.el} y @file{lisp-mode.el}.

source: @xref{Key Bindings, , Customizing Key Bindings, emacs, The GNU Emacs Manual}, and @ref{Keymaps, , Keymaps, elisp, The GNU Emacs Lisp Reference Manual}, for more information about keymaps.
es: @xref{Atajos de Teclado, , Personalizando Atajos de Teclado, emacs, El Manual GNU Emacs}, y @ref{Mapas de Teclado, , Mapas de Teclado, elisp, El Manual de Referencia GNU Emacs Lisp}, para m@'as informaci@'on acerca de mapas de teclado.

source: Loading files
es: Cargando ficheros

source: Many people in the GNU Emacs community have written extensions to Emacs. As time goes by, these extensions are often included in new releases. For example, the Calendar and Diary packages are now part of the standard GNU Emacs, as is Calc.
es: Muchas personas en la comunidad de GNU Emacs han escrito extensiones a Emacs. Hace tiempo, que estas extensiones son con frecuencia incluidas en las nuevas entregas @emph{releases}. Por ejemplo, los paquetes Calendario y Diario son ahora parte del est@'andar GNU Emacs, como es Calc.

source: You can use a @code{load} command to evaluate a complete file and thereby install all the functions and variables in the file into Emacs. For example:
es: Se puede usar un comando @code{load} para evaluar un fichero completo que significa instalar todas las funciones y variables en el fichero Emacs. Por ejemplo:

source: This evaluates, i.e., loads, the @file{slowsplit.el} file or if it exists, the faster, byte compiled @file{slowsplit.elc} file from the @file{emacs} sub-directory of your home directory. The file contains the function @code{split-window-quietly}, which John Robinson wrote in 1989.
es: Esto eval@'ua, por ej.@: carga, el fichero @file{slowsplit.el} o si eso existe, lo m@'as r@'apido, el fichero compilado @file{slowsplit.elc} desde el subdirectorio @file{emacs} del directorio home. El fichero contiene la funci@'on @code{split-window-quietly}, que John Robinson escribi@'o en 1989.

source: The @code{split-window-quietly} function splits a window with the minimum of redisplay. I installed it in 1989 because it worked well with the slow 1200 baud terminals I was then using. Nowadays, I only occasionally come across such a slow connection, but I continue to use the function because I like the way it leaves the bottom half of a buffer in the lower of the new windows and the top half in the upper window.
es: La funci@'on @code{split-window-quietly} divide una ventana con el m@'{@dotless{i}}nimo de redisplay. Yo lo instal@'e en 1989 porque trabaj@'o bien con los terminales de 1200 baudios que entonces estaba usando. Ahora, ocasionalmente vengo a trav@'es de una conexi@'on lenta, pero contin@'ua usando la funci@'on porque me gusta el camino que deja arriba del b@'uffer en el bajo de las nuevas ventanas y arriba en la ventana superior.

source: To replace the key binding for the default @code{split-window-vertically}, you must also unset that key and bind the keys to @code{split-window-quietly}, like this:
es: Para reemplazar el atajo de teclado por defecto @code{split-window-vertically}, se debe tambi@'en desasignar esta tecla y asociar las teclas a @code{split-window-quietly}, como este:

source: If you load many extensions, as I do, then instead of specifying the exact location of the extension file, as shown above, you can specify that directory as part of Emacs's @code{load-path}. Then, when Emacs loads a file, it will search that directory as well as its default list of directories. (The default list is specified in @file{paths.h} when Emacs is built.)
es: Si se cargan muchas extensiones, como yo hago, entonces en vez de especificar la posici@'on exacta del fichero, como se muestra arriba, se puede especificar que directorio como parte del @code{load-path} de Emacs. Entonces, cuando Emacs carga un fichero, buscar@'a que directorio tan bien como su lista por defecto de directorios. (La lista por defecto es especificada en @file{paths.h} cuando Emacs se construye.)

source: The following command adds your @file{~/emacs} directory to the existing load path:
es: El comando siguiente a@~nade tu directorio @file{~/emacs} a la ruta existente:

source: ;;; Emacs Load Path (setq load-path (cons "~/emacs" load-path))
es: ;;; Ruta Emacs (setq load-path (cons "~/emacs" load-path))

source: Incidentally, @code{load-library} is an interactive interface to the @code{load} function. The complete function looks like this:
es: Incidentalmente, @code{load-library} es un interfaz interactivo a la funci@'on @code{load}. La funci@'on se parece a esto:

source: (defun load-library (library) "Load the library named LIBRARY. This is an interface to the function `load'." (interactive (list (completing-read "Load library: " (apply-partially 'locate-file-completion-table load-path (get-load-suffixes))))) (load library))
es: (defun load-library (library) "Carga la librer@'{@dotless{i}}a llamada LIBRARY. Esto es una interfaz a la funci@'on `load'." (interactive (list (completing-read "Carga la librer@'{@dotless{i}}a: " (apply-partially 'locate-file-completion-table load-path (get-load-suffixes))))) (load library))

source: The name of the function, @code{load-library}, comes from the use of `library' as a conventional synonym for `file'. The source for the @code{load-library} command is in the @file{files.el} library.
es: El nombre de la funci@'on, @code{load-libray}, viene desde el uso de `library' como un sin@'onimo para `file'. La fuente para el comando @code{load-library} est@'a en la librer@'{@dotless{i}}a @file{files.el}.

source: Another interactive command that does a slightly different job is @code{load-file}. @xref{Lisp Libraries, , Libraries of Lisp Code for Emacs, emacs, The GNU Emacs Manual}, for information on the distinction between @code{load-library} and this command.
es: Otro comando interactivo que hace un trabajo ligeramente diferente es @code{load-file}. @xref{Librer@'{@dotless{i}}as Lisp, , Librer@'{@dotless{i}}as de C@'odigo Lisp para Emacs, emacs, El Manual GNU Emacs}, para informaci@'on en la distinci@'on entre @code{load-library} y este comando.

source: Instead of installing a function by loading the file that contains it, or by evaluating the function definition, you can make the function available but not actually install it until it is first called. This is called @dfn{autoloading}.
es: En vez de instalar una funci@'on cargando el fichero que lo contiene, o evaluando la definici@'on de funci@'on, se puede hacer la funci@'on disponible pero actualmente no se instala hasta la primera vez llamada. Este proceso se llama @dfn{autocarga} (@emph{autoloading}).
