Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: As with other function definitions, you can use a template to see an outline of the function:
es: Como con otras definiciones de funci@'on, se puede usar una plantilla para visi@'on de la funci@'on:

source: interactive, @r{example use of}
es: interactive, @r{ejemplo de uso}

source: In @code{insert-buffer}, the argument to the @code{interactive} declaration has two parts, an asterisk, @samp{*}, and @samp{bInsert buffer:@: }.
es: En @code{insert-buffer}, el argumetno para la declaraci@'on @code{interactive} tiene dos partes, un asterisco, @samp{*}, y @samp{bInserta un buffer:@: }.

source: A Read-only Buffer
es: Un b@'uffer de solo lectura

source: Asterisk for read-only buffer
es: Asterisco para b@'uffer de solo lectura

source: * @r{for read-only buffer}
es: * @r{para buffer solo lectura}

source: The asterisk is for the situation when the current buffer is a read-only buffer---a buffer that cannot be modified. If @code{insert-buffer} is called when the current buffer is read-only, a message to this effect is printed in the echo area and the terminal may beep or blink at you; you will not be permitted to insert anything into current buffer. The asterisk does not need to be followed by a newline to separate it from the next argument.
es: El asterisco se utliza en la situaci@'on cuando el b@'uffer actual es un b@'uffer de solo lectura --- un b@'uffer que no puede ser modificado. Si @code{insert-buffer} es llamado cuando el b@'uffer actual es de solo lectura, un mensaje a este efecto est@'a impreso en el @'area echo y el terminal puede avisar; no se permite insertar cualquier cosa dentro del b@'uffer. El asterisco no necesita ser seguido por una nueva l@'{@dotless{i}}nea para separarse desde el siguiente argumento.

source: @samp{b} in an Interactive Expression
es: @samp{b} en una expresi@'on interactiva

source: The next argument in the interactive expression starts with a lower case @samp{b}. (This is different from the code for @code{append-to-buffer}, which uses an upper-case @samp{B}. @xref{append-to-buffer, , The Definition of @code{append-to-buffer}}.) The lower-case @samp{b} tells the Lisp interpreter that the argument for @code{insert-buffer} should be an existing buffer or else its name. (The upper-case @samp{B} option provides for the possibility that the buffer does not exist.) Emacs will prompt you for the name of the buffer, offering you a default buffer, with name completion enabled. If the buffer does not exist, you receive a message that says ``No match''; your terminal may beep at you as well.
es: El siguiente argumento en la expresi@'on interactiva empieza con una tecla min@'uscula @samp{b}. (Esto es diferente desde el c@'odigo para @code{append-to-buffer}, que usa una may@'uscula @samp{B}. @xref{append-to-buffer, , La Definici@'on de @code{append-to-buffer}}.) La tecla min@'uscula cuenta al int@'erprete Lisp que el argumento para @code{insert-buffer} ser@'{@dotless{i}}a un buffer existente o sino su nombre. (La may@'uscula @samp{B} provee para la posibilidad que el b@'uffer no existe.) Emacs te mostrar@'a en pantalla el nombre del b@'uffer, ofreciendo un b@'uffer por defecto, con la compleci@'on de nombre habilitado. Si el b@'uffer no existe, se recibe un mensaje que dice ``No concuerda''; tu terminal te avisa tambi@'en.

source: The new and simplified code generates a list for @code{interactive}. It uses the @code{barf-if-buffer-read-only} and @code{read-buffer} functions with which we are already familiar and the @code{progn} special form with which we are not. (It will be described later.)
es: El nuevo y simplificado c@'odigo genera una lista @code{interactive}. Eso usa las funciones @code{barf-if-buffer-read-only} y @code{read-buffer} con las que estamos ya familiarizados y la forma especial @code{progn} con los que no. (Eso ser@'a descrito despu@'es).

source: The Body of the @code{insert-buffer} Function
es: El cuerpo de la funci@'on @code{insert-buffer}

source: The body of the @code{insert-buffer} function has two major parts: an @code{or} expression and a @code{let} expression. The purpose of the @code{or} expression is to ensure that the argument @code{buffer} is bound to a buffer and not just the name of a buffer. The body of the @code{let} expression contains the code which copies the other buffer into the current buffer.
es: El cuerpo de la funci@'on @code{insert-buffer} tiene dos partes principales: una expresi@'on @code{or} y una expresi@'on @code{let}. El prop@'osito de la expresi@'on @code{or} es asegurar que el argumento @code{buffer} es emparejado a un b@'uffer y no solo el nombre de un b@'uffer. El cuerpo de la expresi@'on @code{let} contiene el c@'odigo que copia los otros b@'uffers dentro del b@'uffer.

source: In outline, the two expressions fit into the @code{insert-buffer} function like this:
es: En el "outline" (esquema), las dos expresiones se ajustan dentro de la funci@'on @code{insert-buffer} como esto:

source: (defun insert-buffer (buffer) "@var{documentation}@dots{}" (interactive "*bInsert buffer:@: ") (or @dots{} @dots{}
es: (defun insert-buffer (buffer) "@var{documentation}@dots{}" (interactive "*bInsertar buffer:@: ") (or @dots{} @dots{}

source: To understand how the @code{or} expression ensures that the argument @code{buffer} is bound to a buffer and not to the name of a buffer, it is first necessary to understand the @code{or} function.
es: Para comprender como la expresi@'on @code{or} asegura que el argumento @code{buffer} es emparejado a un buffer y no al nombre de un b@'uffer, es primero necesario comprender la funci@'on @code{or}.

source: Before doing this, let me rewrite this part of the function using @code{if} so that you can see what is done in a manner that will be familiar.
es: Antes de hacer esto, perm@'{@dotless{i}}teme reescribir esta parte de la funci@'on usando @code{if} as@'{@dotless{i}} puedes ver que es hecho en una manera que ser@'a familiar.

source: @code{insert-buffer} With an @code{if} Instead of an @code{or}
es: @code{insert-buffer} con un @code{if} en vez de un @code{or}

source: The job to be done is to make sure the value of @code{buffer} is a buffer itself and not the name of a buffer. If the value is the name, then the buffer itself must be got.
es: El trabajo que debe ser hecho y asegura el valor de @code{buffer} es un b@'uffer en s@'{@dotless{i}} mismo y no el nombre de un b@'uffer. Si el valor es el nombre, entonces el b@'uffer en s@'{@dotless{i}} debe ser obtenido.

source: You can imagine yourself at a conference where an usher is wandering around holding a list with your name on it and looking for you: the usher is ``bound'' to your name, not to you; but when the usher finds you and takes your arm, the usher becomes ``bound'' to you.
es: Te puedes imaginar a t@'{@dotless{i}} mismo en una conferencia donde un acomodador est@'a observando una lista con tu nombre dentro y mir@'andote: el acomodador sabe ``asociar'' tu nombre, pero no a t@'{@dotless{i}}; pero cuando el acomodador te encuentra y te toma el brazo, el acomodador llega a ``asociarte'' a t@'{@dotless{i}}.

source: In Lisp, you might describe this situation like this:
es: En Lisp, se podr@'{@dotless{i}}a describir esta situaci@'on as@'{@dotless{i}}:

source: We want to do the same thing with a buffer---if we do not have the buffer itself, we want to get it.
es: Se quiere hacer la misma cosa con un b@'uffer --- si no tenemos el b@'uffer en s@'{@dotless{i}}, queremos tenerlo.

source: Using a predicate called @code{bufferp} that tells us whether we have a buffer (rather than its name), we can write the code like this:
es: Usando un predicado llamado @code{bufferp} que nos cuenta si tenemos un b@'uffer (en vez de su nombre), se puede escribir el c@'odigo como este:

source: Here, the true-or-false-test of the @code{if} expression is @w{@code{(not (bufferp buffer))}}; and the then-part is the expression @w{@code{(setq buffer (get-buffer buffer))}}.
es: Aqu@'{@dotless{i}}, el true-or-false-test de la expresi@'on @code{if} es @w{@code{(not (bufferp buffer))}}; y la then-part es la expresi@'on @w{@code{(setq buffer (get-buffer buffer))}}.

source: In the test, the function @code{bufferp} returns true if its argument is a buffer---but false if its argument is the name of the buffer. (The last character of the function name @code{bufferp} is the character @samp{p}; as we saw earlier, such use of @samp{p} is a convention that indicates that the function is a predicate, which is a term that means that the function will determine whether some property is true or false. @xref{Wrong Type of Argument, , Using the Wrong Type Object as an Argument}.)
es: En el test, la funci@'on @code{bufferp} devuelve cierto si su argumento es un b@'uffer --- pero falso si su argumento es el nombre del b@'uffer. (El @'ultimo car@'acter del nombre de la funci@'on @code{bufferp} es el car@'acter @samp{p}; como se vi@'o antes, tal uso de @samp{p} es una convenci@'on que indica que la funci@'on es un predicado, que es un t@'ermino que significa que la funci@'on determinar@'a si alguna propiedad es verdadera o falsa. @xref{Tipo incorrecto de argumento, , Usando el objeto de tipo incorrecto como un argumento}.)

source: The function @code{not} precedes the expression @code{(bufferp buffer)}, so the true-or-false-test looks like this:
es: La funci@'on @code{not} precede la expresi@'on @code{(bufferp buffer)}, as@'{@dotless{i}} el true-or-false-test se ve como esto:

source: @code{not} is a function that returns true if its argument is false and false if its argument is true. So if @code{(bufferp buffer)} returns true, the @code{not} expression returns false and vice-verse: what is ``not true'' is false and what is ``not false'' is true.
es: @code{no} es una funci@'on que devuelve cierto si su argumento es falso y falso si su argumento es verdadero. As@'{@dotless{i}} si @code{(bufferp buffer)} devuelve cierto, la expresi@'on @code{no} devuelve falso y vice-versa: que es ``no cierto'' es falso que es ``no falso'' es verdadero.

source: Using this test, the @code{if} expression works as follows: when the value of the variable @code{buffer} is actually a buffer rather than its name, the true-or-false-test returns false and the @code{if} expression does not evaluate the then-part. This is fine, since we do not need to do anything to the variable @code{buffer} if it really is a buffer.
es: Usando este test, la expresi@'on @code{if} trabaja como sigue: cuando el valor de la variable @code{buffer} est@'a actualmente en un b@'uffer en vez de su nombre, el test true-or-false-test devuelve false y la expresi@'on @code{if} no eval@'ua la parte then-part. Esto est@'a bien, desde que no necesita para hacer cualquier cosa para la variable @code{buffer} si es realmente un b@'uffer.

source: On the other hand, when the value of @code{buffer} is not a buffer itself, but the name of a buffer, the true-or-false-test returns true and the then-part of the expression is evaluated. In this case, the then-part is @code{(setq buffer (get-buffer buffer))}. This expression uses the @code{get-buffer} function to return an actual buffer itself, given its name. The @code{setq} then sets the variable @code{buffer} to the value of the buffer itself, replacing its previous value (which was the name of the buffer).
es: Por otro lado, cuando el valor de @code{buffer} no es un buffer en s@'{@dotless{i}}, pero el nombre de un buffer, el true-or-false-test devuelve cierto y la then-part de la expresi@'on es evaluada. En este caso, la then-part es @code{(setq buffer (get-buffer buffer))}. Esta expresi@'on usa la funci@'on @code{get-buffer} para devolver un buffer actual en s@'{@dotless{i}}, dado su nombre. El @code{setq} entonces asigna la variable @code{buffer} al valor del buffer en s@'{@dotless{i}}, reemplazando su valor previo (que era el nombre del buffer).

source: The @code{or} in the Body
es: El @code{or} en el cuerpo

source: The purpose of the @code{or} expression in the @code{insert-buffer} function is to ensure that the argument @code{buffer} is bound to a buffer and not just to the name of a buffer. The previous section shows how the job could have been done using an @code{if} expression. However, the @code{insert-buffer} function actually uses @code{or}. To understand this, it is necessary to understand how @code{or} works.
es: El prop@'osito de la expresi@'on @code{or} en la funci@'on @code{insert-buffer} es asegurar que el argumento @code{buffer} est@'a asociado a un b@'uffer y no solo al nombre de un b@'uffer. La secci@'on previa muestra como el trabajo podr@'{@dotless{i}}a haber sido hecho usando una expresi@'on @code{if}. Sin embargo, la funci@'on @code{insert-buffer} actualmente usa @code{or}. Para comprender esto, es necesario comprender como @code{or} trabaja.

source: An @code{or} function can have any number of arguments. It evaluates each argument in turn and returns the value of the first of its arguments that is not @code{nil}. Also, and this is a crucial feature of @code{or}, it does not evaluate any subsequent arguments after returning the first non-@code{nil} value.
es: Una funci@'on @code{or} puede tener cualquier n@'umero de argumentos. Eso eval@'ua cada argumento en turno y devuelve el valor del primero de sus argumentos que no es @code{nil}. Tambi@'en, y esto es una funcionalidad crucial de @code{or}, eso no eval@'ua cualquier argumentos subsiguientes despu@'es devolviendo el primer valor no-@code{nil}.

source: The @code{or} expression looks like this:
es: La expresi@'on @code{or} se ve como esto:

source: The first argument to @code{or} is the expression @code{(bufferp buffer)}. This expression returns true (a non-@code{nil} value) if the buffer is actually a buffer, and not just the name of a buffer. In the @code{or} expression, if this is the case, the @code{or} expression returns this true value and does not evaluate the next expression---and this is fine with us, since we do not want to do anything to the value of @code{buffer} if it really is a buffer.
es: El primer argumento a @code{or} es la expresi@'on @code{(bufferp buffer)}. Esta expresi@'on devuelve cierto (un valor no-@code{nil}) si el b@'uffer es actualmente un b@'uffer, y no solo el nombre de un b@'uffer. En la expresi@'on @code{or}, si este es el caso, la expresi@'on @code{or} devuelve esto el valor cierto y no eval@'ua la siguiente expresi@'on --- y esto es bueno para nosotros, desde que nosotros no queremos hacer cualquier cosa al valor de @code{buffer} si eso es realmente un b@'uffer.

source: On the other hand, if the value of @code{(bufferp buffer)} is @code{nil}, which it will be if the value of @code{buffer} is the name of a buffer, the Lisp interpreter evaluates the next element of the @code{or} expression. This is the expression @code{(setq buffer (get-buffer buffer))}. This expression returns a non-@code{nil} value, which is the value to which it sets the variable @code{buffer}---and this value is a buffer itself, not the name of a buffer.
es: Por otro lado, si el valor de @code{(bufferp buffer)} es @code{nil}, que ser@'a si el valor de @code{buffer} es el nombre de un buffer, el int@'erprete Lisp eval@'ua el siguiente elemento de la expresi@'on. Esta es la expresi@'on @code{(setq buffer (get-buffer buffer))}. Esta expresi@'on devuelve un valor no-@code{nil}, que es el valor para el que asigna la variable @code{buffer} --- y este valor es un b@'uffer en s@'{@dotless{i}}, no el nombre de un b@'uffer.

source: The result of all this is that the symbol @code{buffer} is always bound to a buffer itself rather than to the name of a buffer. All this is necessary because the @code{set-buffer} function in a following line only works with a buffer itself, not with the name to a buffer.
es: El resultado de todo esto es que el s@'{@dotless{i}}mbolo @code{buffer} es siempre asociado a un b@'uffer en s@'{@dotless{i}} en vez del nombre de un b@'uffer. Toda es necesario porque la funci@'on @code{set-buffer} en una l@'{@dotless{i}}nea siguiente trabaja con un buffer en s@'{@dotless{i}}, no con el nombre de un b@'uffer.

source: Incidentally, using @code{or}, the situation with the usher would be written like this:
es: Incidentalmente, usando @code{or}, la situaci@'on con el acomodador se ver@'{@dotless{i}}a as@'{@dotless{i}}:

source: The @code{let} Expression in @code{insert-buffer}
es: La expresi@'on @code{let} en @code{insert-buffer}

source: After ensuring that the variable @code{buffer} refers to a buffer itself and not just to the name of a buffer, the @code{insert-buffer function} continues with a @code{let} expression. This specifies three local variables, @code{start}, @code{end}, and @code{newmark} and binds them to the initial value @code{nil}. These variables are used inside the remainder of the @code{let} and temporarily hide any other occurrence of variables of the same name in Emacs until the end of the @code{let}.
es: Despu@'es asegurando que la variable @code{buffer} se refiere a un buffer en s@'{@dotless{i}} y no solo al nombre de un buffer, la funci@'on @code{insert-buffer} contin@'ua con una expresi@'on @code{let}. Esto especifica tres variables locales, @code{start}, @code{end} y @code{newmark} y los asocia al valor inicial @code{nil}. Estas variables son usadas dentro del resto de @code{let} y temporalmente se oculta con cualquier otra ocurrencia de variables del mismo nombre en Emacs hasta el fin del @code{let}.

source: The body of the @code{let} contains two @code{save-excursion} expressions. First, we will look at the inner @code{save-excursion} expression in detail. The expression looks like this:
es: El cuerpo del @code{let} contiene dos expresiones @code{save-excursion}. Primero, miraremos la expresi@'on @code{save-excursion} en detalle. La expresi@'on se parece a esto:

source: The expression @code{(set-buffer buffer)} changes Emacs's attention from the current buffer to the one from which the text will copied. In that buffer, the variables @code{start} and @code{end} are set to the beginning and end of the buffer, using the commands @code{point-min} and @code{point-max}. Note that we have here an illustration of how @code{setq} is able to set two variables in the same expression. The first argument of @code{setq} is set to the value of its second, and its third argument is set to the value of its fourth.
es: La expresi@'on @code{(set-buffer buffer)} cambia la atenci@'on de Emacs desde el b@'uffer actual a uno desde el que el texto ser@'a copiado. En este b@'uffer las variables @code{start} y @code{end} se asignadan al principio y al fin del b@'uffer, usando los comandos @code{point-min} y @code{point-max}. Note que tenemos aqu@'{@dotless{i}} una ilustraci@'on de c@'omo @code{setq} es capaz de asignar dos variables en la misma expresi@'on. El primer argumento de @code{setq} es asignar al valor del segundo, y su tercer argumento est@'a asignado al valor del cuarto.

source: After the body of the inner @code{save-excursion} is evaluated, the @code{save-excursion} restores the original buffer, but @code{start} and @code{end} remain set to the values of the beginning and end of the buffer from which the text will be copied.
es: Despu@'es el cuerpo del @code{save-excursion} propio es evaluado, el @code{save-excursion} restaura el b@'uffer original, pero @code{start} y @code{end} permanece asignado a los valores del principio y fin del b@'uffer en el que el texto ser@'a copiado.

source: The outer @code{save-excursion} expression looks like this:
es: La expresi@'on por fuera @code{save-excursion} se ve como:

source: The @code{insert-buffer-substring} function copies the text @emph{into} the current buffer @emph{from} the region indicated by @code{start} and @code{end} in @code{buffer}. Since the whole of the second buffer lies between @code{start} and @code{end}, the whole of the second buffer is copied into the buffer you are editing. Next, the value of point, which will be at the end of the inserted text, is recorded in the variable @code{newmark}.
es: La funci@'on @code{insert-buffer-substring} copia el texto @emph{dento} del b@'uffer @emph{desde} la regi@'on indicada por @code{start} y @code{end} en el @code{b@'uffer}. Desde el total del segundo b@'uffer cae entre @code{start} y @code{end}, el todo del segundo b@'uffer es copiado dentro del b@'uffer que est@'as editando. Lo siguiente, el valor del punto, que ser@'a al fin del texto insertado, es grabado en la variable @code{newmark}.

source: After the body of the outer @code{save-excursion} is evaluated, point and mark are relocated to their original places.
es: Despu@'es el cuerpo de @code{save-excursion} es evaluado, punto y marca son recolocados a sus lugares originales.

source: However, it is convenient to locate a mark at the end of the newly inserted text and locate point at its beginning. The @code{newmark} variable records the end of the inserted text. In the last line of the @code{let} expression, the @code{(push-mark newmark)} expression function sets a mark to this location. (The previous location of the mark is still accessible; it is recorded on the mark ring and you can go back to it with @kbd{C-u C-@key{SPC}}.) Meanwhile, point is located at the beginning of the inserted text, which is where it was before you called the insert function, the position of which was saved by the first @code{save-excursion}.
es: Sin embargo, es conveniente localizar una marca al fin del texto nuevamente insertado y localizar el punto al principio. La variable @code{newmark} graba el fin del texto insertado. En la @'ultima l@'{@dotless{i}}nea de la expresi@'on @code{let}, la expresi@'on de la funci@'on @code{(push-mark newmark)} asigna una marca a esta posici@'on. (La posici@'on previa de la marca est@'a todav@'{@dotless{i}}a accesible; est@'a grabado en la marca del anillo y se puede regresar a eso con @kbd{C-u C-@key{SPC}}.) Mientras tanto, el punto est@'a localizado al principio del texto insertado, que est@'a donde estaba antes de ser llamado la funci@'on que inserta, la posici@'on de lo que estaba guardado por la primera @code{save-excursion}.

source: The whole @code{let} expression looks like this:
es: La expresi@'on @code{let} se parece a esto:

source: Like the @code{append-to-buffer} function, the @code{insert-buffer} function uses @code{let}, @code{save-excursion}, and @code{set-buffer}. In addition, the function illustrates one way to use @code{or}. All these functions are building blocks that we will find and use again and again.
es: Como la funci@'on @code{append-to-buffer}, la funci@'on @code{insert-buffer} usa @code{let}, @code{save-excursion} y @code{set-buffer}. Adem@'as, la funci@'on ilustra un camino para usar @code{o}. Toda estas funciones est@'an construyendo el bloque que se encontrar@'an y usar@'an una y otra vez.

source: New Body for @code{insert-buffer}
es: Nuevo cuerpo para @code{insert-buffer}

source: insert-buffer, new version body
es: insert-buffer, nueva versi@'on del cuerpo

source: new version body for insert-buffer
es: nueva versi@'on cuerpo para insert-buffer

source: The body in the GNU Emacs 22 version is more confusing than the original.
es: El cuerpo en la versi@'on de GNU Emacs 22 es m@'as confuso que en el original.

source: It consists of two expressions,
es: Consiste de dos expresiones

source: except, and this is what confuses novices, very important work is done inside the @code{push-mark} expression.
es: excepto, y esto es lo que los novicios confunden, un trabajo muy importante es hecho dentro de la expresi@'on @code{push-mark}.
