Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: This statement of the problem makes it elementary to write the function definition. Clearly, we will start the count at the beginning of the file, so the first command will be @code{(goto-char (point-min))}. Next, we start the @code{while} loop; and the true-or-false test of the loop can be a regular expression search for the next function definition---so long as the search succeeds, point is moved forward and then the body of the loop is evaluated. The body needs an expression that constructs the lengths' list. @code{cons}, the list construction command, can be used to create the list. That is almost all there is to it.
es: Esta frase del problema hace elemental escribir la definici@'on de funci@'on. Claramente, empezaremos el conteo al principio del fichero, as@'{@dotless{i}} el primer comando ser@'a @code{(goto-char (point-min))}. Lo siguiente, es empezar el bucle @code{while}; y este true-or-false del bucle puede ser una b@'usqueda de expresi@'on regular para la siguiente definici@'on de funci@'on --- as@'{@dotless{i}} en el momento que la b@'usqueda tiene @'exito, el punto se mueve hacia adelante y entonces el cuerpo del bucle es evaluado. El cuerpo necesita una expresi@'on que construye la lista de tama@~nos. @code{cons}, la lista de construcci@'on del comando, puede ser usado para crear la lista. Esto es casi todo lo que hay.

source: Here is what this fragment of code looks like:
es: Aqu@'{@dotless{i}} est@'a este fragmento de c@'odigo que se ve as@'{@dotless{i}}:

source: What we have left out is the mechanism for finding the file that contains the function definitions.
es: Dejamos fuera el mecanismo para encontrar el fichero que contiene las definiciones de funci@'on.

source: In previous examples, we either used this, the Info file, or we switched back and forth to some other buffer, such as the @file{*scratch*} buffer.
es: En ejemplos previos, nosotros hab@'{@dotless{i}}amos usado esto, el fichero Info, o cambiamos atr@'as y adelante a alg@'un otro b@'uffer, tal como el b@'uffer @file{*scratch*}.

source: Finding a file is a new process that we have not yet discussed.
es: Encontrar un fichero es un nuevo proceso que no tenemos todav@'{@dotless{i}}a discutido.

source: To find a file in Emacs, you use the @kbd{C-x C-f} (@code{find-file}) command. This command is almost, but not quite right for the lengths problem.
es: Para encontrar un fichero en Emacs, se usa el comando @kbd{C-x C-f} (@code{find-file}). Este comando es casi, pero no bastante correcto para el problema de tama@~nos.

source: Let's look at the source for @code{find-file}:
es: Permita mirar el fuente para @code{find-file}:

source: (defun find-file (filename) "Edit file FILENAME. Switch to a buffer visiting file FILENAME, creating one if none already exists." (interactive "FFind file: ") (switch-to-buffer (find-file-noselect filename)))
es: (defun find-file (filename) "Edita el fichero FILENAME. Cambia a un b@'uffer visitando el fichero FILENAME, creando uno si no existe ya." (interactive "FFind file: ") (switch-to-buffer (find-file-noselect filename)))

source: (The most recent version of the @code{find-file} function definition permits you to specify optional wildcards to visit multiple files; that makes the definition more complex and we will not discuss it here, since it is not relevant. You can see its source using either @kbd{M-.} (@code{find-tag}) or @kbd{C-h f} (@code{describe-function}).)
es: (La versi@'on m@'as reciente de la definici@'on de funci@'on @code{find-file} permite comodines especiales para visitar m@'ultiples ficheros; que hacen la definici@'on m@'as compleja y no se discutir@'a aqu@'{@dotless{i}}, ya que no es relevante. Se pueden ver sus fuentes usando @kbd{M-.} (@code{find-tag}) o @kbd{C-h f} (@code{describe-function}).)

source: The definition I am showing possesses short but complete documentation and an interactive specification that prompts you for a file name when you use the command interactively. The body of the definition contains two functions, @code{find-file-noselect} and @code{switch-to-buffer}.
es: La definici@'on que se est@'a mostrando posee una documentaci@'on corta, pero completa y una especificaci@'on interactiva que muestra un nombre de fichero cuando se usa el comando interactivamente. El cuerpo de la definici@'on contiene dos funciones, @code{find-file-noselect} y @code{switch-to-buffer}.

source: According to its documentation as shown by @kbd{C-h f} (the @code{describe-function} command), the @code{find-file-noselect} function reads the named file into a buffer and returns the buffer. (Its most recent version includes an optional wildcards argument, too, as well as another to read a file literally and an other you suppress warning messages. These optional arguments are irrelevant.)
es: De acuerdo a su documentaci@'on como muestra por @kbd{C-h f} (el comando @code{describe-function}), la funci@'on @code{find-file-noselect} lee el fichero nombrado dentro de un b@'uffer y devuelve el b@'uffer. (Su versi@'on m@'as reciente incluye un argumento comod@'{@dotless{i}}n, tambi@'en, as@'{@dotless{i}} como otro para leer un fichero literalmente y otro que suprime mensajes de aviso. Estos argumentos opcionales son irrelevantes.)

source: However, the @code{find-file-noselect} function does not select the buffer in which it puts the file. Emacs does not switch its attention (or yours if you are using @code{find-file-noselect}) to the selected buffer. That is what @code{switch-to-buffer} does: it switches the buffer to which Emacs attention is directed; and it switches the buffer displayed in the window to the new buffer. We have discussed buffer switching elsewhere. (@xref{Switching Buffers}.)
es: Sin embargo, la funci@'on @code{find-file-noselect} no selecciona el b@'uffer en el que se pone el fichero. Emacs no cambia su atenci@'on (o la tuya si est@'as usando @code{find-file-noselect}) al b@'uffer seleccionado. Esto es lo que @code{switch-to-buffer} hace: eso cambia el b@'uffer al que se dirige la atenci@'on de Emacs; y eso cambia el b@'uffer mostrado en la ventana al nuevo b@'uffer. Se ha discutido el b@'uffer cambiando a otro lugar. (@xref{Cambiando b@'uffers}.)

source: In this histogram project, we do not need to display each file on the screen as the program determines the length of each definition within it. Instead of employing @code{switch-to-buffer}, we can work with @code{set-buffer}, which redirects the attention of the computer program to a different buffer but does not redisplay it on the screen. So instead of calling on @code{find-file} to do the job, we must write our own expression.
es: En este proyecto de histograma, no se necesita mostrar cada fichero en la pantalla como el programa determina el tama@~no de cada definici@'on con eso. En vez de emplear @code{switch-to-buffer}, se puede trabajar con @code{set-buffer}, que redirige la atenci@'on del programa de ordenador para un b@'uffer diferente pero no lo muestra en pantalla. As@'{@dotless{i}} en vez llamar a @code{find-file} para hacer el trabajo, debe escribir nuestra expresi@'on.

source: The task is easy: use @code{find-file-noselect} and @code{set-buffer}.
es: La tarea es f@'acil: usar @code{find-file-noselect} y @code{set-buffer}.

source: @code{lengths-list-file} in Detail
es: @code{lengths-list-file} en detalle

source: The core of the @code{lengths-list-file} function is a @code{while} loop containing a function to move point forward `defun by defun' and a function to count the number of words and symbols in each defun. This core must be surrounded by functions that do various other tasks, including finding the file, and ensuring that point starts out at the beginning of the file. The function definition looks like this:
es: El n@'ucleo de la funci@'on @code{lengths-list-file} es un bucle @code{while} conteniendo una funci@'on para mover el punto hacia delante `funci@'on a funci@'on' y una funci@'on para contar el n@'umero de palabras y s@'{@dotless{i}}mbolos en cada funci@'on. Este n@'ucleo debe ser rodeado por funciones que hacen otras tareas varias, incluyendo encontrar el fichero, y asegurando que el punto empieza al principio del fichero. La definici@'on de la funci@'on se parece a:

source: (defun lengths-list-file (filename) "Return list of definitions' lengths within FILE. The returned list is a list of numbers. Each number is the number of words or symbols in one function definition."
es: (defun lengths-list-file (filename) "Devuelve la lista de tama@~nos de definiciones con FILE. La lista devuelta es una lista de n@'umeros. Cada n@'umero es el n@'umero de palabras o s@'{@dotless{i}}mbolos en una definici@'on."

source: (message "Working on `%s' ... " filename) (save-excursion (let ((buffer (find-file-noselect filename)) (lengths-list)) (set-buffer buffer) (setq buffer-read-only t) (widen) (goto-char (point-min)) (while (re-search-forward "^(defun" nil t) (setq lengths-list (cons (count-words-in-defun) lengths-list))) (kill-buffer buffer) lengths-list)))
es: (message "Trabajando en `%s' ... " filename) (save-excursion (let ((buffer (find-file-noselect filename)) (lengths-list)) (set-buffer buffer) (setq buffer-read-only t) (widen) (goto-char (point-min)) (while (re-search-forward "^(defun" nil t) (setq lengths-list (cons (count-words-in-defun) lengths-list))) (kill-buffer buffer) lengths-list)))

source: The function is passed one argument, the name of the file on which it will work. It has four lines of documentation, but no interactive specification. Since people worry that a computer is broken if they don't see anything going on, the first line of the body is a message.
es: La funci@'on pasa un argumento, el nombre del fichero en el que se trabajar@'a. Eso tiene cuatro l@'{@dotless{i}}neas de documentaci@'on, pero sin especificaci@'on interactiva. Para evitar la preocupaci@'on de si se ha estropeado el programa o no, la primera l@'{@dotless{i}}nea del cuerpo es un mensaje de aviso.

source: The next line contains a @code{save-excursion} that returns Emacs's attention to the current buffer when the function completes. This is useful in case you embed this function in another function that presumes point is restored to the original buffer.
es: La siguiente l@'{@dotless{i}}nea contiene un @code{save-excursion} que devuelve a Emacs la atenci@'on al actual b@'uffer cuando la funci@'on se completa. Esto es @'util en caso de embeber esta funci@'on en otra funci@'on que presume que el punto restaura el b@'uffer original.

source: In the varlist of the @code{let} expression, Emacs finds the file and binds the local variable @code{buffer} to the buffer containing the file. At the same time, Emacs creates @code{lengths-list} as a local variable.
es: En la varlist de la expresi@'on @code{let}, Emacs encuentra el fichero y ajusta la variable local @code{buffer} al b@'uffer conteniendo el fichero. Al mismo tiempo, Emacs crea @code{lengths-list} como una variable local.

source: Next, Emacs switches its attention to the buffer.
es: Lo siguiente, Emacs cambia su atenci@'on al b@'uffer.

source: In the following line, Emacs makes the buffer read-only. Ideally, this line is not necessary. None of the functions for counting words and symbols in a function definition should change the buffer. Besides, the buffer is not going to be saved, even if it were changed. This line is entirely the consequence of great, perhaps excessive, caution. The reason for the caution is that this function and those it calls work on the sources for Emacs and it is inconvenient if they are inadvertently modified. It goes without saying that I did not realize a need for this line until an experiment went awry and started to modify my Emacs source files @dots{}
es: En la siguiente l@'{@dotless{i}}nea, Emacs crea el b@'uffer de solo lectura. Idealmente, esta l@'{@dotless{i}}nea no es necesaria. Ninguna de las funciones para contar palabras y s@'{@dotless{i}}mbolos en una definici@'on de funci@'on cambiar@'{@dotless{i}}a el b@'uffer. Debajo, el b@'uffer no est@'a yendo para ser guardado, incluso si eso fuese cambiado. Esta l@'{@dotless{i}}nea es enteramente la consecuencia grata, quiz@'as excesiva precauci@'on. La raz@'on para la precauci@'on es que esta funci@'on y esta se llama a trabajar en las fuentes para Emacs y eso es un inconveniente si est@'an inadvertidamente modificadas. Eso va sin decir que no se realiz@'o una necesidad para esta l@'{@dotless{i}}nea hasta que un experimento fu@'e cambiado hacia un lado y empez@'o a modificar mis ficheros de fuentes Emacs @dots{}

source: Next comes a call to widen the buffer if it is narrowed. This function is usually not needed---Emacs creates a fresh buffer if none already exists; but if a buffer visiting the file already exists Emacs returns that one. In this case, the buffer may be narrowed and must be widened. If we wanted to be fully `user-friendly', we would arrange to save the restriction and the location of point, but we won't.
es: Lo siguiente llama a alargar el b@'uffer si eso est@'a encogido. Esta funci@'on es normalmente innecesaria --- Emacs crea un b@'uffer fresco si ninguno ya existe; pero si un b@'uffer est@'a visitando el fichero que ya existe que Emacs devuelve uno. En este caso, el b@'uffer puede ser encogido y debe ser amplio. Si se quiere ser completamente `amigo del usuario', se pondr@'{@dotless{i}}a en orden para guardar la restricci@'on y la localizaci@'on del punto, pero no.

source: The @code{(goto-char (point-min))} expression moves point to the beginning of the buffer.
es: La expresi@'on @code{(goto-char (point-min))} mueve el punto al principio del b@'uffer.

source: Then comes a @code{while} loop in which the `work' of the function is carried out. In the loop, Emacs determines the length of each definition and constructs a lengths' list containing the information.
es: Entonces llega un bucle @code{while} en el que se devuelve el `trabajo' de la funci@'on. En el bucle, Emacs determina el tama@~no de cada definici@'on y construye una lista de tama@~nos conteniendo la informaci@'on.

source: Emacs kills the buffer after working through it. This is to save space inside of Emacs. My version of GNU Emacs 19 contained over 300 source files of interest; GNU Emacs 22 contains over a thousand source files. Another function will apply @code{lengths-list-file} to each of the files.
es: Emacs corta el b@'uffer despu@'es de trabajar a trav@'es de eso. Esto es guardar espacio dentro de Emacs. Mi versi@'on de GNU Emacs 19 conten@'{@dotless{i}}a 300 ficheros fuente de inter@'es; GNU Emacs 22 contiene a trav@'es de un millar de ficheros fuente. Otra funci@'on aplicar@'a @code{lengths-list-file} a cada uno de los ficheros.

source: Finally, the last expression within the @code{let} expression is the @code{lengths-list} variable; its value is returned as the value of the whole function.
es: Finalmente, la @'ultima expresi@'on con la expresi@'on @code{let} es la variable @code{lengths-list}; su valor es devuelto como el valor de la funci@'on completa.

source: You can try this function by installing it in the usual fashion. Then place your cursor after the following expression and type @kbd{C-x C-e} (@code{eval-last-sexp}).
es: Se puede probar esta funci@'on instal@'andolo en el modo usual. Entonces posiciona tu cursor despu@'es de la siguiente expresi@'on y escribe @kbd{C-x C-e} (@code{eval-last-sexp}).

source: (You may need to change the pathname of the file; the one here is for GNU Emacs version 22.1.1. To change the expression, copy it to the @file{*scratch*} buffer and edit it.
es: (Se puede necesitar cambiar la ruta del fichero; el @'unico aqu@'{@dotless{i}} es para GNU Emacs versi@'on 22.1.1. Para cambiar la expresi@'on, c@'opialo al b@'uffer @file{*scratch*} y ed@'{@dotless{i}}talo.

source: (Also, to see the full length of the list, rather than a truncated version, you may have to evaluate the following:
es: (Tambi@'en, para ver el tama@~no completo de la lista, en vez de una versi@'on truncada se puede tener que evaluar lo siguiente:

source: (@xref{defcustom, , Specifying Variables using @code{defcustom}}. Then evaluate the @code{lengths-list-file} expression.)
es: (@xref{defcustom, , Especificando Variables usando @code{defcustom}}. Entonces eval@'ua la expresi@'on @code{lengths-list-file}.)

source: The lengths' list for @file{debug.el} takes less than a second to produce and looks like this in GNU Emacs 22:
es: La lista de tama@~nos para @file{debug.el} toma menos de un segundo para producirse esto en GNU Emacs 22:

source: (Using my old machine, the version 19 lengths' list for @file{debug.el} took seven seconds to produce and looked like this:
es: (Usando mi vieja m@'aquina, la versi@'on 19 lista tama@~nos para @file{debug.el} que en siete segundos para producen esto:

source: (The newer version of @file{debug.el} contains more defuns than the earlier one; and my new machine is much faster than the old one.)
es: (La versi@'on nueva de @file{debug.el} contiene m@'as defuns que la temprana; y mi nueva m@'aquina es m@'as r@'apida que la vieja.

source: Note that the length of the last definition in the file is first in the list.
es: N@'otese que el tama@~no de la @'ultima definici@'on en el fichero es el primero en la lista.

source: In the previous section, we created a function that returns a list of the lengths of each definition in a file. Now, we want to define a function to return a master list of the lengths of the definitions in a list of files.
es: En la secci@'on previa, se creaba una funci@'on que devuelve una lista de los tama@~nos de cada definici@'on en un fichero. Ahora, se quiere definir una funci@'on para devolver una lista maestra de los tama@~nos de las definiciones en una lista de ficheros.

source: Working on each of a list of files is a repetitious act, so we can use either a @code{while} loop or recursion.
es: Trabajar en cada elemento de una lista de ficheros es un acto repetitivo, as@'{@dotless{i}} se puede usar un bucle @code{while} o recursi@'on.

source: Determine the lengths of @code{defuns}
es: Determina las longitudes de @code{defuns}

source: The design using a @code{while} loop is routine. The argument passed the function is a list of files. As we saw earlier (@pxref{Loop Example}), you can write a @code{while} loop so that the body of the loop is evaluated if such a list contains elements, but to exit the loop if the list is empty. For this design to work, the body of the loop must contain an expression that shortens the list each time the body is evaluated, so that eventually the list is empty. The usual technique is to set the value of the list to the value of the @sc{cdr} of the list each time the body is evaluated.
es: El dise@~no usando un bucle @code{while} es rutina. El argumento que se pasaba a la funci@'on es una lista de ficheros. Como se vi@'o pronto (@pxref{Ejemplo de bucle}), se puede escribir un bucle @code{while} de un modo que el cuerpo del bucle es evaluado si tal lista contiene elementos, pero sale del bucle si la lista est@'a vac@'{@dotless{i}}a. Para que este dise@~no funcione, el cuerpo del bucle debe contener una expresi@'on que ordene la lista cada vez que el cuerpo es evaluado, de modo que finalmente la lista est@'e vac@'{@dotless{i}}a. La t@'ecnica normal es asignar el valor de la lista para el valor del @sc{cdr} de la lista cada vez que el cuerpo es evaluado.

source: The template looks like this:
es: La plantilla se ve as@'{@dotless{i}}:

source: Also, we remember that a @code{while} loop returns @code{nil} (the result of evaluating the true-or-false-test), not the result of any evaluation within its body. (The evaluations within the body of the loop are done for their side effects.) However, the expression that sets the lengths' list is part of the body---and that is the value that we want returned by the function as a whole. To do this, we enclose the @code{while} loop within a @code{let} expression, and arrange that the last element of the @code{let} expression contains the value of the lengths' list. (@xref{Incrementing Example, , Loop Example with an Incrementing Counter}.)
es: Tambi@'en, recu@'erdanos que un bucle @code{while} devuelve @code{nil} (el resultado de evaluar el true-or-false-test), no el resultado de cualquier evaluaci@'on con su cuerpo. (Las evaluaciones con el cuerpo del bucle son hechas para sus efectos laterales.) Sin embargo, la expresi@'on que asigna la lista de tama@~nos es parte del cuerpo --- y que es el valor que queremos devuelto por la funci@'on como un todo. Para hacer esto cerramos el bucle @code{while} con una expresi@'on @code{let}, y pone en orden que el @'ultimo elemento de la expresi@'on @code{let} contiene el valor de lista de tama@~nos. (@xref{Ejemplo de Incremento, , El Ejemplo del Bucle con un Contador de Incremento}.)

source: These considerations lead us directly to the function itself:
es: Estas consideraciones lideran directamente a la funci@'on en s@'{@dotless{i}}:

source: ;;; @r{Use @code{while} loop.} (defun lengths-list-many-files (list-of-files) "Return list of lengths of defuns in LIST-OF-FILES."
es: ;;; @r{Usar bucle @code{while}.} (defun lengths-list-many-files (list-of-files) "Devuelve la lista de tama@~nos de funciones en LIST-OF-FILES."

source: ;;; @r{Generate a lengths' list.} (lengths-list-file (expand-file-name (car list-of-files)))))
es: ;;; @r{Genera una lista de tama@~nos.} (lengths-list-file (expand-file-name (car list-of-files)))))

source: ;;; @r{Make files' list shorter.} (setq list-of-files (cdr list-of-files)))
es: ;;; @r{Crea una lista ordenada de ficheros.} (setq list-of-files (cdr list-of-files)))

source: ;;; @r{Return final value of lengths' list.} lengths-list))
es: ;;; @r{Devuelve la lista final de valores de tama@~nos.} lengths-list))

source: @code{expand-file-name} is a built-in function that converts a file name to the absolute, long, path name form. The function employs the name of the directory in which the function is called.
es: @code{expand-file-name} es una funci@'on construida que convierte un nombre de fichero al absoluto, forma de nombre de ruta. La funci@'on emplea el nombre del directorio en el que la funci@'on se llama.

source: Thus, if @code{expand-file-name} is called on @code{debug.el} when Emacs is visiting the @file{/usr/local/share/emacs/22.1.1/lisp/emacs-lisp/} directory,
es: De este modo, si @code{expand-file-name} es llamado en @code{debug.el} cuando Emacs est@'a visitando el directorio @file{/usr/local/share/emacs/22.1.1/lisp/emacs-lisp/}

source: becomes
es: llega a ser

source: The only other new element of this function definition is the as yet unstudied function @code{append}, which merits a short section for itself.
es: El @'unico nuevo elemento de esta definici@'on de funci@'on es la todav@'{@dotless{i}}a no estudiada funci@'on @code{append}, que merece una corta secci@'on en s@'{@dotless{i}}.

source: The @code{append} Function
es: La funci@'on @code{append}

source: The @code{append} function attaches one list to another. Thus,
es: La funci@'on @code{append} adjunta una lista a otra. De este modo,

source: produces the list
es: produce la lista

source: This is exactly how we want to attach two lengths' lists produced by @code{lengths-list-file} to each other. The results contrast with @code{cons},
es: Esto es exactamente c@'omo queremos adjuntar dos listas de tama@~nos producidas por @code{lengths-list-file} a cualquier otra. Los resultados contrastan con @code{cons},

source: which constructs a new list in which the first argument to @code{cons} becomes the first element of the new list:
es: que construye una nueva lista en el que el primer argumento para @code{cons} llega a ser el primer elemento de la nueva lista:

source: Recursively Count Words in Different Files
es: Recursivamente cuenta palabras en diferentes ficheros
