Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Often, one thinks of the binding within a @code{let} expression as somehow secondary to the `primary' work of a function. But in this case, what you might consider the `primary' job of the function, counting words, is done within the @code{let} expression.
es: Con frecuencia, uno piensa que se puede asociar una expresi@'on @code{let} como algo secundario al trabajo `primario' de una funci@'on. Pero en este caso, se podr@'{@dotless{i}}a considerar el trabajo `primario' de la funci@'on, contando palabras, esto es hecho con la expresi@'on @code{let}.

source: Using @code{let}, the function definition looks like this:
es: Usando @code{let}, la definici@'on de funci@'on se parece a:

source: (defun @value{COUNT-WORDS} (beginning end) "Print number of words in the region." (interactive "r")
es: (defun @value{COUNT-WORDS} (beginning end) "Imprime el n@'umero de palabras en la regi@'on." (interactive "r")

source: ;;; @r{1. Set up appropriate conditions.} (message "Counting words in region ... ") (save-excursion (goto-char beginning)
es: ;;; @r{1. Configura condiciones apropiadas.} (message "Contando palabras en la regi@'on ... ") (save-excursion (goto-char beginning)

source: ;;; @r{2. Count the words.} (let ((count (recursive-count-words end)))
es: ;;; @r{2. Contar las palabras.} (let ((count (recursive-count-words end)))

source: Next, we need to write the recursive counting function.
es: Lo siguiente, que se necesita es escribir la funci@'on de contaje recursivo.

source: A recursive function has at least three parts: the `do-again-test', the `next-step-expression', and the recursive call.
es: Una funci@'on recursiva tiene al menos tres partes: el `do-again-test', la `next-step-expression', y la llamada recursiva.

source: The do-again-test determines whether the function will or will not be called again. Since we are counting words in a region and can use a function that moves point forward for every word, the do-again-test can check whether point is still within the region. The do-again-test should find the value of point and determine whether point is before, at, or after the value of the end of the region. We can use the @code{point} function to locate point. Clearly, we must pass the value of the end of the region to the recursive counting function as an argument.
es: El do-again-test determina si la funci@'on ser@'a o no llamada de nuevo. Puesto que estamos contando palabras en una regi@'on y puede causar que una funci@'on se mueva el punto hacia delante por cada palabra, el do-again-test puede chequear si el punto est@'a todav@'{@dotless{i}}a con la regi@'on. El do-again-test encontrar@'{@dotless{i}}a el valor del punto y determina si el punto est@'a antes, en, o despu@'es del valor del fin de la regi@'on. Se puede usar la funci@'on @code{point} para localizar el punto. Claramente, se debe pasar el valor del fin de la regi@'on a la funci@'on de contaje recursivo como un argumento.

source: In addition, the do-again-test should also test whether the search finds a word. If it does not, the function should not call itself again.
es: Adem@'as, el do-again-test tambi@'en chequea si la b@'usqueda encuentra una palabra. Si no, la funci@'on no se llamar@'{@dotless{i}}a de nuevo.

source: The next-step-expression changes a value so that when the recursive function is supposed to stop calling itself, it stops. More precisely, the next-step-expression changes a value so that at the right time, the do-again-test stops the recursive function from calling itself again. In this case, the next-step-expression can be the expression that moves point forward, word by word.
es: La next-step-expression cambia un valor as@'{@dotless{i}} que cuando la funci@'on recursiva se supone que debe parar de llamarse as@'{@dotless{i}} misma, se para. M@'as precisamente, los cambios de next-step-expression cambia un valor as@'{@dotless{i}} en el momento adecuado, el do-again-test para la funci@'on recursiva de la llamada en s@'{@dotless{i}} de nuevo. En este caso, la next-step-expression puede ser la expresi@'on que mueve el punto hacia adelante, palabra por palabra.

source: The third part of a recursive function is the recursive call.
es: La tercera parte de una funci@'on recursiva es la llamada recursiva.

source: Somewhere, also, we also need a part that does the `work' of the function, a part that does the counting. A vital part!
es: En alg@'un lugar, tambi@'en, se necesita una parte que hace el `trabajo' de la funci@'on, una parte que es el contaje. @exclamdown{}Una parte vital!

source: But already, we have an outline of the recursive counting function:
es: Pero ya, tenemos un gui@'on de la funci@'on recursiva de contaje:

source: Now we need to fill in the slots. Let's start with the simplest cases first: if point is at or beyond the end of the region, there cannot be any words in the region, so the function should return zero. Likewise, if the search fails, there are no words to count, so the function should return zero.
es: Ahora se necesita rellenar los slots. Permite comenzar con el caso m@'as simple primero: si se apunta debajo del fin de la regi@'on, no puede haber palabras en la regi@'on, as@'{@dotless{i}} la funci@'on devuelve cero. De otro modo, si la b@'usqueda falla no hay palabras para contar, as@'{@dotless{i}} la funci@'on devolver@'{@dotless{i}}a cero.

source: On the other hand, if point is within the region and the search succeeds, the function should call itself again.
es: Por otro lado, si se apunta con la regi@'on y la b@'usqueda tiene @'exito, la funci@'on se llamar@'{@dotless{i}}a de nuevo.

source: Thus, the do-again-test should look like this:
es: De este modo, do-again-test se ver@'{@dotless{i}}a as@'{@dotless{i}}:

source: Note that the search expression is part of the do-again-test---the function returns @code{t} if its search succeeds and @code{nil} if it fails. (@xref{Whitespace Bug, , The Whitespace Bug in @code{@value{COUNT-WORDS}}}, for an explanation of how @code{re-search-forward} works.)
es: Note que la expresi@'on de b@'usqueda es parte del do-again-test --- la funci@'on devuelve @code{t} si su b@'usqueda tiene @'exito y @code{nil} si falla. (@xref{Error de espacio en blanco, , El Error de Espacio en Blanco en @code{@value{COUNT-WORDS}}}), para una explicaci@'on de c@'omo @code{re-search-forward} funciona.)

source: The do-again-test is the true-or-false test of an @code{if} clause. Clearly, if the do-again-test succeeds, the then-part of the @code{if} clause should call the function again; but if it fails, the else-part should return zero since either point is outside the region or the search failed because there were no words to find.
es: El do-again-test es el test true-or-false de una cl@'ausula @code{if}. Claramente si el do-again-test tiene @'exito, la then-part de la cl@'ausula @code{if} llamar@'{@dotless{i}}a a la funci@'on; pero si eso falla, la else-part devolver@'{@dotless{i}}a cero desde que el punto est@'a fuera de la regi@'on o la b@'usqueda fall@'o porque no hab@'{@dotless{i}}a palabras a encontrar.

source: But before considering the recursive call, we need to consider the next-step-expression. What is it? Interestingly, it is the search part of the do-again-test.
es: Pero antes de considerar la llamada recursiva, se necesita considerar la next-step-expression. @questiondown{}Qu@'e es eso? De manera interesante, eso es la parte de la b@'usqueda del do-again-test.

source: In addition to returning @code{t} or @code{nil} for the do-again-test, @code{re-search-forward} moves point forward as a side effect of a successful search. This is the action that changes the value of point so that the recursive function stops calling itself when point completes its movement through the region. Consequently, the @code{re-search-forward} expression is the next-step-expression.
es: Adem@'as para devolver @code{t} o @code{nil} para el do-again-test, @code{re-search-forward} mueve el punto hacia adelante como un efecto lateral de una b@'usqueda exitosa. Esta es la acci@'on que cambia el valor de punto as@'{@dotless{i}} que la funci@'on recursiva para de llamarse a s@'{@dotless{i}} misma cuando el punto complete su movimiento a trav@'es de la regi@'on. Por consiguiente, la expresi@'on @code{re-search-forward} es la next-step-expression.

source: In outline, then, the body of the @code{recursive-count-words} function looks like this:
es: En esquema, entonces, el cuerpo de la funci@'on @code{recursive-count-words} se parece a esto:

source: How to incorporate the mechanism that counts?
es: @questiondown{}C@'omo incorporar el mecanismo que cuenta?

source: If you are not used to writing recursive functions, a question like this can be troublesome. But it can and should be approached systematically.
es: Si no est@'as acostumbrado a escribir funciones recursivas, una pregunta como esta puede ser un problema. Pero eso puede y ser@'{@dotless{i}}a enfocado sistem@'aticamente.

source: We know that the counting mechanism should be associated in some way with the recursive call. Indeed, since the next-step-expression moves point forward by one word, and since a recursive call is made for each word, the counting mechanism must be an expression that adds one to the value returned by a call to @code{recursive-count-words}.
es: Se sabe que el mecanismo de contaje ser@'{@dotless{i}}a asociado en alg@'un lugar con la llamada recursiva. En vez de eso, desde que la next-step-expression mueve el punto hacia adelante por una palabra, y desde que una llamada recursiva es hecha para cada palabra, el mecanismo de contaje debe ser una expresi@'on que a@~nade uno al valor devuelto por una llamada para @code{recursive-count-words}

source: Consider several cases:
es: Considera varias casos:

source: If there are two words in the region, the function should return a value resulting from adding one to the value returned when it counts the first word, plus the number returned when it counts the remaining words in the region, which in this case is one.
es: Si hay dos palabras en la regi@'on, la funci@'on devolver@'a un valor resultante de a@~nadir uno al valor devuelto al contar la primera palabra, m@'as el n@'umero devuelto al contar las palabras que permanecen en la regi@'on, que en este caso es una.

source: If there is one word in the region, the function should return a value resulting from adding one to the value returned when it counts that word, plus the number returned when it counts the remaining words in the region, which in this case is zero.
es: Si hay una palabra en la regi@'on, la funci@'on devolver@'{@dotless{i}}a un valor resultante de a@~nadir uno al valor devuelto cuando eso cuenta esta palabra m@'as el n@'umero devuelto cuando eso cuenta las palabras que permanecen en la regi@'on, que en este caso es cero.

source: If there are no words in the region, the function should return zero.
es: Si no hay palabras en la regi@'on, la funci@'on devolver@'{@dotless{i}}a cero.

source: From the sketch we can see that the else-part of the @code{if} returns zero for the case of no words. This means that the then-part of the @code{if} must return a value resulting from adding one to the value returned from a count of the remaining words.
es: Desde el esquema se puede ver que la parte else del @code{if} devuelve cero para el caso en el que no hay palabras. Esto significa que la parte then del @code{if} debe devolver un valor resultante de a@~nadir uno al valor devuelto desde el contaje de las palabras que permanecen.

source: The expression will look like this, where @code{1+} is a function that adds one to its argument.
es: La expresi@'on se parece a esto, donde @code{1+} es una funci@'on que a@~nade uno a su argumento.

source: The whole @code{recursive-count-words} function will then look like this:
es: La funci@'on completa @code{recursive-count-words} entonces se parecer@'a e esto:

source: ;;; @r{2. then-part: the recursive call} (1+ (recursive-count-words region-end))
es: ;;; @r{2. then-part: la llamada recursiva} (1+ (recursive-count-words region-end))

source: Let's examine how this works:
es: Perm@'{@dotless{i}}teme examinar c@'omo esto funciona:

source: If there are no words in the region, the else part of the @code{if} expression is evaluated and consequently the function returns zero.
es: Si no hay palabras en la regi@'on, la parte else de la expresi@'on @code{if} es evaluada y, por tanto, la funci@'on devuelve cero.

source: If there is one word in the region, the value of point is less than the value of @code{region-end} and the search succeeds. In this case, the true-or-false-test of the @code{if} expression tests true, and the then-part of the @code{if} expression is evaluated. The counting expression is evaluated. This expression returns a value (which will be the value returned by the whole function) that is the sum of one added to the value returned by a recursive call.
es: Si hay una palabra en la regi@'on, el valor del punto es menor que el valor de @code{region-end} y la b@'usqueda tiene @'exito. En este caso, el true-or-false-test de la expresi@'on @code{if} chequea cierto, y la then-part de la expresi@'on @code{if} es evaluada. La expresi@'on de contaje se eval@'ua. Esta expresi@'on devuelve un valor (que ser@'a el valor devuelto por la funci@'on completa) que es la suma de uno a@~nadida al valor devuelto por una llamada recursiva.

source: Meanwhile, the next-step-expression has caused point to jump over the first (and in this case only) word in the region. This means that when @code{(recursive-count-words region-end)} is evaluated a second time, as a result of the recursive call, the value of point will be equal to or greater than the value of region end. So this time, @code{recursive-count-words} will return zero. The zero will be added to one, and the original evaluation of @code{recursive-count-words} will return one plus zero, which is one, which is the correct amount.
es: Mientras tanto, la next-step-expression ha causado el punto para saltar a trav@'es de la primera (y en este caso @'unica) palabra en la regi@'on. Esto significa que cuando @code{(recursive-count-words region-end)} est@'a evaluada una segunda vez, como un resultado de la llamada recursiva, el valor del punto ser@'a igual o mayor que el valor de la regi@'on final. As@'{@dotless{i}} esta vez, @code{recursive-count-words} devolver@'a cero. El cero ser@'a a@~nadido a uno, y la evaluaci@'on original de @code{recursive-count-words} devolver@'a uno m@'as cero (uno) que es la cantidad correcta.

source: Clearly, if there are two words in the region, the first call to @code{recursive-count-words} returns one added to the value returned by calling @code{recursive-count-words} on a region containing the remaining word---that is, it adds one to one, producing two, which is the correct amount.
es: Claramente, si hay dos palabras en la regi@'on, la primera llamada a @code{recursive-count-words} devuelve uno que se a@~nade al valor devuelto por el siguiente @code{recursive-count-words} en una regi@'on donde est@'a la palabra que permanece --- que es, eso a@~nadir uno a uno, produciendo dos, que es la cantidad correcta.

source: Similarly, if there are three words in the region, the first call to @code{recursive-count-words} returns one added to the value returned by calling @code{recursive-count-words} on a region containing the remaining two words---and so on and so on.
es: Similarmente, si hay tres palabras en la regi@'on, la primera llamada @code{recursive-count-words} devuelve uno a@~nadido al valor devuelto llamado @code{recursive-count-words} en una regi@'on conteniendo las dos palabras que faltan --- y as@'{@dotless{i}}.

source: With full documentation the two functions look like this:
es: Con documentaci@'on completa las dos funciones se parecen a esto:

source: The recursive function:
es: La funci@'on recursiva:

source: (defun recursive-count-words (region-end) "Number of words between point and REGION-END."
es: (defun recursive-count-words (region-end) "N@'umero de palabras entre punto y REGION-END."

source: The wrapper:
es: El envoltorio:

source: ;;; @r{Recursive version} (defun @value{COUNT-WORDS} (beginning end) "Print number of words in the region.
es: ;;; @r{Versi@'on Recursiva} (defun @value{COUNT-WORDS} (beginning end) "Imprime el n@'umero de palabras en la regi@'on.

source: Words are defined as at least one word-constituent character followed by at least one character that is not a word-constituent. The buffer's syntax table determines which characters these are."
es: Las palabras son definidas como al menos una palabra constituyente seguida por al menos un caracter que es una palabra constituyente. La tabla de sintaxis del buffer determina qu@'e caracter hay.

source: (interactive "r") (message "Counting words in region ... ") (save-excursion (goto-char beginning) (let ((count (recursive-count-words end)))
es: (interactive "r") (message "Contando palabras en la regi@'on ... ") (save-excursion (goto-char beginning) (let ((count (recursive-count-words end)))

source: (cond ((zerop count) (message "The region does NOT have any words."))
es: (cond ((zerop count) (message "La regi@'on no tiene palabras."))

source: ((= 1 count) (message "The region has 1 word.")) (t (message "The region has %d words." count))))))
es: ((= 1 count) (message "La regi@'on tiene 1 palabra.")) (t (message "La regi@'on tiene %d palabras." count))))))

source: Exercise: Counting Punctuation
es: Ejercicio: contando puntuaci@'on

source: Using a @code{while} loop, write a function to count the number of punctuation marks in a region---period, comma, semicolon, colon, exclamation mark, and question mark. Do the same using recursion.
es: Usando un bucle @code{while}, escriba una funci@'on para contar el n@'umero de marcas de puntuaci@'on en una regi@'on --- periodo, coma, punto y coma, dos puntos, exclamaci@'on, marca y marca de pregunta. Haga lo mismo usando recursi@'on.

source: Counting words in a @code{defun}
es: Contando palabras en un @code{defun}

source: Word counting in a @code{defun}
es: Contando las palabras en un @code{defun}

source: Our next project is to count the number of words in a function definition. Clearly, this can be done using some variant of @code{@value{COUNT-WORDS}}. @xref{Counting Words, , Counting Words: Repetition and Regexps}. If we are just going to count the words in one definition, it is easy enough to mark the definition with the @kbd{C-M-h} (@code{mark-defun}) command, and then call @code{@value{COUNT-WORDS}}.
es: El siguiente proyecto es contar el n@'umero de palabras en una definici@'on de funci@'on. Claramente, esto se puede hacer usando alguna variante de @code{@value{COUNT-WORDS}}. @xref{Contando palabras, , Contando palabras: repetici@'on y regexps}. Si se est@'a ahora yendo a contar las palabras en una definici@'on, es suficientemente f@'acil marcar la definici@'on con el comando @kbd{C-M-h} (@code{mark-defun}), y entonces se llama a @code{@value{COUNT-WORDS}}.

source: However, I am more ambitious: I want to count the words and symbols in every definition in the Emacs sources and then print a graph that shows how many functions there are of each length: how many contain 40 to 49 words or symbols, how many contain 50 to 59 words or symbols, and so on. I have often been curious how long a typical function is, and this will tell.
es: Sin embargo, soy m@'as ambicioso: Yo quiero contar las palabras y s@'{@dotless{i}}mbolos en cada definici@'on en las fuentes de Emacs y entonces imprimir un grafo que muestre cu@'antas funciones hay de cada tama@~no: cu@'antas contienen de 40 a 49 palabras o s@'{@dotless{i}}mbolos, cu@'antas contienen de 50 a 59 palabras o s@'{@dotless{i}}mbolos, y as@'{@dotless{i}}. Yo he sido con frecuencia curioso de c@'omo es una funci@'on t@'{@dotless{i}}pica, y esto se contar@'a.

source: Divide and Conquer
es: Divide y vencer@'as

source: Described in one phrase, the histogram project is daunting; but divided into numerous small steps, each of which we can take one at a time, the project becomes less fearsome. Let us consider what the steps must be:
es: Descrito en una frase, el proyecto desanima; pero dividido dentro de numerosos peque@~nos pasos, cada uno de los que podemos tomar en un momento, el proyecto llegar ser menos atemorizante. Perm@'{@dotless{i}}tenos considerar qu@'e pasos deben ser:

source: First, write a function to count the words in one definition. This includes the problem of handling symbols as well as words.
es: Primero, escribe una funci@'on para contar las palabras en una definici@'on. Esto incluye el problema de manejar s@'{@dotless{i}}mbolos tan bien como palabras.

source: Second, write a function to list the numbers of words in each function in a file. This function can use the @code{count-words-in-defun} function.
es: Segundo, escribe una funci@'on para listar los n@'umeros de palabras en cada funci@'on en un fichero. Esta funci@'on puede usar la funci@'on @code{count-words-in-defun}.

source: Third, write a function to list the numbers of words in each function in each of several files. This entails automatically finding the various files, switching to them, and counting the words in the definitions within them.
es: Tercero, escribe una funci@'on para listar los n@'umeros de palabras en cada funci@'on en cada uno de varios ficheros. Esto encola autom@'aticamente encontrando varios ficheros, cambi@'andolos, y contando las palabras en las definiciones con ellos.

source: Fourth, write a function to convert the list of numbers that we created in step three to a form that will be suitable for printing as a graph.
es: Cuarto, escribe una funci@'on para convertir la lista de n@'umeros que nosotros creamos en tres pasos para un formulario que se ajustar@'a para imprimir un grafo.

source: Fifth, write a function to print the results as a graph.
es: Quinto, escribe una funci@'on para imprimir los resultados como un grafo.

source: This is quite a project! But if we take each step slowly, it will not be difficult.
es: @exclamdown{}Esto es un proyecto! Pero si tomamos cada paso lentamente, eso no ser@'a dif@'{@dotless{i}}cil.

source: What to Count?
es: @questiondown{}Qu@'e contar?

source: Words and symbols in defun
es: Palabras y s@'{@dotless{i}}mbolos en defun

source: When we first start thinking about how to count the words in a function definition, the first question is (or ought to be) what are we going to count? When we speak of `words' with respect to a Lisp function definition, we are actually speaking, in large part, of `symbols'. For example, the following @code{multiply-by-seven} function contains the five symbols @code{defun}, @code{multiply-by-seven}, @code{number}, @code{*}, and @code{7}. In addition, in the documentation string, it contains the four words @samp{Multiply}, @samp{NUMBER}, @samp{by}, and @samp{seven}. The symbol @samp{number} is repeated, so the definition contains a total of ten words and symbols.
es: Cuando nosotros primero empezamos pensando acerca del contaje de palabras en una definici@'on de funci@'on, la primera pregunta es (o podr@'{@dotless{i}}a ser) @questiondown{}qu@'e se va a contar? Cuando se habla de `palabras' con repecto a una definici@'on de funci@'on Lisp, estamos actualmente hablando, en parte, de `s@'{@dotless{i}}mbolos'. Por ejemplo, la siguiente funci@'on @code{multiply-by-seven} contiene los cinco s@'{@dotless{i}}mbolos @code{defun}, @code{multipy-by-seven}, @code{number}, @code{*}, y @code{7}. Adem@'as, en la cadena de documentaci@'on, contiene cuatro palabras @samp{Multiplicar}, @samp{NUMBER}, @samp{por}, y @samp{siete}. El s@'{@dotless{i}}mbolo @samp{n@'umero} es repetido, as@'{@dotless{i}} la definici@'on contiene un total de diez palabras y s@'{@dotless{i}}mbolos.
