Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: In this example, the Lisp interpreter evaluates the innermost list first. The innermost list is quoted, so it just passes the list as it is to the innermost @code{cdr}. This @code{cdr} passes a list made up of the second and subsequent elements of the list to the outermost @code{cdr}, which produces a list composed of the third and subsequent elements of the original list. In this example, the @code{cdr} function is repeated and returns a list that consists of the original list without its first two elements.
es: En este ejemplo, el int@'erprete Lisp eval@'ua la lista propia dentro. La lista de dentro est@'a entre comillas, as@'{@dotless{i}} solo pasa la lista del @code{cdr} m@'as interno. Este @code{cdr} pasa una lista hecho del segundo y subsiguientes elementos de la lista al @code{cdr} m@'as externo, que produce una lista compuesta del tercer y subsiguientes elementos de la lista original. En este ejemplo, la funci@'on @code{cdr} se repite y devuelve una lista que consiste de la lista original sin sus primeros dos elementos.

source: The @code{nthcdr} function does the same as repeating the call to @code{cdr}. In the following example, the argument 2 is passed to the function @code{nthcdr}, along with the list, and the value returned is the list without its first two items, which is exactly the same as repeating @code{cdr} twice on the list:
es: La funci@'on @code{nthcdr} hace lo mismo que repitiendo la llamada a @code{cdr}. En el siguiente ejemplo, el segundo argumento se pasa a la funci@'on @code{nthcdr}, a trav@'es con la lista, y el valor devuelto es la lista sin sus primeros dos @'{@dotless{i}}tems, que son exactamente los mismos dos @code{cdr} en la lista:

source: (nthcdr 2 '(pine fir oak maple)) @result{} (oak maple)
es: (nthcdr 2 '(pino roble abeto arce)) @result{} (abeto arce)

source: Using the original four element list, we can see what happens when various numeric arguments are passed to @code{nthcdr}, including 0, 1, and 5:
es: Usando la lista original de cuatro elementos, se puede ver qu@'e ocurre cuando varios argumentos num@'ericos son pasados a @code{nthcdr}, incluyendo 0, 1, y 5:

source: ;; @r{Leave the list as it was.} (nthcdr 0 '(pine fir oak maple)) @result{} (pine fir oak maple)
es: ;; @r{Deja la lista como estaba.} (nthcdr 0 '(pine fir oak maple)) @result{} (pino roble abeto arce)

source: ;; @r{Return a copy without the first element.} (nthcdr 1 '(pine fir oak maple)) @result{} (fir oak maple)
es: ;; @r{Devuelve una copia sin el primer elemento.} (nthcdr 1 '(pine fir oak maple)) @result{} (fir oak maple)

source: ;; @r{Return a copy of the list without three elements.} (nthcdr 3 '(pine fir oak maple)) @result{} (maple)
es: ;; @r{Devuelve una copia de la lista sin tres elementos.} (nthcdr 3 '(pine fir oak maple)) @result{} (maple)

source: ;; @r{Return a copy lacking all four elements.} (nthcdr 4 '(pine fir oak maple)) @result{} nil
es: ;; @r{Devuelve la lista faltando los cuatro elementos.} (nthcdr 4 '(pine fir oak maple)) @result{} nil

source: ;; @r{Return a copy lacking all elements.} (nthcdr 5 '(pine fir oak maple)) @result{} nil
es: ;; @r{Devuelve una copia sin los elementos.} (nthcdr 5 '(pine fir oak maple)) @result{} nil

source: The @code{nthcdr} function takes the @sc{cdr} of a list repeatedly. The @code{nth} function takes the @sc{car} of the result returned by @code{nthcdr}. It returns the Nth element of the list.
es: La funci@'on @code{nthcdr} toma el @sc{cdr} de una lista repetidamente. La funci@'on @code{nth} toma el @sc{car} del resultado devuelto por @code{nthcdr}. Devuelve el elemento Nth de la lista.

source: Thus, if it were not defined in C for speed, the definition of @code{nth} would be:
es: De este modo, si no fuera definido en C para velocidad, la definici@'on de @code{nth} ser@'{@dotless{i}}a:

source: (defun nth (n list) "Returns the Nth element of LIST. N counts from zero. If LIST is not that long, nil is returned." (car (nthcdr n list)))
es: (defun nth (n list) "Devuelve el elemento Nth de Lista. N cuenta desde cero. Si Lista no es larga, nil es devuelto". (car (nthcdr n list)))

source: (Originally, @code{nth} was defined in Emacs Lisp in @file{subr.el}, but its definition was redone in C in the 1980s.)
es: (Originalmente, @code{nth} fu@'e definido en Emacs Lisp en @file{subr.el}, pero su definici@'on fu@'e rehecha en C en los 1980s.)

source: The @code{nth} function returns a single element of a list. This can be very convenient.
es: La funci@'on @code{nth} devuelve un elemento simple de una lista. Esto puede ser muy conveniente.

source: Note that the elements are numbered from zero, not one. That is to say, the first element of a list, its @sc{car} is the zeroth element. This is called `zero-based' counting and often bothers people who are accustomed to the first element in a list being number one, which is `one-based'.
es: N@'otese que los elementos son numerados desde cero, no desde uno. Es decir, el primer elemento de una lista, su @sc{car} es el elemento cero. Esto se llama contar en `base cero' y con frecuencia las personas tienen la costumbre del que el primer elemento en una lista sea el n@'umero uno, eso es `basado en uno'.

source: For example:
es: Por ejemplo:

source: (nth 0 '("one" "two" "three")) @result{} "one"
es: (nth 0 '("uno" "dos" "tres")) @result{} "uno"

source: (nth 1 '("one" "two" "three")) @result{} "two"
es: (nth 1 '("uno" "dos" "tres")) @result{} "dos"

source: It is worth mentioning that @code{nth}, like @code{nthcdr} and @code{cdr}, does not change the original list---the function is non-destructive. This is in sharp contrast to the @code{setcar} and @code{setcdr} functions.
es: Es valorable mencionar que @code{nth}, como @code{nthcdr} y @code{cdr}, no cambia la lista original --- la funci@'on no es destructiva. En contraste con las funciones @code{setcar} y @code{setcdr}.

source: As you might guess from their names, the @code{setcar} and @code{setcdr} functions set the @sc{car} or the @sc{cdr} of a list to a new value. They actually change the original list, unlike @code{car} and @code{cdr} which leave the original list as it was. One way to find out how this works is to experiment. We will start with the @code{setcar} function.
es: Como se podr@'{@dotless{i}}a adivinar desde sus nombres, las funciones @code{setcar} y @code{setcdr} asignan el @sc{car} o la @sc{cdr} de una lista a un nuevo valor. Ellos actualmente cambia la lista original, no como @code{car} y @code{cdr} que deja la lista original como estaba. Un camino para encontrar c@'omo esto funciona es experimentar. Se comenzar@'a con la funci@'on @code{setcar}.

source: First, we can make a list and then set the value of a variable to the list, using the @code{setq} function. Here is a list of animals:
es: Primero, podemos crear una lista y entonces asignar el valor de una variable a la lista usando la funci@'on @code{setq}. Aqu@'{@dotless{i}} hay una lista de animales:

source: (setq animals '(antelope giraffe lion tiger))
es: (setq animales '(antilope jirafa leon tigre))

source: If you are reading this in Info inside of GNU Emacs, you can evaluate this expression in the usual fashion, by positioning the cursor after the expression and typing @kbd{C-x C-e}. (I'm doing this right here as I write this. This is one of the advantages of having the interpreter built into the computing environment. Incidentally, when there is nothing on the line after the final parentheses, such as a comment, point can be on the next line. Thus, if your cursor is in the first column of the next line, you do not need to move it. Indeed, Emacs permits any amount of white space after the final parenthesis.)
es: Si est@'a leyendo esto en Info dentro de GNU Emacs, se puede evaluar esta expresi@'on del modo usual, posicionando el cursor despu@'es de la expresi@'on y escribiendo @kbd{C-x C-e}. Esto es una de las ventajas de tener el int@'erprete construido dentro del entorno de computaci@'on. Incidentalmente, cuando no hay nada en la l@'{@dotless{i}}nea despu@'es del par@'entesis final, tal como un comentario, el punto puede estar en la siguiente l@'{@dotless{i}}nea. De este modo, si tu cursor est@'a en la primera columna de la siguiente l@'{@dotless{i}}nea, no se necesita mover. En realidad, Emacs permite cualquier cantidad de espacio en blanco despu@'es del par@'entesis final.)

source: When we evaluate the variable @code{animals}, we see that it is bound to the list @code{(antelope giraffe lion tiger)}:
es: Cuando se eval@'ua la variable @code{animal}, vemos que est@'a asociada a la lista @code{(antelope giraffer lion tiger)}:

source: animals @result{} (antelope giraffe lion tiger)
es: animales @result{} (antilope jirafa leon tigre)

source: Put another way, the variable @code{animals} points to the list @code{(antelope giraffe lion tiger)}.
es: Por otro lado, la variable @code{animales} apunta a la lista @code{(antilope jirafa leon tigre)}.

source: Next, evaluate the function @code{setcar} while passing it two arguments, the variable @code{animals} and the quoted symbol @code{hippopotamus}; this is done by writing the three element list @code{(setcar animals 'hippopotamus)} and then evaluating it in the usual fashion:
es: Lo siguiente, es evaluar la funci@'on @code{setcar} mientras le pasa dos argumentos, la variable @code{animales} y el s@'{@dotless{i}}mbolo citado @code{hipopotamo}; esto se hace escribiendo la lista de tres elementos @code{(setcar animales 'hipopotamo)} y entonces evaluando en el modo usual:

source: (setcar animals 'hippopotamus)
es: (setcar animales 'hipopotamo)

source: After evaluating this expression, evaluate the variable @code{animals} again. You will see that the list of animals has changed:
es: Despu@'es de evaluar esta expresi@'on, eval@'ua la variable @code{animales} de nuevo. Se puede ver que la lista de animales ha cambiado:

source: animals @result{} (hippopotamus giraffe lion tiger)
es: animales @result{} (hipop@'otamo jirafa leon tigre)

source: The first element on the list, @code{antelope} is replaced by @code{hippopotamus}.
es: El primer elemento en la lista, @code{antilope} se reemplaza por @code{hipopotamo}.

source: So we can see that @code{setcar} did not add a new element to the list as @code{cons} would have; it replaced @code{antelope} with @code{hippopotamus}; it @emph{changed} the list.
es: As@'{@dotless{i}} se puede ver que @code{setcar} no a@~nadi@'o un nuevo elemento a la lista como @code{cons} tendr@'{@dotless{i}}a; eso reemplaz@'o @code{ant@'{@dotless{i}}lope} con @code{hipop@'otamo}; eso @emph{cambi@'o} la lista.

source: The @code{setcdr} function is similar to the @code{setcar} function, except that the function replaces the second and subsequent elements of a list rather than the first element.
es: La funci@'on @code{setcdr} es similar a la funci@'on @code{setcar}, excepto que la funci@'on reemplaza el segundo y subsiguientes elementos de una lista en vez del primer elemento.

source: (To see how to change the last element of a list, look ahead to @ref{kill-new function, , The @code{kill-new} function}, which uses the @code{nthcdr} and @code{setcdr} functions.)
es: (Para ver c@'omo se cambia el @'ultimo elemento de una lista, mira hacia delante a la @ref{Funci@'on kill-new, , La funci@'on @code{kill-new}}, que usa las funciones @code{nthcdr} y @code{setcdr}.)

source: To see how this works, set the value of the variable to a list of domesticated animals by evaluating the following expression:
es: Para ver c@'omo esto funciona, asigna el valor de la variable a una lista de animales domesticados evaluando la siguiente expresi@'on:

source: (setq domesticated-animals '(horse cow sheep goat))
es: (setq animales-domesticos '(caballo vaca oveja cabra))

source: If you now evaluate the list, you will be returned the list @code{(horse cow sheep goat)}:
es: Si ahora se eval@'ua la lista, lo que se devuelve es @code{(caballo vaca oveja cabra)}:

source: domesticated-animals @result{} (horse cow sheep goat)
es: animales-domesticos @result{} (caballo vaca oveja cabra)

source: Next, evaluate @code{setcdr} with two arguments, the name of the variable which has a list as its value, and the list to which the @sc{cdr} of the first list will be set;
es: Lo siguiente, eval@'ua @code{setcdr} con dos argumentos, el nombre de la variable que tiene una lista como su valor, y la lista para la que el @sc{cdr} de la primera lista sea asignada;

source: (setcdr domesticated-animals '(cat dog))
es: (setcdr animales-domesticos '(gato perro))

source: If you evaluate this expression, the list @code{(cat dog)} will appear in the echo area. This is the value returned by the function. The result we are interested in is the ``side effect'', which we can see by evaluating the variable @code{domesticated-animals}:
es: Si se eval@'ua esta expresi@'on, la lista @code{(gato perro)} aparecer@'a en el @'area echo. Este es el valor devuelto por la funci@'on. El resultado en el que estamos interesados es el ``efecto lateral'', que se puede ver evaluando la variable @code{domesticated-animals}:

source: domesticated-animals @result{} (horse cat dog)
es: animales-domesticos @result{} (caballo gato perro)

source: Indeed, the list is changed from @code{(horse cow sheep goat)} to @code{(horse cat dog)}. The @sc{cdr} of the list is changed from @code{(cow sheep goat)} to @code{(cat dog)}.
es: En realidad, la lista es cambiada desde @code{(caballo vaca oveja cabra)} a @code{(caballo gato perro)}. El @sc{cdr} de la lista es cambiada desde @code{(vaca oveja cabra)} a @code{(gato perro)}.

source: Construct a list of four birds by evaluating several expressions with @code{cons}. Find out what happens when you @code{cons} a list onto itself. Replace the first element of the list of four birds with a fish. Replace the rest of that list with a list of other fish.
es: Construye una lista de cuatro p@'ajaros evaluando varias expresiones con @code{cons}. Encuentra que ocurre cuando @code{cons} una lista dentro de s@'{@dotless{i}}. Reemplaza el primer elemento de la lista de cuatro p@'ajaros con un pez. Reemplaza el resto de esta lista con una lista de otro pez.

source: Cutting and storing text
es: Cortando y almacenando texto

source: Storing and cutting text
es: Almacenando y cortando texto

source: Killing text
es: Cortando texto

source: Clipping text
es: Copiando texto

source: Erasing text
es: Borrando texto

source: Deleting text
es: Borrando texto

source: Whenever you cut or clip text out of a buffer with a `kill' command in GNU Emacs, it is stored in a list and you can bring it back with a `yank' command.
es: Siempre y cuando se corte o pegue texto de un b@'uffer con un comando `kill' en GNU Emacs, se almacenar@'a dentro de una lista que se puede traer con un comando `yank'.

source: (The use of the word `kill' in Emacs for processes which specifically @emph{do not} destroy the values of the entities is an unfortunate historical accident. A much more appropriate word would be `clip' since that is what the kill commands do; they clip text out of a buffer and put it into storage from which it can be brought back. I have often been tempted to replace globally all occurrences of `kill' in the Emacs sources with `clip' and all occurrences of `killed' with `clipped'.)
es: (El uso de la palabra `kill' @emph{matar, cortar} en Emacs para procesos que espec@'{@dotless{i}}ficamente @emph{no} destruyen los valores de las entidades es un accidente hist@'orico desafortunado. Una palabra mucho m@'as apropiada deber@'{@dotless{i}}a ser `clip' @emph{cortar} puesto que es lo que los comandos de corte hacen; ellos cortan texto fuera de un b@'uffer y lo ponen dentro del almacenamiento desde el que puede traerse. Con frecuencia ha sido tentada de reemplazar globalmente todas las ocurrencia de `kill' @emph{matar, cortar} en las fuentes de Emacs con `clip' @emph{cortar} y todas las ocurrencias de `killed' @emph{cortado, muerto} con `clipped' @emph{cortado}.)

source: Storing Text in a List
es: Almacenando texto en una lista

source: When text is cut out of a buffer, it is stored on a list. Successive pieces of text are stored on the list successively, so the list might look like this:
es: Cuando el texto se corta de un b@'uffer, es almacenado en una lista. Piezas sucesivas de texto se almacenan en la lista sucesivamente, as@'{@dotless{i}} la lista podr@'{@dotless{i}}a verse as@'{@dotless{i}}:

source: ("a piece of text" "previous piece")
es: ("una pieza de texto" "pieza previa")

source: The function @code{cons} can be used to create a new list from a piece of text (an `atom', to use the jargon) and an existing list, like this:
es: La funci@'on @code{cons} puede usarse para crear una nueva lista desde una pieza de texto (un `@'atomo', para usar la jerga) y una lista existente, como esta:

source: (cons "another piece" '("a piece of text" "previous piece"))
es: (cons "otra pieza" '("una pieza de texto" "pieza previa"))

source: If you evaluate this expression, a list of three elements will appear in the echo area:
es: Si se eval@'ua esta expresi@'on, una lista de tres elementos aparecer@'a en el @'area echo:

source: ("another piece" "a piece of text" "previous piece")
es: ("otra pieza" "una pieza de texto" "pieza previa")

source: With the @code{car} and @code{nthcdr} functions, you can retrieve whichever piece of text you want. For example, in the following code, @code{nthcdr 1 @dots{}} returns the list with the first item removed; and the @code{car} returns the first element of that remainder---the second element of the original list:
es: Con las funciones @code{car} y @code{nthcdr}, se puede recuperar siempre la pieza de texto que se quiere. Por ejemplo, en el siguiente c@'odigo, @code{nthcdr 1 @dots{}} devuelve la lista con el primer @'{@dotless{i}}tem eliminado; y el @code{car} devuelve el primer elemento de este resto --- el segundo elemento de la lista original:

source: (car (nthcdr 1 '("another piece" "a piece of text" "previous piece"))) @result{} "a piece of text"
es: (car (nthcdr 1 '("otra pieza" "una pieza de texto" "pieza previa"))) @result{} "una pieza de texto"

source: The actual functions in Emacs are more complex than this, of course. The code for cutting and retrieving text has to be written so that Emacs can figure out which element in the list you want---the first, second, third, or whatever. In addition, when you get to the end of the list, Emacs should give you the first element of the list, rather than nothing at all.
es: Las funciones actuales en Emacs son m@'as complejas que esto, de acuerdo. El c@'odigo para cortar y recuperar texto tiene que ser escrito de modo que Emacs pueda ver qu@'e elemento en la lista se quiere --- el primer, segundo, tercer o cualquier otro. Adem@'as, cuando tiene el fin de la lista, Emacs dar@'{@dotless{i}}a el primer elemento de la lista, en lugar de nada.

source: The list that holds the pieces of text is called the @dfn{kill ring}. This chapter leads up to a description of the kill ring and how it is used by first tracing how the @code{zap-to-char} function works. This function uses (or `calls') a function that invokes a function that manipulates the kill ring. Thus, before reaching the mountains, we climb the foothills.
es: La lista que maneja las piezas de texto se llama @dfn{kill ring} (anillo de la muerte). Este cap@'{@dotless{i}}tulo lidera una descripci@'on del anillo de la muerte y como eso se usa por la primera traza de c@'omo la funci@'on @code{zap-to-char} funciona. Esta funci@'on usa (o `llama') a una funci@'on que invoca a otra funci@'on que manipula el anillo de la muerte. De este modo, antes de lograr las monta@~nas, se escalan las colinas.

source: A subsequent chapter describes how text that is cut from the buffer is retrieved. @xref{Yanking, , Yanking Text Back}.
es: Un cap@'{@dotless{i}}tulo subsiguiente describe c@'omo el texto que se corta desde el b@'uffer se recupera. @xref{Pegando, , Pegando Texto}.

source: The @code{zap-to-char} function changed little between GNU Emacs version 19 and GNU Emacs version 22. However, @code{zap-to-char} calls another function, @code{kill-region}, which enjoyed a major rewrite.
es: La funci@'on @code{zap-to-char} cambi@'o poco entre GNU Emacs versi@'on 19 y GNU Emacs versi@'on 22. Sin embargo, @code{zap-to-char} llama a otra funci@'on, @code{kill-region}, que se reescribi@'o m@'as.

source: The @code{kill-region} function in Emacs 19 is complex, but does not use code that is important at this time. We will skip it.
es: La funci@'on @code{kill-region} en Emacs 19 es compleja, pero no usa c@'odigo que es importante en este momento. Se obviar@'a.

source: The @code{kill-region} function in Emacs 22 is easier to read than the same function in Emacs 19 and introduces a very important concept, that of error handling. We will walk through the function.
es: La funci@'on @code{kill-region} en Emacs 22 es m@'as de f@'acil leer que la misma funci@'on en Emacs 19 e introduce un concepto muy importante, que el error maneja. Nosotros pasearemos a trav@'es de la funci@'on.

source: But first, let us look at the interactive @code{zap-to-char} function.
es: Pero primero, d@'ejanos ver en la funci@'on interactive @code{zap-to-char}.

source: The Complete @code{zap-to-char} Implementation
es: La implementaci@'on completa @code{zap-to-char}

source: The @code{zap-to-char} function removes the text in the region between the location of the cursor (i.e., of point) up to and including the next occurrence of a specified character. The text that @code{zap-to-char} removes is put in the kill ring; and it can be retrieved from the kill ring by typing @kbd{C-y} (@code{yank}). If the command is given an argument, it removes text through that number of occurrences. Thus, if the cursor were at the beginning of this sentence and the character were @samp{s}, @samp{Thus} would be removed. If the argument were two, @samp{Thus, if the curs} would be removed, up to and including the @samp{s} in @samp{cursor}.
es: La funci@'on @code{zap-to-char} elimina el texto en la regi@'on entre la localizaci@'on del curso (por ej. punto) para incluir la siguiente ocurrencia de un caracter espec@'{@dotless{i}}fico. El texto que @code{zap-to-char} borra es puesto en el kill ring @emph{anillo de la muerte}; y puede ser recuperado desde el kill ring @emph{anillo de la muerte} escribiendo @kbd{C-y} (@code{yank}). Si el comando dado es un argumento, eso borra texto a trav@'es de este n@'umero de ocurrencias. De este modo, si el cursor estuviera al principio de esta frase y el car@'acter fuera @samp{s}, @samp{De este modo} ser@'{@dotless{i}}a borrado. Si el argumento fueran dos, @samp{De este modo, si el cursor} se borrase, y incluir@'{@dotless{i}}a la @samp{s} en el @samp{cursor}.

source: If the specified character is not found, @code{zap-to-char} will say ``Search failed'', tell you the character you typed, and not remove any text.
es: Si el car@'acter espec@'{@dotless{i}}fico no encuentra @code{zap-to-char} dir@'a ``B@'usqueda fallida'', eso cuenta el car@'acter que se escribi@'o, y no elimin@'o cualquier texto.

source: In order to determine how much text to remove, @code{zap-to-char} uses a search function. Searches are used extensively in code that manipulates text, and we will focus attention on them as well as on the deletion command.
es: En orden para determinar cu@'anto texto eliminar @code{zap-to-char} usa una funci@'on de b@'usqueda. Las b@'usquedas son usadas extensivamente en el c@'odigo que manipula texto, y focalizar@'a la atenci@'on en ellos tan bien como el comando de borrado.

source: Here is the complete text of the version 22 implementation of the function:
es: Aqu@'{@dotless{i}} est@'a el texto completo de la versi@'on 22 de la funci@'on:
