Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: Odd as it seems, the examples we have seen cover almost all of what Lisp lists look like! Every other list in Lisp looks more or less like one of these examples, except that the list may be longer and more complex. In brief, a list is between parentheses, a string is between quotation marks, a symbol looks like a word, and a number looks like a number. (For certain situations, square brackets, dots and a few other special characters may be used; however, we will go quite far without them.)
es: Aunque parezca raro, los ejemplos que hemos visto cubren casi todo lo aparece en las listas Lisp. Cualquier otra lista en Lisp se ve m@'as o menos igual a uno de estos ejemplos, excepto que la lista puede ser m@'as larga y m@'as compleja. En resumen, una lista est@'a entre par@'entesis, una cadena est@'a entre comillas, un s@'{@dotless{i}}mbolo parece como una palabra, y un n@'umero parece un n@'umero. (Para ciertas situaciones, corchetes, puntos y otros caracteres especiales pueden ser usados; sin embargo; iremos bastante lejos sin ellos.)

source: GNU Emacs Helps You Type Lists
es: GNU Emacs te ayuda a escribir listas

source: Help typing lists
es: Ayuda escribiendo listas

source: Formatting help
es: Formateando ayuda

source: When you type a Lisp expression in GNU Emacs using either Lisp Interaction mode or Emacs Lisp mode, you have available to you several commands to format the Lisp expression so it is easy to read. For example, pressing the @key{TAB} key automatically indents the line the cursor is on by the right amount. A command to properly indent the code in a region is customarily bound to @kbd{M-C-\}. Indentation is designed so that you can see which elements of a list belong to which list---elements of a sub-list are indented more than the elements of the enclosing list.
es: Cuando se escribe una expresi@'on Lisp en GNU Emacs usando bien el modo de Interacci@'on Lisp o el modo Emacs Lisp, est@'an disponibles varios comandos para formatear la expresi@'on Lisp, de modo que sea f@'acil de leer. Por ejemplo, presionando la tecla @key{TAB} autom@'aticamente se indenta la l@'{@dotless{i}}nea donde se encuetra el cursor a la cantidad correcta. Un comando para indentar apropiadamente el c@'odigo en una regi@'on est@'a asociado a @kbd{M-C-\}. La indentaci@'on est@'a dise@~nada de modo que se pueda ver qué elementos percecen a cada lista---los elementos de una sublista est@'an m@'as indentados que los elementos de una lista cerrada.

source: In addition, when you type a closing parenthesis, Emacs momentarily jumps the cursor back to the matching opening parenthesis, so you can see which one it is. This is very useful, since every list you type in Lisp must have its closing parenthesis match its opening parenthesis. (@xref{Major Modes, , Major Modes, emacs, The GNU Emacs Manual}, for more information about Emacs's modes.)
es: Adem@'as, cuando se escribe un par@'entesis de cierre, Emacs moment@'aneamente salta el cursor atr@'as para hacer el matching (emparejamiento) con el par@'entesis de apertura, para ver cu@'al es. Esto es muy @'util, ya que cada lista que se escribe en Lisp debe tener sus par@'entesis emparejados con sus par@'entesis de apertura. (Ver @ref{Modos Mayores, Modos Mayores, emacs, El Manual de GNU Emacs}, para m@'as informaci@'on acerca de modos de Emacs.)

source: Run a program
es: Ejecuta un programa

source: Program, running one
es: Programa, ejecutando uno

source: @samp{evaluate} defined
es: se defini@'o @samp{evaluate}

source: A list in Lisp---any list---is a program ready to run. If you run it (for which the Lisp jargon is @dfn{evaluate}), the computer will do one of three things: do nothing except return to you the list itself; send you an error message; or, treat the first symbol in the list as a command to do something. (Usually, of course, it is the last of these three things that you really want!)
es: Una lista en Lisp ---cualquier lista--- es un programa listo para ser ejecutado. Si lo ejecutas (lo que la jerga Lisp llama @dfn{evaluar}), el ordenador har@'a una de tres cosas: nada excepto devolverte la lista misma; enviar un mensaje de error; o, tomar el primer s@'{@dotless{i}}mbolo en la lista como un comando para hacer alguna cosa. (@exclamdown{}Normalmente, es lo @'ultimo de estas tres cosas de lo que realmente se quiere!).

source: The single apostrophe, @code{'}, that I put in front of some of the example lists in preceding sections is called a @dfn{quote}; when it precedes a list, it tells Lisp to do nothing with the list, other than take it as it is written. But if there is no quote preceding a list, the first item of the list is special: it is a command for the computer to obey. (In Lisp, these commands are called @emph{functions}.) The list @code{(+ 2 2)} shown above did not have a quote in front of it, so Lisp understands that the @code{+} is an instruction to do something with the rest of the list: add the numbers that follow.
es: El ap@'ostrofe, @code{'}, que se pone enfrente de alg@'unos ejemplos de lista en secciones anteriores se llama @dfn{quote}; (citar); cuando precede a una lista, se informa a Lisp no hacer nada con la lista, mas que la tomarla tal como est@'a escrita. Pero si no hay una cita precediendo la lista, el primer @'{@dotless{i}}tem de la lista es especial: es un comando para que el ordenador obedezca. (En Lisp, estos comandos son llamados @emph{funciones}.) A continuación se muestra la lista no citada @code{(+ 2 2)}, por lo que Lisp comprende que @code{+} es una instrucci@'on para hacer alguna cosa con el resto de la lista: suma los n@'umeros que siguen.

source: If you are reading this inside of GNU Emacs in Info, here is how you can evaluate such a list: place your cursor immediately after the right hand parenthesis of the following list and then type @kbd{C-x C-e}:
es: Si est@'as leyendo esto dentro de GNU Emacs en Info, aqu@'{@dotless{i}} est@'a como puedes evaluar una lista: coloca tu cursor justo después del paréntesis derecho de la siguiente lista y presiona @kbd{C-x C-e}:

source: You will see the number @code{4} appear in the echo area. (In the jargon, what you have just done is ``evaluate the list.'' The echo area is the line at the bottom of the screen that displays or ``echoes'' text.) Now try the same thing with a quoted list: place the cursor right after the following list and type @kbd{C-x C-e}:
es: Ver@'as que el n@'umero @code{4} aparece en el @'area echo. (En la jerga, lo que acabas de hacer es ``evaluar la lista.'' El @'area echo es la l@'{@dotless{i}}nea en la parte inferior de la pantalla que muestra o hace ``echo'' del texto). Ahora intenta la misma cosa con una lista citada: posiciona el cursor justo despu@'es de la siguiente lista y presiona @kbd{C-x C-e}:

source: '(this is a quoted list)
es: '(esto es una lista con comillas)

source: You will see @code{(this is a quoted list)} appear in the echo area.
es: Se ver@'a aparecer @code{(esto es una lista con comillas)} en el @'area echo.

source: Lisp interpreter, explained
es: Int@'erprete Lisp, explicada

source: Interpreter, Lisp, explained
es: Int@'erprete, Lisp, explicado

source: In both cases, what you are doing is giving a command to the program inside of GNU Emacs called the @dfn{Lisp interpreter}---giving the interpreter a command to evaluate the expression. The name of the Lisp interpreter comes from the word for the task done by a human who comes up with the meaning of an expression---who ``interprets'' it.
es: En ambos casos, lo que est@'as haciendo es dar un comando al programa dentro de GNU Emacs llamado @dfn{int@'erprete Lisp} --- dando al int@'erprete un comando para evaluar la expresi@'on. El nombre del int@'erprete Lisp viene de la palabra para la tarea hecha por un humano que viene con el significado de una expresi@'on --- quien lo ``interpreta''.

source: You can also evaluate an atom that is not part of a list---one that is not surrounded by parentheses; again, the Lisp interpreter translates from the humanly readable expression to the language of the computer. But before discussing this (@pxref{Variables}), we will discuss what the Lisp interpreter does when you make an error.
es: Tambi@'en se puede evaluar un @'atomo que no es parte de una lista --- uno que no est@'a rodeado por par@'entesis; de nuevo, el int@'erprete Lisp traduce desde la expresi@'on humanamente legible al lenguaje del ordenador. Pero antes de discutir esto (ver @ref{Variables}), vamos a discutir lo que el int@'erprete de Lisp hace cuando tu creas el error.

source: Generate an Error Message
es: Generar un mensaje de error

source: Generate an error message
es: Genera un mensaje de error

source: Error message generation
es: Generaci@'on de mensaje de Error

source: Partly so you won't worry if you do it accidentally, we will now give a command to the Lisp interpreter that generates an error message. This is a harmless activity; and indeed, we will often try to generate error messages intentionally. Once you understand the jargon, error messages can be informative. Instead of being called ``error'' messages, they should be called ``help'' messages. They are like signposts to a traveler in a strange country; deciphering them can be hard, but once understood, they can point the way.
es: No se preocupe si genera un mensaje de error de manera accidental, ahora daremos un comando al int@'erprete de Lisp que genara un mensaje de error. Esta es una accion inofensiva; y de hecho, a menudo se intenta generar mensajes de error de manera intencional. Una vez se comprende la jerga, los mensajes de error pueden ser informativos. En vez de ser llamados mensajes de ``error'', deber@'{@dotless{i}}an ser llamados mensajes de ``ayuda''. Son como letreros para un viajero en un país extraño; descifrarlos puede ser duro, pero una vez comprendidos, pueden señalar el camino.

source: The error message is generated by a built-in GNU Emacs debugger. We will `enter the debugger'. You get out of the debugger by typing @code{q}.
es: El mensaje de error es generado por un depurador de c@'odigo incorporado dentro de GNU Emacs. As@'{@dotless{i}} se `entra al depurador'. Se puede salir del depurador pulsando @code{q}.

source: What we will do is evaluate a list that is not quoted and does not have a meaningful command as its first element. Here is a list almost exactly the same as the one we just used, but without the single-quote in front of it. Position the cursor right after it and type @kbd{C-x C-e}:
es: Lo que se hace es evaluar una lista que no est@'a citada y no tiene un comando con significado como su primer elemento. Aqu@'{@dotless{i}} hay una lista casi exactamente igual a la que acabamos de usar, pero sin la cita al inicio. Coloque el cursor a la derecha donde esta finaliza y presione @kbd{C-x C-e}:

source: (this is an unquoted list)
es: (esto es una lista sin cita)

source: A @file{*Backtrace*} window will open up and you should see the following in it:
es: Se abrir@'a una ventana @file{*Backtrace*} y se ver@'a lo siguiente:

source: ---------- Buffer: *Backtrace* ---------- Debugger entered--Lisp error: (void-function this) (this is an unquoted list) eval((this is an unquoted list)) eval-last-sexp-1(nil) eval-last-sexp(nil) call-interactively(eval-last-sexp) ---------- Buffer: *Backtrace* ----------
es: ---------- Buffer: *Backtrace* ---------- Debugger entered--Lisp error: (void-function esto) (esto es una lista sin cita) eval((esto es una lista sin cita) nil) eval-last-sexp-1(nil) eval-last-sexp(nil) call-interactively(eval-last-sexp nil nil) command-execute(eval-last-sexp) ---------- Buffer: *Backtrace* ----------

source: Your cursor will be in this window (you may have to wait a few seconds before it becomes visible). To quit the debugger and make the debugger window go away, type:
es: Su cursor estar@'a en esta ventana (puede tener que esperar unos pocos segundos antes de que sea visible). Para salir del depurador y de su ventana, presione:

source: Please type @kbd{q} right now, so you become confident that you can get out of the debugger. Then, type @kbd{C-x C-e} again to re-enter it.
es: Por favor, ahora pulsa @kbd{q}, as@'{@dotless{i}} se comprueba que se puede salir del depurador. A continuacion, presione "@kbd{C-x C-e} una vez m@'as para re-entrar.

source: @samp{function} defined
es: @samp{funci@'on} definida

source: Based on what we already know, we can almost read this error message.
es: Sobre la base de lo que ya sabemos, casi podemos leer este mensaje de error.

source: You read the @file{*Backtrace*} buffer from the bottom up; it tells you what Emacs did. When you typed @kbd{C-x C-e}, you made an interactive call to the command @code{eval-last-sexp}. @code{eval} is an abbreviation for `evaluate' and @code{sexp} is an abbreviation for `symbolic expression'. The command means `evaluate last symbolic expression', which is the expression just before your cursor.
es: Leer el b@'uffer @file{*Backtrace*} de abajo hacia arriba; informa lo que Emacs ha hecho. Cuando se presiona @kbd{C-x C-e}, se hace una llamada interactiva a el comando @code{eval-last-sexp}. @code{eval} es una abreviatura para `evaluar' y @code{sexp} es una abreviatura para `expresi@'on simb@'olica'. El comando significa `eval@'ua la @'ultima expresi@'on simb@'olica', que es la expresi@'on justo antes de tu cursor.

source: Each line above tells you what the Lisp interpreter evaluated next. The most recent action is at the top. The buffer is called the @file{*Backtrace*} buffer because it enables you to track Emacs backwards.
es: Cada l@'{@dotless{i}}nea anterior a esta cuenta lo que el int@'erprete de Lisp evaluo despu@'es. La acci@'on m@'as reciente est@'a en la parte superior. El b@'uffer es llamado @file{*Backtrace*} ya que permite realizar un seguimiento de Emacs hacia atr@'as.

source: At the top of the @file{*Backtrace*} buffer, you see the line:
es: En la parte superior del b@'uffer @file{*Backtrace*}, ver@'a la l@'{@dotless{i}}nea:

source: Debugger entered--Lisp error: (void-function this)
es: Debugger entered--Lisp error: (void-function esto)

source: The Lisp interpreter tried to evaluate the first atom of the list, the word @samp{this}. It is this action that generated the error message @samp{void-function this}.
es: El int@'erprete Lisp intent@'o evaluar el primer @'atomo de la lista, la palabra @samp{esto}. Esta es la acci@'on que gener@'o el mensaje de error @samp{void-function esto}.

source: The message contains the words @samp{void-function} and @samp{this}.
es: El mensaje contiene las palabras @samp{void-function} y @samp{esto}.

source: The word @samp{function} was mentioned once before. It is a very important word. For our purposes, we can define it by saying that a @dfn{function} is a set of instructions to the computer that tell the computer to do something.
es: La palabra @samp{function} fu@'e mencionada antes. Es una palabra muy importante. Para nuestros prop@'ositos, podemos definirla diciendo que una @dfn{funci@'on} (@emph{function}) es un conjunto de instrucciones para decirle al ordenador que haga alguna cosa.

source: Now we can begin to understand the error message: @samp{void-function this}. The function (that is, the word @samp{this}) does not have a definition of any set of instructions for the computer to carry out.
es: Ahora podemos empezar a comprender el mensaje de error: @samp{void-function this}. La funci@'on (que es, la palabra @samp{this}) no tiene la definici@'on de ningun conjunto de instrucciones que el ordenador pueda realizar.

source: The slightly odd word, @samp{void-function}, is designed to cover the way Emacs Lisp is implemented, which is that when a symbol does not have a function definition attached to it, the place that should contain the instructions is `void'.
es: La palabra ligeramente extra@~na, @samp{void-function}, est@'a dise@~nada para cubrir la forma en que Emacs Lisp lo implementa, que es cuando un s@'imbolo no tiene una definici@'on de funci@'on atribuido, el sitio que contiene la instrucci@'on esta `vac@'io' (@samp{void}).

source: On the other hand, since we were able to add 2 plus 2 successfully, by evaluating @code{(+ 2 2)}, we can infer that the symbol @code{+} must have a set of instructions for the computer to obey and those instructions must be to add the numbers that follow the @code{+}.
es: Por otro lado, ya que fuimos capaces de a@~nadir 2 m@'as 2 de manera exitosa, evaluando @code{(+ 2 2)}, se puede inferir que el s@'{@dotless{i}}mbolo @code{+} debe tener un conjunto de instrucciones que el ordenador ejecuta y estas instrucciones deben sumar los n@'umeros despues del @code{+}.

source: It is possible to prevent Emacs entering the debugger in cases like this. We do not explain how to do that here, but we will mention what the result looks like, because you may encounter a similar situation if there is a bug in some Emacs code that you are using. In such cases, you will see only one line of error message; it will appear in the echo area and look like this:
es: Es posible evitar que Emacs entre en el depurador en casos como este. No se explicar@'a c@'omo hacer esto aqu@'{@dotless{i}}, pero se mencionar@'a un resultado asi, porque se puede encontrar una situaci@'on similar si hay un error en alg@'un c@'odigo de Emacs que este usando. En tales casos, ver@'a solo una l@'{@dotless{i}}nea del mensaje de error; aparecer en el @'area echo con el siguente aspecto

source: Symbol's function definition is void:@: this
es: Symbol's function definition is void:@: esto

source: The message goes away as soon as you type a key, even just to move the cursor.
es: El mensaje aparece tan pronto se presiono una tecla, aunque sólo sea para mover el cursor.

source: We know the meaning of the word @samp{Symbol}. It refers to the first atom of the list, the word @samp{this}. The word @samp{function} refers to the instructions that tell the computer what to do. (Technically, the symbol tells the computer where to find the instructions, but this is a complication we can ignore for the moment.)
es: Conocemos el significado de la palabra @samp{S@'{@dotless{i}}mbolo}. Se refiere al primer @'atomo de la lista, la palabra @samp{este}. La palabra @samp{funci@'on} se refiere a las instrucciones que dicen al ordenador que hacer. (T@'ecnicamente, el s@'{@dotless{i}}mbolo indica al ordenador donde encontrar las instrucciones, pero esta es una complicaci@'on que podemos ignorar por el momento.)

source: The error message can be understood: @samp{Symbol's function definition is void:@: this}. The symbol (that is, the word @samp{this}) lacks instructions for the computer to carry out.
es: El mensaje de error puede ser comprendido: @samp{La definici@'on del s@'{@dotless{i}}mbolo est@'a vac@'{@dotless{i}}a: este}. El s@'{@dotless{i}}mbolo (que es, la palabra @samp{este}) carece de instrucciones que el ordenador realize.

source: Symbol Names and Function Definitions
es: Nombres de s@'{@dotless{i}}mbolos y definiciones de funciones

source: Symbol names
es: Nombres de S@'{@dotless{i}}mbolos

source: We can articulate another characteristic of Lisp based on what we have discussed so far---an important characteristic: a symbol, like @code{+}, is not itself the set of instructions for the computer to carry out. Instead, the symbol is used, perhaps temporarily, as a way of locating the definition or set of instructions. What we see is the name through which the instructions can be found. Names of people work the same way. I can be referred to as @samp{Bob}; however, I am not the letters @samp{B}, @samp{o}, @samp{b} but am, or was, the consciousness consistently associated with a particular life-form. The name is not me, but it can be used to refer to me.
es: Se puede articular otra caracter@'{@dotless{i}}stica de Lisp basada en lo que se discuti@'o hace tiempo---una caracter@'{@dotless{i}}stica importante: un s@'{@dotless{i}}mbolo, como @code{+}, no es en s@'{@dotless{i}} mismo el conjunto de instrucciones que el ordenador realiza. En su lugar, el s@'{@dotless{i}}mbolo es usado, quiz@'as temporalmente, como una manera de localizar la definici@'on o conjunto de instrucciones. Lo que vemos es el nombre con el cual se pueden encontrar las instrucciones. Los nombres de las personas funcionan de la misma manera. Por ejemplo, puede referirse a mi como @samp{Bob}; sin embargo, no soy las letras @samp{B}, @samp{o}, @samp{b} pero soy, o o fu@'{@dotless{i}}, conscientemente asociado con una forma de vida particular. El nombre no soy yo, pero puede ser usado para referirme.

source: In Lisp, one set of instructions can be attached to several names. For example, the computer instructions for adding numbers can be linked to the symbol @code{plus} as well as to the symbol @code{+} (and are in some dialects of Lisp). Among humans, I can be referred to as @samp{Robert} as well as @samp{Bob} and by other words as well.
es: En Lisp, un conjunto de instrucciones puede ligarse a varios nombres. Por ejemplo, las instrucciones de ordenador para a@~nadir n@'umeros pueden ser enlazados al s@'{@dotless{i}}mbolo @code{m@'as} tan bien como el s@'{@dotless{i}}mbolo @code{+} (y se encuantran en algunos dialectos de Lisp). Entre humanos, puede referirse a @samp{Robert} tan bien como @samp{Bob} y en otras palabras tambi@'en.

source: On the other hand, a symbol can have only one function definition attached to it at a time. Otherwise, the computer would be confused as to which definition to use. If this were the case among people, only one person in the world could be named @samp{Bob}. However, the function definition to which the name refers can be changed readily. (@xref{Install, , Install a Function Definition}.)
es: Por otra parte, un s@'{@dotless{i}}mbolo puede estar ligado solo con una funci@'on a la vez. De lo contrario, el ordenador estar@'{@dotless{i}}a confundido acerca de qu@'e definici@'on usar. Si este fuera el caso, solo una persona en el mundo podr@'{@dotless{i}}a llamarse @samp{Bob}. Sin embargo, la definici@'on de funci@'on a la que el nombre hace referencia puede cambiarse f@'acilmente. (Ver @ref{Instalar, , Instalar una Definici@'on de Funci@'on}.)

source: Since Emacs Lisp is large, it is customary to name symbols in a way that identifies the part of Emacs to which the function belongs. Thus, all the names for functions that deal with Texinfo start with @samp{texinfo-} and those for functions that deal with reading mail start with @samp{rmail-}.
es: Ya que Emacs Lisp es extenso, se acostumbra nombrar los s@'{@dotless{i}}mbolos de un modo que pueda establecerse a que parte de Emacs pertenece la funci@'on. En consecuencia, todos los nombres de funciones relacionadas con Texinfo empiezan con @samp{texinfo-} y aquellas relaciondas con la lectura de correo empiezan con @samp{rmail-}.

source: Lisp interpreter, what it does
es: Int@'erprete Lisp, qu@'e hace

source: Interpreter, what it does
es: Int@'erprete, qu@'e hace

source: Based on what we have seen, we can now start to figure out what the Lisp interpreter does when we command it to evaluate a list. First, it looks to see whether there is a quote before the list; if there is, the interpreter just gives us the list. On the other hand, if there is no quote, the interpreter looks at the first element in the list and sees whether it has a function definition. If it does, the interpreter carries out the instructions in the function definition. Otherwise, the interpreter prints an error message.
es: Basado en lo que se ha visto, ahora podemos empezar a entender lo que el int@'eprete Lisp hace cuando mandamos a evaluar una lista. Primero, examina si hay un s@'{@dotless{i}}mbolo cita antes de la lista; si lo hay, el int@'erprete nos da la lista. Por otro lado, si no hay cita, el int@'eprete mira si el primer elemento en la lista tiene una definici@'on de funci@'on. Si no, el int@'erprete imprime un mensaje de error.
