Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The @code{#(} begins a list. The first element of the list is the string itself, just one @samp{-}. The second and third elements specify the range over which the fourth element applies. A range starts @emph{after} a character, so a zero means the range starts just before the first character; a 1 means that the range ends just after the first character. The third element is the property for the range. It consists of a property list, a property name, in this case, @samp{help-echo}, followed by a value, in this case, a string. The second, third, and fourth elements of this new string format can be repeated.
es: El @code{#(} empieza una lista. El primer elemento de la lista es la cadena en s@'{@dotless{i}}, solo un @samp{-}. El segundo y tercer elemento especifica el rango a trav@'es del cuarto elemento aplicado. Un rango empieza @emph{despu@'es} un car@'acter, as@'{@dotless{i}} un cero significa el rango que empieza solo despu@'es del primer caracter; un 1 significa que el rango finaliza solo despu@'es del primer caracter. El tercer elemento es la propiedad para el rango. Eso consiste en una lista de propiedades, un nombre de propiedad, en este caso, @samp{help-echo}, seguido por un valor, en este caso, una cadena. El segundo, tercer y cuarto elemento de este nuevo formato de cadena puede ser repetido.

source: @xref{Text Properties, , Text Properties, elisp, The GNU Emacs Lisp Reference Manual}, and see @ref{Mode Line Format, , Mode Line Format, elisp, The GNU Emacs Lisp Reference Manual}, for more information.
es: @xref{Propiedades de Texto, , Propiedades de Texto, elisp, El Manual de Referencia de GNU Emacs Lisp}, y ver @ref{Formato Mode Line, , Formato Mode Line, elisp, El Manual de Referencia de GNU Emacs Lisp}, para m@'as informaci@'on.

source: @code{mode-line-buffer-identification} displays the current buffer name. It is a list beginning @code{(#("%12b" 0 4 @dots{}}. The @code{#(} begins the list.
es: @code{mode-line-buffer-identification} muestra el nombre del buffer. Eso es una lista empezando por @code{(#("%12b" 0 4 @dots{}}. El @code{#(} empieza la lista.

source: The @samp{"%12b"} displays the current buffer name, using the @code{buffer-name} function with which we are familiar; the `12' specifies the maximum number of characters that will be displayed. When a name has fewer characters, whitespace is added to fill out to this number. (Buffer names can and often should be longer than 12 characters; this length works well in a typical 80 column wide window.)
es: El @samp{"%12b"} muestra el nombre del actual b@'uffer, usando la funci@'on @code{buffer-name} con la que estamos familiarizados; el `12' especifica el n@'umero m@'aximo de caracteres que ser@'an mostrados. Cuando un nombre tiene pocos caracteres, el espacio en blanco se a@~nade para rellenar este n@'umero. (Los nombres del b@'uffer puede y con frecuencia ser@'an m@'as largos de 12 caracteres; esta longitud funciona bien en la t@'{@dotless{i}}pica ventana de 80 columnas de ancho.)

source: @code{:eval} says to evaluate the following form and use the result as a string to display. In this case, the expression displays the first component of the full system name. The end of the first component is a @samp{.} (`period'), so I use the @code{string-match} function to tell me the length of the first component. The substring from the zeroth character to that length is the name of the machine.
es: @code{:eval} dice evaluar la siguiente forma y usa el resultado como una cadena para mostrarse. En este caso, la expresi@'on muestra el primer componente del sistema completo. El fin del primer componente es un @samp{.} (`periodo'), as@'{@dotless{i}} se usa la funci@'on @code{string-match} para contar el tama@~no del primer componente. La subcadena desde el caracter cero a este tama@~no del primer componente. La subcadena desde el caracter cero a este tama@~no es el nombre de la m@'aquina.

source: This is the expression:
es: Esta es la expresi@'on:

source: @samp{%[} and @samp{%]} cause a pair of square brackets to appear for each recursive editing level. @samp{%n} says `Narrow' when narrowing is in effect. @samp{%P} tells you the percentage of the buffer that is above the bottom of the window, or `Top', `Bottom', or `All'. (A lower case @samp{p} tell you the percentage above the @emph{top} of the window.) @samp{%-} inserts enough dashes to fill out the line.
es: @samp{%[} y @samp{%]} causa un par de corchetes que aparezcan por cada edici@'on nivel de edici@'on recursiva editando el nivel. @samp{%n} dice `Encoger' cuando esto puede hacerse. @samp{%P} te cuenta el porcentaje del b@'uffer que est@'a debajo de la ventana, o `arriba', `abajo', o `todo'. (Una min@'uscula @samp{p} cuenta el porcentaje bajo el alto de la ventana.) @samp{%-} inserta suficientes guiones para rellenar la l@'{@dotless{i}}nea.

source: Remember, ``You don't have to like Emacs to like it''---your own Emacs can have different colors, different commands, and different keys than a default Emacs.
es: Recuerda, ``No tiene que gustarte Emacs para que le gustes'' --- Emacs puede tener diferentes colores, diferentes comandos, y diferentes teclas que un Emacs por defecto.

source: On the other hand, if you want to bring up a plain `out of the box' Emacs, with no customization, type:
es: Por otro lado, si se quiere traer un plano `fuera de la caja' Emacs, sin personalizaci@'on, escribe:

source: This will start an Emacs that does @emph{not} load your @file{~/.emacs} initialization file. A plain, default Emacs. Nothing more.
es: Esto inicializar@'a un Emacs que @emph{no} cargue tu @file{~/.emacs} fichero de inicializaci@'on. Uno plano, el que trae Emacs por defecto. Nada m@'as.

source: debugging
es: depurando

source: GNU Emacs has two debuggers, @code{debug} and @code{edebug}. The first is built into the internals of Emacs and is always with you; the second requires that you instrument a function before you can use it.
es: GNU Emacs tiene dos depuradores, @code{debug} y @code{edebug}. El primero es construido dentro de las tripas de Emacs y est@'a siempre contigo; el segundo requiere que exista una funci@'on antes de que se pueda usar.

source: Both debuggers are described extensively in @ref{Debugging, , Debugging Lisp Programs, elisp, The GNU Emacs Lisp Reference Manual}. In this chapter, I will walk through a short example of each.
es: Ambos depuradores son descritos extensivamente en @ref{Depurando, , Depurando Programas Lisp, elisp, El Manual de Referencia GNU Emacs Lisp}. En este cap@'{@dotless{i}}tulo, se explicar@'a un breve ejemplo de esto.

source: Suppose you have written a function definition that is intended to return the sum of the numbers 1 through a given number. (This is the @code{triangle} function discussed earlier. @xref{Decrementing Example, , Example with Decrementing Counter}, for a discussion.)
es: Sup@'on que se ha escrito una definici@'on de funci@'on que se pretende devolver la suma de los n@'umeros 1 a trav@'es de un n@'umero dado. (Esta es la funci@'on @code{triangle} discutida pronto. @xref{Ejemplo de Decremento, , Ejemplo con Contador de Decremento}, para una discusi@'on.)

source: However, your function definition has a bug. You have mistyped @samp{1=} for @samp{1-}. Here is the broken definition:
es: Sin embargo, tu definici@'on de funci@'on tiene un error. Se ha malescrito @samp{1=} por @samp{1-}. Aqu@'{@dotless{i}} est@'a la definici@'on rota:

source: (defun triangle-bugged (number) "Return sum of numbers 1 through NUMBER inclusive." (let ((total 0)) (while (> number 0) (setq total (+ total number)) (setq number (1= number))) ; @r{Error here.} total))
es: (defun triangle-bugged (number) "Devuelve suma de n@'umeros 1 a trav@'es de NUMBER inclusive." (let ((total 0)) (while (> number 0) (setq total (+ total number)) (setq number (1= number))) ; @r{Error aqu@'{@dotless{i}}.} total))

source: If you are reading this in Info, you can evaluate this definition in the normal fashion. You will see @code{triangle-bugged} appear in the echo area.
es: Si se est@'a leyendo esto en Info, se puede evaluar esta definici@'on en el modo normal. Se ver@'a que @code{triangle-bugged} aparece en el @'area echo.

source: Now evaluate the @code{triangle-bugged} function with an argument of 4:
es: Ahora eval@'ua la funci@'on @code{triangle-bugged} con un argumento de 4:

source: In a recent GNU Emacs, you will create and enter a @file{*Backtrace*} buffer that says:
es: En un GNU Emacs reciente, se crear@'a e introducir@'a un b@'uffer @file{*Backtrace*} que dice:

source: (I have reformatted this example slightly; the debugger does not fold long lines. As usual, you can quit the debugger by typing @kbd{q} in the @file{*Backtrace*} buffer.)
es: (Se ha reformateado este ejemplo ligeramente; el depurador no contiene muchas l@'{@dotless{i}}neas. As@'{@dotless{i}}, se puede salir del depurador escribiendo @kbd{q} en el buffer @file{*Backtrace*}.)

source: In practice, for a bug as simple as this, the `Lisp error' line will tell you what you need to know to correct the definition. The function @code{1=} is `void'.
es: En la pr@'actica, debido a un error tan simple como este, la l@'{@dotless{i}}nea de `error Lisp' explica lo que se necesita saber para corregir la definici@'on. La funci@'on @code{1=} est@'a `vac@'{@dotless{i}}a'.

source: Symbol's function definition is void:@: 1=
es: La definici@'on de la funci@'on est@'a vac@'{@dotless{i}}o:@: 1=

source: However, suppose you are not quite certain what is going on? You can read the complete backtrace.
es: Sin embargo, si no se conoce con bastante certeza lo que est@'a pasando, se puede leer la traza completa.

source: In this case, you need to run a recent GNU Emacs, which automatically starts the debugger that puts you in the @file{*Backtrace*} buffer; or else, you need to start the debugger manually as described below.
es: En este caso, se necesita ejecutar una versi@'on reciente de GNU Emacs, que autom@'aticamente empieza el depurador que pone en el b@'uffer @file{*Backtrace*}; o adem@'as, se necesita para empezar el depurador manualmente como se describe debajo.

source: Read the @file{*Backtrace*} buffer from the bottom up; it tells you what Emacs did that led to the error. Emacs made an interactive call to @kbd{C-x C-e} (@code{eval-last-sexp}), which led to the evaluation of the @code{triangle-bugged} expression. Each line above tells you what the Lisp interpreter evaluated next.
es: Lee el b@'uffer @file{*Backtrace*} de abajo a arriba; eso cuenta lo que le hizo a Emacs tener un error. Emacs hace una llamada interactiva a @kbd{C-x C-e} (@code{eval-last-sexp}), que lleva a la evaluaci@'on de la expresi@'on @code{triangle-bugged}. Cada l@'{@dotless{i}}nea de debajo cuenta lo que el int@'erprete Lisp evalu@'o.

source: The third line from the top of the buffer is
es: La tercera l@'{@dotless{i}}nea desde lo alto del b@'uffer es

source: Emacs tried to evaluate this expression; in order to do so, it tried to evaluate the inner expression shown on the second line from the top:
es: Emacs intent@'o evaluar esta expresi@'on; para hacerlo as@'{@dotless{i}}, se intent@'o evaluar la expresi@'on interna para ser mostrada en la segunda l@'{@dotless{i}}nea desde arriba:

source: This is where the error occurred; as the top line says:
es: Aqu@'{@dotless{i}} es donde el error ocurre; como se dice en la l@'{@dotless{i}}nea de arriba:

source: You can correct the mistake, re-evaluate the function definition, and then run your test again.
es: Se puede corregir el error, reeval@'ua la definici@'on de funci@'on, y entonces se puede testear de nuevo.

source: A recent GNU Emacs starts the debugger automatically when your function has an error.
es: Un GNU Emacs actual abre el depurador autom@'aticamente cuando la funci@'on tiene un error.

source: Incidentally, you can start the debugger manually for all versions of Emacs; the advantage is that the debugger runs even if you do not have a bug in your code. Sometimes your code will be free of bugs!
es: Incidentalmente, se puede empezar el depurador manualmente para todas las versiones de Emacs; la ventaja es que el depurador se ejecuta incluso si no se tiene un error en su c@'odigo. Algunas veces, @exclamdown{}su c@'odigo estar@'a libre de errores!

source: You can enter the debugger when you call the function by calling @code{debug-on-entry}.
es: Se puede introducir el depurador cuando se llama a la funci@'on llamando @code{debug-on-entry}.

source: Type:
es: Tipo:

source: Now, evaluate the following:
es: Ahora, eval@'ua lo siguiente:

source: All versions of Emacs will create a @file{*Backtrace*} buffer and tell you that it is beginning to evaluate the @code{triangle-bugged} function:
es: Todas las versiones de Emacs crear@'an un b@'uffer @file{*Backtrace*} y cuenta tu que eso es el principio para evaluar la funci@'on @code{triangle-bugged}:

source: In the @file{*Backtrace*} buffer, type @kbd{d}. Emacs will evaluate the first expression in @code{triangle-bugged}; the buffer will look like this:
es: En el b@'uffer @file{*Backtrace*}, escribe @kbd{d}. Emacs evaluar@'a la primera expresi@'on en @code{triangle-bugged}; el b@'uffer se parece a esto:

source: Now, type @kbd{d} again, eight times, slowly. Each time you type @kbd{d}, Emacs will evaluate another expression in the function definition.
es: Ahora, escribe @kbd{d} de nuevo, ocho veces, lentamente. Cada vez que se escribe @kbd{d} Emacs evaluar@'a otra expresi@'on en la definici@'on de funci@'on.

source: Eventually, the buffer will look like this:
es: Eventualmente, el b@'uffer se parece a esto:

source: Finally, after you type @kbd{d} two more times, Emacs will reach the error, and the top two lines of the @file{*Backtrace*} buffer will look like this:
es: Finalmente, despu@'es se escribe @kbd{d} dos veces m@'as, Emacs lograr@'a el error y las dos l@'{@dotless{i}}neas superiores del buffer @file{*Backtrace*} se ve as@'{@dotless{i}}:

source: By typing @kbd{d}, you were able to step through the function.
es: Escribiendo @kbd{d}, ser@'{@dotless{i}}a capaz de pasear a trav@'es de la funci@'on.

source: You can quit a @file{*Backtrace*} buffer by typing @kbd{q} in it; this quits the trace, but does not cancel @code{debug-on-entry}.
es: Se puede salir de un buffer @file{*Backtrace*} escribiendo @kbd{q}; esto se sale de la traza, pero no cancela @code{debug-on-entry}.

source: To cancel the effect of @code{debug-on-entry}, call @code{cancel-debug-on-entry} and the name of the function, like this:
es: Para cancelar el efecto de @code{debug-on-entry}, llama a @code{cancel-debug-on-entry} y el nombre de la funci@'on, como esto:

source: (If you are reading this in Info, cancel @code{debug-on-entry} now.)
es: (Si est@'a leyendo esto en Info, cancela @code{debug-on-entry} ahora.)

source: @code{debug-on-quit} and @code{(debug)}
es: @code{debug-on-quit} y @code{(debug)}

source: In addition to setting @code{debug-on-error} or calling @code{debug-on-entry}, there are two other ways to start @code{debug}.
es: Adici@'on a la configuraci@'on @code{debug-on-error} o llamando @code{debug-on-entry}, hay otros dos caminos para empezar @code{debug}.

source: You can start @code{debug} whenever you type @kbd{C-g} (@code{keyboard-quit}) by setting the variable @code{debug-on-quit} to @code{t}. This is useful for debugging infinite loops.
es: Se puede empezar @code{debug} siempre y cuando se escribe @kbd{C-g} (@code{keyboard-quit}) se configura la variable @code{debug-on-quit} para @code{t}. Esto es @'util para depurar bucles infinitos.

source: @code{(debug)} in code
es: @code{(debug)} en c@'odigo

source: Or, you can insert a line that says @code{(debug)} into your code where you want the debugger to start, like this:
es: O, se puede insertar un l@'{@dotless{i}}nea que dice @code{(debug)} dentro de tu c@'odigo donde se quiere que el depurador empiece, as@'{@dotless{i}}:

source: (defun triangle-bugged (number) "Return sum of numbers 1 through NUMBER inclusive." (let ((total 0)) (while (> number 0) (setq total (+ total number)) (debug) ; @r{Start debugger.} (setq number (1= number))) ; @r{Error here.} total))
es: (defun triangle-bugged (number) "Devuelve suma de n@'umeros 1 a trav@'es de NUMERO inclusive." (let ((total 0)) (while (> number 0) (setq total (+ total number)) (debug) ; @r{Empieza el depurador.} (setq number (1= number))) ; @r{Error aqu@'{@dotless{i}}.} total))

source: The @code{debug} function is described in detail in @ref{Debugger, , The Lisp Debugger, elisp, The GNU Emacs Lisp Reference Manual}.
es: La funci@'on @code{debug} se describe en detalle en @ref{Depurador, , El Depurador Lisp, elisp, El Manual de Referencia GNU Emacs Lisp}.

source: The @code{edebug} Source Level Debugger
es: El depurador de nivel de fuentes @code{edebug}

source: Source level debugger
es: Depurador de nivel de c@'odigo

source: Edebug is a source level debugger. Edebug normally displays the source of the code you are debugging, with an arrow at the left that shows which line you are currently executing.
es: Edebug es un depurador a nivel de fuentes Edebug que normalmente muestra las fuentes del c@'odigo que se est@'a depurando, con una flecha a la izquierda que muestra que l@'{@dotless{i}}nea se est@'a actualmente ejecutando.

source: You can walk through the execution of a function, line by line, or run quickly until reaching a @dfn{breakpoint} where execution stops.
es: Se puede pasear a trav@'es de la ejecuci@'on de una funci@'on, l@'{@dotless{i}}nea a l@'{@dotless{i}}nea, o ejecutarse r@'apidamente hasta lograr un @dfn{punto de ruptura} donde la ejecuci@'on pare.

source: Edebug is described in @ref{edebug, , Edebug, elisp, The GNU Emacs Lisp Reference Manual}.
es: Edebug se describe en @ref{edebug, , Edebug, elisp, El Manual de Referencia de GNU Emacs Lisp}.

source: Here is a bugged function definition for @code{triangle-recursively}. @xref{Recursive triangle function, , Recursion in place of a counter}, for a review of it.
es: Aqu@'{@dotless{i}} hay una funci@'on con errores para @code{triangle-recursively}. @xref{Funci@'on recursiva tri@'angulo, , Recursi@'on en lugar de un contador}, para una revisi@'on de eso.

source: (defun triangle-recursively-bugged (number) "Return sum of numbers 1 through NUMBER inclusive. Uses recursion." (if (= number 1) 1 (+ number (triangle-recursively-bugged (1= number))))) ; @r{Error here.}
es: (defun triangle-recursively-bugged (number) "Devuelve la suma of n@'umeros 1 a trav@'es de NUMBER inclusive. Usa recursi@'on." (if (= number 1) 1 (+ number (triangle-recursively-bugged (1= number))))) ; @r{Error aqu@'{@dotless{i}}.}

source: Normally, you would install this definition by positioning your cursor after the function's closing parenthesis and typing @kbd{C-x C-e} (@code{eval-last-sexp}) or else by positioning your cursor within the definition and typing @kbd{C-M-x} (@code{eval-defun}). (By default, the @code{eval-defun} command works only in Emacs Lisp mode or in Lisp Interaction mode.)
es: Normalmente, se instalar@'{@dotless{i}}a esta definici@'on posicionando su cursor despu@'es de la funci@'on cerrando par@'entesis y escribiendo @kbd{C-x C-e} (@code{eval-last-sexp}) o lo dem@'as posicionando tu cursor con la definici@'on y escribiendo @kbd{C-M-x} (@code{eval-defun}). (Por defecto, el comando @code{eval-defun} funciona solo en modo Emacs Lisp o en el modo de interacci@'on de Lisp.)

source: However, to prepare this function definition for Edebug, you must first @dfn{instrument} the code using a different command. You can do this by positioning your cursor within or just after the definition and typing
es: Sin embargo, para preparar esta definici@'on de funci@'on para Edebug, se debe primero @dfn{instrumentar} el c@'odigo usando un comando diferente. Se puede hacer esto posicionando el cursor dentro o despu@'es de la definici@'on y escribiendo

source: This will cause Emacs to load Edebug automatically if it is not already loaded, and properly instrument the function.
es: Esto causar@'a que Emacs cargue Edebug autom@'aticamente si eso no est@'a ya cargado y, apropiadamente prepara la funci@'on.

source: After instrumenting the function, place your cursor after the following expression and type @kbd{C-x C-e} (@code{eval-last-sexp}):
es: Despu@'es de preparar la funci@'on, emplaza tu cursor despu@'es de la siguiente expresi@'on y escribe @kbd{C-x C-e} (@code{eval-last-sexp}):

source: You will be jumped back to the source for @code{triangle-recursively-bugged} and the cursor positioned at the beginning of the @code{if} line of the function. Also, you will see an arrowhead at the left hand side of that line. The arrowhead marks the line where the function is executing. (In the following examples, we show the arrowhead with @samp{=>}; in a windowing system, you may see the arrowhead as a solid triangle in the window `fringe'.)
es: Se vuelve a las fuentes de @code{triangle-recursively-bugged} y el cursor se posiciona al principio del @code{if} de la l@'{@dotless{i}}nea de la funci@'on. Tambi@'en, se ver@'a una flecha en la mano izquierda al lado de esta l@'{@dotless{i}}nea donde la funci@'on se est@'a ejecutando. (En los siguientes ejemplos, se muestra la flecha con @samp{=>}; en un sistema de ventanas, se puede ver la flecha como un tri@'angulo s@'olido en el `borde' de la ventana.)

source: In the example, the location of point is displayed with a star, @samp{@point{}} (in Info, it is displayed as @samp{-!-}).
es: En el ejemplo, la posici@'on del punto es mostrado con una estrella, @samp{@point{}} (en Info, eso es mostrado como @samp{-!-}).

source: In the example, the location of point is displayed as @samp{@point{}} (in a printed book, it is displayed with a five pointed star).
es: En el ejemplo, la localizaci@'on del punto es mostrado como @samp{@point{}} (en un libro impreso, eso es mostrado con una estrella apuntada).

source: If you now press @key{SPC}, point will move to the next expression to be executed; the line will look like this:
es: Si ahora se presiona @key{SPC}, el punto se mover@'a a la siguiente expresi@'on para ejecutarse; la l@'{@dotless{i}}nea se parece a esto:

source: As you continue to press @key{SPC}, point will move from expression to expression. At the same time, whenever an expression returns a value, that value will be displayed in the echo area. For example, after you move point past @code{number}, you will see the following:
es: Como se continua presionando @key{SPC}, el puntero se mover@'a desde la expresi@'on a la expresi@'on. Al mismo tiempo, siempre y cuando una expresi@'on devuelva un valor, este valor ser@'a mostrado en el @'area echo. Por ejemplo, despu@'es de mover el punto pasado @code{number}, se ver@'a lo siguiente:

source: Result: 3 (#o3, #x3, ?\C-c)
es: Resultado: 3 (#o3, #x3, ?\C-c)

source: This means the value of @code{number} is 3, which is octal three, hexadecimal three, and @sc{ascii} `control-c' (the third letter of the alphabet, in case you need to know this information).
es: Esto significa el valor de @code{number} es 3, que son tres octales, tres hexadecimales, y @sc{ascii} `control-c' (la tercera letra del alfabeto, en caso de que se necesite conocer esta informaci@'on).

source: You can continue moving through the code until you reach the line with the error. Before evaluation, that line looks like this:
es: Uno puede continuar movi@'endose a trav@'es del c@'odigo hasta que logre la l@'{@dotless{i}}nea con el error. Antes de la evaluaci@'on, esta l@'{@dotless{i}}nea se parece a esto:

source: => @point{}(1= number))))) ; @r{Error here.}
es: => @point{}(1= number))))) ; @r{Error aqu@'{@dotless{i}}.}

source: When you press @key{SPC} once again, you will produce an error message that says:
es: Cuando se presiona @key{SPC} una vez de nuevo, se producir@'a un mensaje de error que dice:
