Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: insert-rectangle: Insert text of RECTANGLE with upper left corner at point. RECTANGLE's first line is inserted at point, its second line is inserted at a point vertically under point, etc. RECTANGLE should be a list of strings. After this command, the mark is at the upper left corner and point is at the lower right corner.
es: insert-rectangle: Insertar texto de RECTANGLE con la esquina izquierda a punto La primera l@'{@dotless{i}}nea de RECTANGLE es insertada al punto su segunda l@'{@dotless{i}}nea es insertada a un punto verticalmente bajo el punto, etc. El RECTANGLE deber@'{@dotless{i}}a ser una lista de cadenas. Despu@'es de este comando, la marca est@'a en la esquina izquierda superior y el punto en la esquina derecha inferior.

source: We can run a quick test, to make sure it does what we expect of it.
es: Se puede ejecutar un test r@'apido, para asegurar que hace lo que se espera de eso.

source: Here is the result of placing the cursor after the @code{insert-rectangle} expression and typing @kbd{C-u C-x C-e} (@code{eval-last-sexp}). The function inserts the strings @samp{"first"}, @samp{"second"}, and @samp{"third"} at and below point. Also the function returns @code{nil}.
es: Aqu@'{@dotless{i}} est@'a el resultado de emplazar el cursor despu@'es de la expresi@'on @code{insert-rectangle} y escribiendo @kbd{C-u C-x C-e} (@code{eval-last-sexp}). La funci@'on inserta las cadenas @samp{"primero"}, @samp{"segundo"}, y @samp{"tercero"} en el punto. Tambi@'en la funci@'on devuelve @code{nil}.

source: (insert-rectangle '("first" "second" "third"))first second thirdnil
es: (insert-rectangle '("primero" "segundo" "tercer"))primero segundo terceronil

source: Of course, we won't be inserting the text of the @code{insert-rectangle} expression itself into the buffer in which we are making the graph, but will call the function from our program. We shall, however, have to make sure that point is in the buffer at the place where the @code{insert-rectangle} function will insert its column of strings.
es: De acuerdo, no se inserta el texto de la expresi@'on @code{insert-rectangle} en s@'{@dotless{i}} dentro del b@'uffer en el que se marca el grafo, pero se llamar@'a la funci@'on de nuestro programa. Nosotros, sin embargo, tenemos que asegurar que el punto est@'a en el b@'uffer en el lugar donde la funci@'on @code{insert-rectangle} insertar@'a la columna de cadenas.

source: If you are reading this in Info, you can see how this works by switching to another buffer, such as the @file{*scratch*} buffer, placing point somewhere in the buffer, typing @kbd{M-:}, typing the @code{insert-rectangle} expression into the minibuffer at the prompt, and then typing @key{RET}. This causes Emacs to evaluate the expression in the minibuffer, but to use as the value of point the position of point in the @file{*scratch*} buffer. (@kbd{M-:} is the keybinding for @code{eval-expression}. Also, @code{nil} does not appear in the @file{*scratch*} buffer since the expression is evaluated in the minibuffer.)
es: Si se est@'a leyendo esto en Info, se puede ver como este trabajo cambia a otro b@'uffer, tal como el b@'uffer @file{*scratch*}, emplazando el punto a alg@'un lugar en el b@'uffer, se escribe @kbd{M-:}, despu@'es se escribe la expresi@'on @code{insert-rectangle} dentro del minib@'uffer en la consola, y entonces se escribe @key{RET}. Esto causa que Emacs eval@'ue la expresi@'on en el minib@'uffer, pero usa como el valor del punto la posici@'on del punto en el b@'uffer @file{*scratch*}. (@kbd{M-:} es el atajo para @code{eval-expression}. @code{nil} tampoco aparece en el b@'uffer @file{*scratch*} desde que la expresi@'on se eval@'ua en el minib@'uffer.)

source: We find when we do this that point ends up at the end of the last inserted line---that is to say, this function moves point as a side-effect. If we were to repeat the command, with point at this position, the next insertion would be below and to the right of the previous insertion. We don't want this! If we are going to make a bar graph, the columns need to be beside each other.
es: Se encuentra cuando hacer esto hasta el punto que finaliza al fin de la @'ultima l@'{@dotless{i}}nea insertada --- es decir, esta funci@'on mueve el punto como un efecto lateral. Si se iba a repetir el comando, con el punto en esta posici@'on, la siguiente inserci@'on ser@'{@dotless{i}}a debajo y a la derecha de la inserci@'on previa. @exclamdown{}Nosotros no queremos esto!. Si se est@'a yendo a crear un gr@'afico de barras, las columnas necesitan estar debajo unas de otras.

source: So we discover that each cycle of the column-inserting @code{while} loop must reposition point to the place we want it, and that place will be at the top, not the bottom, of the column. Moreover, we remember that when we print a graph, we do not expect all the columns to be the same height. This means that the top of each column may be at a different height from the previous one. We cannot simply reposition point to the same line each time, but moved over to the right---or perhaps we can@dots{}
es: As@'{@dotless{i}} se descubre que cada ciclo del bucle @code{while} de column-inserting debe reposicionar el punto al lugar que queremos, y este lugar estar@'a arriba, no abajo, de la columna. M@'as all@'a, se recuerda que cuando se imprime un grafo, no esperan todas las columnas para estar a la misma altura. Esto significa que el alto de cada columna puede estar a una altura diferente desde una previa. Nosotros simplemente reposicionamos el punto a la misma l@'{@dotless{i}}nea cada vez, pero movido cubriendo a la derecha --- o quiz@'as se puede @dots{}

source: We are planning to make the columns of the bar graph out of asterisks. The number of asterisks in the column is the number specified by the current element of the @code{numbers-list}. We need to construct a list of asterisks of the right length for each call to @code{insert-rectangle}. If this list consists solely of the requisite number of asterisks, then we will have position point the right number of lines above the base for the graph to print correctly. This could be difficult.
es: Estamos planeando crear las columnas de la barra gr@'afica sin asteriscos. El n@'umero de asteriscos en la columna es el n@'umero espec@'{@dotless{i}}fico por el elemento actual del @code{numbers-list}. Necesitamos construir una lista de asteriscos del tama@~no derecho para cada llamada a @code{insert-rectangle}. Si esta lista consiste @'unicamente del n@'umero requerido de asteriscos, entonces tendremos la posici@'on de punto el n@'umero correcto de l@'{@dotless{i}}neas bajo la base del gr@'afico para imprimirse correctamente. Esto podr@'{@dotless{i}}a ser dif@'{@dotless{i}}cil.

source: Alternatively, if we can figure out some way to pass @code{insert-rectangle} a list of the same length each time, then we can place point on the same line each time, but move it over one column to the right for each new column. If we do this, however, some of the entries in the list passed to @code{insert-rectangle} must be blanks rather than asterisks. For example, if the maximum height of the graph is 5, but the height of the column is 3, then @code{insert-rectangle} requires an argument that looks like this:
es: Alternativamente, si podemos figurarnos alg@'un camino para pasar @code{insert-rectangle} del mismo tama@~no cada vez, entonces podemos posicionar el punto en la misma l@'{@dotless{i}}nea cada vez, pero se mueve a trav@'es de una columna a la derecha por cada nueva columna. Si hacemos esto, sin embargo, alguna de las entradas en la lista pasaba a @code{insert-rectangle} y deben ser espacios en blanco en vez de asteriscos. Por ejemplo, si la altura m@'axima del grafo es 5, pero la altura de la columna es 3, entonces @code{insert-rectangle} requiere un argumento que se parezca a esto:

source: This last proposal is not so difficult, so long as we can determine the column height. There are two ways for us to specify the column height: we can arbitrarily state what it will be, which would work fine for graphs of that height; or we can search through the list of numbers and use the maximum height of the list as the maximum height of the graph. If the latter operation were difficult, then the former procedure would be easiest, but there is a function built into Emacs that determines the maximum of its arguments. We can use that function. The function is called @code{max} and it returns the largest of all its arguments, which must be numbers. Thus, for example,
es: Esta @'ultima propuesta no es tan dif@'{@dotless{i}}cil, de hecho se puede determinar la altura de la columna. Hay dos caminos para nosotros especificar la altura de la columna: se puede arbitrariamente situar lo que ser@'a, lo que funcionar@'{@dotless{i}}a bien para gr@'aficas de esta altura; o podemos buscar a trav@'es de la lista de n@'umeros y usar la altura m@'axima de la lista como la altura m@'axima del grafo. Si la @'ultima operaci@'on fuera dif@'{@dotless{i}}cil, entonces el procedimiento formal ser@'{@dotless{i}}a f@'acil, pero hay una funci@'on construida en Emacs para determinar el m@'aximo de sus argumentos. Se puede usar esta funci@'on. La funci@'on se llamaba @code{max} y eso devuelve el mayor de sus argumentos, que deben ser n@'umeros. De este modo, por ejemplo,

source: returns 7. (A corresponding function called @code{min} returns the smallest of all its arguments.)
es: devuelve 7. (Una funci@'on correspondiente llamada @code{min} devuelve lo m@'as peque@~no de todos sus argumentos.)

source: However, we cannot simply call @code{max} on the @code{numbers-list}; the @code{max} function expects numbers as its argument, not a list of numbers. Thus, the following expression,
es: Sin embargo, no podemos simplemente llama a @code{max} en el @code{numbers-list}; la funci@'on @code{max} espera n@'umeros como sus argumentos, no una lista de n@'umeros. De este modo, la siguiente expresi@'on,

source: produces the following error message;
es: produce el siguiente mensaje error;

source: Wrong type of argument: number-or-marker-p, (3 4 6 5 7 3)
es: Mal tipo de argumento: number-or-marker-p, (3 4 6 5 7 3)

source: We need a function that passes a list of arguments to a function. This function is @code{apply}. This function `applies' its first argument (a function) to its remaining arguments, the last of which may be a list.
es: Se necesita una funci@'on que pasa una lista de argumentos a una funci@'on. Esta funci@'on es @code{apply}. Esta funci@'on `aplica' su primer argumento (una funci@'on) para los argumentos que permanecen, el @'ultimo puede ser una lista.

source: returns 8.
es: devuelve 8

source: (Incidentally, I don't know how you would learn of this function without a book such as this. It is possible to discover other functions, like @code{search-forward} or @code{insert-rectangle}, by guessing at a part of their names and then using @code{apropos}. Even though its base in metaphor is clear---`apply' its first argument to the rest---I doubt a novice would come up with that particular word when using @code{apropos} or other aid. Of course, I could be wrong; after all, the function was first named by someone who had to invent it.)
es: (Incidentalmente, yo no sabr@'{@dotless{i}}a c@'omo aprender acerca de esta funci@'on sin un libro tal como este. Eso es posible descubrir otras funciones, como @code{search-forward} o @code{insert-rectangle}, adivinando una parte de sus nombres y entonces usando @code{apropos}. Incluso aunque su base metaf@'orica es clara --- `apply' su primer argumento al resto --- dudo que un novicio vendr@'{@dotless{i}}a con esta palabra particular usando @code{apropos} u otra ayuda. De acuerdo, podr@'{@dotless{i}}a ser incorrecto; despu@'es de todo, la funci@'on fu@'e primero llamada por alguien quien lo hab@'{@dotless{i}}a inventado.

source: The second and subsequent arguments to @code{apply} are optional, so we can use @code{apply} to call a function and pass the elements of a list to it, like this, which also returns 8:
es: El segundo y subsiguientes argumentos para @code{apply} son opcionales, as@'{@dotless{i}} se puede usar @code{apply} para llamar a una funci@'on y pasan los elementos de una lista, como este, que tambi@'en devuelve 8:

source: This latter way is how we will use @code{apply}. The @code{recursive-lengths-list-many-files} function returns a numbers' list to which we can apply @code{max} (we could also apply @code{max} to the sorted numbers' list; it does not matter whether the list is sorted or not.)
es: Este camino tard@'{@dotless{i}}o usar@'a @code{apply}. La funci@'on @code{recursive-lengths-list-many-files} devuelve una lista de n@'umeros que se puede aplicar a @code{max} (se podr@'{@dotless{i}}a tambi@'en aplicar @emph{(hacer apply)} a la lista de n@'umeros ordenados; eso no importa si la lista est@'a o no).

source: Hence, the operation for finding the maximum height of the graph is this:
es: Aqu@'{@dotless{i}}, la operaci@'on para encontrar el tama@~no m@'aximo del grafo es este:

source: Now we can return to the question of how to create a list of strings for a column of the graph. Told the maximum height of the graph and the number of asterisks that should appear in the column, the function should return a list of strings for the @code{insert-rectangle} command to insert.
es: Ahora se puede devolver la pregunta de como crear una lista de cadenas para una columna del grafo. Cuenta la m@'axima altura del grafo y el n@'umero de asteriscos que aparecer@'{@dotless{i}}an en la columna, la funci@'on devolver@'a una lista de cadenas para el comando a insertar @code{insert-rectangle}.

source: Each column is made up of asterisks or blanks. Since the function is passed the value of the height of the column and the number of asterisks in the column, the number of blanks can be found by subtracting the number of asterisks from the height of the column. Given the number of blanks and the number of asterisks, two @code{while} loops can be used to construct the list:
es: Cada columna se realiza con asteriscos o espacios en blanco. Puesto que la funci@'on pasa el valor del alto de la columna y el n@'umero de asteriscos en el columna, el n@'umero de espacios en blanco puede ser encontrado sustrayendo el n@'umero de asteriscos desde lo alto de la columna. Dado el n@'umero de espacios en blanco y el n@'umero de asteriscos, dos bucles @code{while} puede ser usado para construir la lista:

source: ;;; @r{First version.} (defun column-of-graph (max-graph-height actual-height) "Return list of strings that is one column of a graph." (let ((insert-list nil) (number-of-top-blanks (- max-graph-height actual-height)))
es: ;;; @r{Primera versi@'on.} (defun column-of-graph (max-graph-height actual-height) "Devuelve la lista de cadenas que una columna de un grafo." (let ((insert-list nil) (number-of-top-blanks (- max-graph-height actual-height)))

source: ;; @r{Fill in asterisks.} (while (> actual-height 0) (setq insert-list (cons "*" insert-list)) (setq actual-height (1- actual-height)))
es: ;; @r{Llenar asteriscos.} (while (> actual-height 0) (setq insert-list (cons "*" insert-list)) (setq actual-height (1- actual-height)))

source: ;; @r{Fill in blanks.} (while (> number-of-top-blanks 0) (setq insert-list (cons " " insert-list)) (setq number-of-top-blanks (1- number-of-top-blanks)))
es: ;; @r{Rellena espacios en blanco.} (while (> number-of-top-blanks 0) (setq insert-list (cons " " insert-list)) (setq number-of-top-blanks (1- number-of-top-blanks)))

source: ;; @r{Return whole list.} insert-list))
es: ;; @r{Devuelve la lista completa.} insert-list))

source: If you install this function and then evaluate the following expression you will see that it returns the list as desired:
es: Si se instala esta funci@'on y entonces eval@'ua la siguiente expresi@'on se ver@'a que devuelve la lista como se desea:

source: returns
es: devuelve

source: As written, @code{column-of-graph} contains a major flaw: the symbols used for the blank and for the marked entries in the column are `hard-coded' as a space and asterisk. This is fine for a prototype, but you, or another user, may wish to use other symbols. For example, in testing the graph function, you many want to use a period in place of the space, to make sure the point is being repositioned properly each time the @code{insert-rectangle} function is called; or you might want to substitute a @samp{+} sign or other symbol for the asterisk. You might even want to make a graph-column that is more than one display column wide. The program should be more flexible. The way to do that is to replace the blank and the asterisk with two variables that we can call @code{graph-blank} and @code{graph-symbol} and define those variables separately.
es: Como est@'a escrito, @code{column-of-graph} contiene una grieta mayor: los s@'{@dotless{i}}mbolos usados para el espacio en blanco para las entradas marcadas en la columna son `codificadas duras' como un espacio y un asterisco. Esto est@'a bien para un prototipo, pero tu, u otro usuario, puede desear usar otros s@'{@dotless{i}}mbolos. Por ejemplo, chequeando la funci@'on grafo, tu quieres usar un periodo en vez del espacio, asegura el punto que est@'a siendo reposicionando apropiadamente cada vez que la funci@'on @code{insert-rectangle} se llama; o se podr@'{@dotless{i}}a querer sustituir un signo @samp{+} u otro s@'{@dotless{i}}mbolo para el asterisco. Se podr@'{@dotless{i}}a incluso querer hacer un graph-column que es m@'as que un ancho de columna. El programa deber@'{@dotless{i}}a ser m@'as flexible. El camino para hacer esto es reemplazar el espacio en blanco y el asterisco con dos variables que se puede llamar @code{graph-blank} y @code{graph-symbol} y define estas variables separadamente.

source: Also, the documentation is not well written. These considerations lead us to the second version of the function:
es: Tambi@'en la documentaci@'on no est@'a escrita. Estas consideraciones nos llevan tambi@'en a la segunda versi@'on de la funci@'on:

source: (defvar graph-symbol "*" "String used as symbol in graph, usually an asterisk.")
es: (defvar graph-symbol "*" "Cadena usada como s@'{@dotless{i}}mbolo en grafo, normalmente un asterisco.")

source: (defvar graph-blank " " "String used as blank in graph, usually a blank space. graph-blank must be the same number of columns wide as graph-symbol.")
es: (defvar graph-blank " " "La cadena como un espacio en blanco en grafo, normalmente un espacio en blanco. graph-blank debe ser el mismo n@'umero de columnas amplio como graph-symbol.")

source: (For an explanation of @code{defvar}, see @ref{defvar, , Initializing a Variable with @code{defvar}}.)
es: (Para una explicaci@'on de @code{defvar}, ver @ref{defvar, , Inicializando una Variable con @code{defvar}}.)

source: ;;; @r{Second version.} (defun column-of-graph (max-graph-height actual-height) "Return MAX-GRAPH-HEIGHT strings; ACTUAL-HEIGHT are graph-symbols.
es: ;;; @r{Segunda versi@'on.} (defun column-of-graph (max-graph-height actual-height) "Devuelve cadenas MAX-GRAPH-HEIGHT; ACTUAL-HEIGHT son s@'{@dotless{i}}mbolos de grafos.

source: The graph-symbols are contiguous entries at the end of the list. The list will be inserted as one column of a graph. The strings are either graph-blank or graph-symbol."
es: Los graph-symbols son entradas contiguo al fin de la lista. La lista ser@'a insertado como una columna de un grafo. Las cadenas son tanto graph-blank o graph-symbol.

source: ;; @r{Fill in @code{graph-symbols}.} (while (> actual-height 0) (setq insert-list (cons graph-symbol insert-list)) (setq actual-height (1- actual-height)))
es: ;; @r{Rellenar en @code{graph-symbols}.} (while (> actual-height 0) (setq insert-list (cons graph-symbol insert-list)) (setq actual-height (1- actual-height)))

source: ;; @r{Fill in @code{graph-blanks}.} (while (> number-of-top-blanks 0) (setq insert-list (cons graph-blank insert-list)) (setq number-of-top-blanks (1- number-of-top-blanks)))
es: ;; @r{Rellenar en @code{graph-blanks}.} (while (> number-of-top-blanks 0) (setq insert-list (cons graph-blank insert-list)) (setq number-of-top-blanks (1- number-of-top-blanks)))

source: If we wished, we could rewrite @code{column-of-graph} a third time to provide optionally for a line graph as well as for a bar graph. This would not be hard to do. One way to think of a line graph is that it is no more than a bar graph in which the part of each bar that is below the top is blank. To construct a column for a line graph, the function first constructs a list of blanks that is one shorter than the value, then it uses @code{cons} to attach a graph symbol to the list; then it uses @code{cons} again to attach the `top blanks' to the list.
es: Si se desea, podr@'{@dotless{i}}amos reescribir @code{column-of-graph} una tercera vez para proporcionar opcionalmente un gr@'afico de l@'{@dotless{i}}neas, como gr@'afico de barras. Esto no ser@'{@dotless{i}}a duro de hacer. Un camino para pensar en un grafo de l@'{@dotless{i}}neas es que no es m@'as que un grafo de barras en el que la parte de cada barra que est@'a debajo del alto es blanco. Para construir una columna para gr@'afico de l@'{@dotless{i}}neas, la funci@'on primero construyen una lista de espacios en blanco que es una m@'as ordenada que el valor, entonces usa @code{cons} para adjuntar un s@'{@dotless{i}}mbolo gr@'afico a la lista; entonces eso usa @code{cons} de nuevo para adjuntar el `alto de espacios en blanco' a la lista.

source: It is easy to see how to write such a function, but since we don't need it, we will not do it. But the job could be done, and if it were done, it would be done with @code{column-of-graph}. Even more important, it is worth noting that few changes would have to be made anywhere else. The enhancement, if we ever wish to make it, is simple.
es: Es f@'acil ver como escribir tal funci@'on, pero puesto que no se necesita eso, no se har@'a. Pero el trabajo podr@'{@dotless{i}}a ser hecho, y si eso se hiciera, se har@'{@dotless{i}}a con @code{column-of-graph}. Incluso m@'as importante, no se valora nada m@'as que pocos cambios que tendr@'{@dotless{i}}an que ser hechos de cualquier otra manera. La mejora, que se desea hacer, es simple.

source: Now, finally, we come to our first actual graph printing function. This prints the body of a graph, not the labels for the vertical and horizontal axes, so we can call this @code{graph-body-print}.
es: Ahora, finalmente, volvemos a nuestra primera funci@'on de grafo impresa. Esto imprime el cuerpo de un grafo, no las etiquetas para los ejes horizontal y vertical, as@'{@dotless{i}} se puede llamar este @code{graph-body-print}.

source: The @code{graph-body-print} Function
es: La funci@'on @code{graph-body-print}

source: After our preparation in the preceding section, the @code{graph-body-print} function is straightforward. The function will print column after column of asterisks and blanks, using the elements of a numbers' list to specify the number of asterisks in each column. This is a repetitive act, which means we can use a decrementing @code{while} loop or recursive function for the job. In this section, we will write the definition using a @code{while} loop.
es: Despu@'es de nuestra preparaci@'on en la secci@'on precedente, la funci@'on @code{graph-body-print} es simple. La funci@'on imprimir@'a la columna despu@'es de la columna de asteriscos y espacios en blanco, usando los elementos de la lista de n@'umeros para especificar el n@'umero de asteriscos en cada columna. Esto es un acto repetitivo, que significa que se puede usar un bucle @code{while} que decrementa o una funci@'on recursiva para el trabajo. En esta secci@'on, se escribir@'a la definici@'on usando un bucle @code{while}.
