Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: When you execute an autoloaded function, Emacs automatically evaluates the file that contains the definition, and then calls the function.
es: Cuando se ejecuta una funci@'on de autocarga, Emacs autom@'aticamente eval@'ua el fichero que contiene la definici@'on, y entonces llama a la funci@'on.

source: Emacs starts quicker with autoloaded functions, since their libraries are not loaded right away; but you need to wait a moment when you first use such a function, while its containing file is evaluated.
es: Emacs empieza r@'apido con funciones de autocarga, puesto que sus librer@'{@dotless{i}}as no se cargan bien; pero si necesita esperar un momento cuando su primer uso tal como una funci@'on, mientras que el fichero que lo contiene se eval@'ua.

source: Rarely used functions are frequently autoloaded. The @file{loaddefs.el} library contains hundreds of autoloaded functions, from @code{bookmark-set} to @code{wordstar-mode}. Of course, you may come to use a `rare' function frequently. When you do, you should load that function's file with a @code{load} expression in your @file{.emacs} file.
es: Raramente las funciones usadas son frecuentemente autocargadas. La librer@'{@dotless{i}}a @file{loaddefs.el} coniene cientos de funciones autocargadas, desde @code{bookmark-set} a @code{wordstar-mode}. Si se usa una funci@'on `rara' frecuentemente, se deber@'{@dotless{i}}a cargar este fichero de funci@'on con una expresi@'on de @code{load} en tu fichero @file{.emacs}.

source: In my @file{.emacs} file, I load 14 libraries that contain functions that would otherwise be autoloaded. (Actually, it would have been better to include these files in my `dumped' Emacs, but I forgot. @xref{Building Emacs, , Building Emacs, elisp, The GNU Emacs Lisp Reference Manual}, and the @file{INSTALL} file for more about dumping.)
es: En mi fichero @file{.emacs}, se cargan 14 librer@'{@dotless{i}}as que contienen funciones que de otro modo ser@'{@dotless{i}}an autocargadas. (Actualmente, eso habr@'{@dotless{i}}a sido mejor para incluir estos ficheros en mi Emacs `volcado', pero se olvida. @xref{Construyendo Emacs, , Construyendo Emacs, elisp, El Manual de Referencia GNU Emacs Lisp}, y el fichero @file{INSTALL} para m@'as acerca de volcados.)

source: You may also want to include autoloaded expressions in your @file{.emacs} file. @code{autoload} is a built-in function that takes up to five arguments, the final three of which are optional. The first argument is the name of the function to be autoloaded; the second is the name of the file to be loaded. The third argument is documentation for the function, and the fourth tells whether the function can be called interactively. The fifth argument tells what type of object---@code{autoload} can handle a keymap or macro as well as a function (the default is a function).
es: Se puede tambi@'en querer incluir expresiones autocargadas en tu fichero @file{.emacs}. @code{autoload} es una funci@'on construida que toma cinco argumento, los tres finales de los que son opcionales. El primer argumento es el nombre de la funci@'on para ser autocargada. El segundo es el nombre del fichero para ser cargado. El tercer argumento es documentaci@'on para la funci@'on, y el cuarto cuenta si la funci@'on puede ser llamada interactivmente. El quinto argumento cuenta que tipo de objeto --- @code{autoload} puede manejar un mapa de teclado o macro tan bien como una funci@'on (por defecto es una funci@'on).

source: Here is a typical example:
es: Aqu@'{@dotless{i}} hay un ejemplo t@'{@dotless{i}}pico:

source: (autoload 'html-helper-mode "html-helper-mode" "Edit HTML documents" t)
es: (autoload 'html-helper-mode "html-helper-mode" "Editar documentos HTML" t)

source: (@code{html-helper-mode} is an older alternative to @code{html-mode}, which is a standard part of the distribution.)
es: (@code{html-helper-mode} es una vieja alternativa a @code{html-mode}, que es una parte est@'andar de la distribuci@'on.)

source: This expression autoloads the @code{html-helper-mode} function. It takes it from the @file{html-helper-mode.el} file (or from the byte compiled version @file{html-helper-mode.elc}, if that exists.) The file must be located in a directory specified by @code{load-path}. The documentation says that this is a mode to help you edit documents written in the HyperText Markup Language. You can call this mode interactively by typing @kbd{M-x html-helper-mode}. (You need to duplicate the function's regular documentation in the autoload expression because the regular function is not yet loaded, so its documentation is not available.)
es: Esta expresi@'on autocarga la funci@'on @code{html-helper-mode}. Esto se toma desde el fichero @file{html-helper-mode-el} (o desde la versi@'on compilada @file{html-helper-mode.elc}, si eso existe). El fichero debe ser localizado en un directorio espec@'{@dotless{i}}fico por @code{load-path}. La documentaci@'on dice que esto es un modo para ayudar a editar documentos escritos en Lenguaje de Marcas de Hiper Texto. Se puede llamar este modo interactivamente escribiendo @kbd{M-x html-helper-mode}. (Se necesitan duplicar las funciones regulares de documentaci@'on en la expresi@'on de autocarga porque la funci@'on regular no est@'a todav@'{@dotless{i}}a cargada, as@'{@dotless{i}} su documentaci@'on no est@'a disponible.)

source: @xref{Autoload, , Autoload, elisp, The GNU Emacs Lisp Reference Manual}, for more information.
es: @xref{Autocarga, , Autocarga, elisp, El Manual de Referencia de GNU Emacs Lisp}, para m@'as informaci@'on.

source: A Simple Extension: @code{line-to-top-of-window}
es: Una extensi@'on simple: @code{line-to-top-of-window}

source: Simple extension in @file{.emacs} file
es: Extensi@'on simple en fichero @file{.emacs}

source: Here is a simple extension to Emacs that moves the line point is on to the top of the window. I use this all the time, to make text easier to read.
es: Aqu@'{@dotless{i}} hay una simple extensi@'on a Emacs que mueve el punto de l@'{@dotless{i}}nea arriba de la ventana. Yo uso esto todo el tiempo, para hacer f@'acil de leer el texto.

source: You can put the following code into a separate file and then load it from your @file{.emacs} file, or you can include it within your @file{.emacs} file.
es: Se puede poner el siguiente c@'odigo dentro de un fichero separado y entonce cargarlo desde tu fichero @file{.emacs}, o se puede incluir con tu fichero @file{.emacs}.

source: Here is the definition:
es: Aqu@'{@dotless{i}} est@'a la definici@'on

source: ;;; Line to top of window; ;;; replace three keystroke sequence C-u 0 C-l (defun line-to-top-of-window () "Move the line point is on to top of window." (interactive) (recenter 0))
es: ;;; L@'{@dotless{i}}nea a lo alto de la ventana; ;;; reemplaza tres secuencias de atajos de teclado C-u 0 C-l (defun line-to-top-of-window () "Mueve la l@'{@dotless{i}}nea que apunta a lo alto de la ventana." (interactive) (recenter 0))

source: Now for the keybinding.
es: Ahora el atajo.

source: Nowadays, function keys as well as mouse button events and non-@sc{ascii} characters are written within square brackets, without quotation marks. (In Emacs version 18 and before, you had to write different function key bindings for each different make of terminal.)
es: En estos d@'{@dotless{i}}as, las teclas de funci@'on as@'{@dotless{i}} como los eventos del rat@'on y caracteres no @sc{ascii} son escritos con corchetes, sin marcas de citas. (En Emacs versi@'on 18 y anteriores, se ten@'{@dotless{i}}a que escribir diferentes teclas de funci@'on asignadas por cada diferente creaci@'on del terminal.)

source: I bind @code{line-to-top-of-window} to my @key{F6} function key like this:
es: Se puede asociar @code{line-to-top-of-window} a la tecla de funci@'on @key{F6} as@'{@dotless{i}}:

source: For more information, see @ref{Init Rebinding, , Rebinding Keys in Your Init File, emacs, The GNU Emacs Manual}.
es: Para m@'as informaci@'on, mira @ref{Reasociando el Init, , Reasociando Teclas en tu fichero init, emacs, El Manual GNU Emacs}.

source: Conditional 'twixt two versions of Emacs
es: Condicional marcar@'an estas dos versiones de Emacs

source: Version of Emacs, choosing
es: Versi@'on de Emacs, eligiendo

source: Emacs version, choosing
es: Versi@'on de Emacs, eligiendo

source: If you run two versions of GNU Emacs, such as versions 22 and 23, and use one @file{.emacs} file, you can select which code to evaluate with the following conditional:
es: Si ejecutas dos versiones de GNU Emacs, tal como las versiones 22 y 23, y usas un fichero @file{.emacs}, se puede seleccionar qu@'e c@'odigo eval@'ua el siguiente condicional:

source: (cond ((= 22 emacs-major-version) ;; evaluate version 22 code ( @dots{} )) ((= 23 emacs-major-version) ;; evaluate version 23 code ( @dots{} )))
es: (cond ((= 22 emacs-major-version) ;; eval@'ua la version 22 ( @dots{} )) ((= 23 emacs-major-version) ;; eval@'ua la version 23 ( @dots{} )))

source: For example, recent versions blink their cursors by default. I hate such blinking, as well as other features, so I placed the following in my @file{.emacs} file@footnote{When I start instances of Emacs that do not load my @file{.emacs} file or any site file, I also turn off blinking: @smallexample emacs -q --no-site-file -eval '(blink-cursor-mode nil)' @exdent Or nowadays, using an even more sophisticated set of options, emacs -Q -D @end smallexample }:
es: Por ejemplo, en versiones m@'as recientes se ocultan los cursores por defecto. Si se odia tal ocultaci@'on se escribe lo siguiente en mi fichero @file{.emacs}@footnote{Cuando se empiezan las instancias de Emacs que no cargan mi fichero @file{.emacs} o cualquier fichero, tambi@'en se puede deshabilitar la ocultaci@'on: @smallexample emacs -q --no-site-file -eval '(blink-cursor-mode nil)' @exdent O ahora, usando un conjunto m@'as sofisticado de opciones, emacs -Q - D @end smallexample }:

source: (when (>= emacs-major-version 21) (blink-cursor-mode 0) ;; Insert newline when you press `C-n' (next-line) ;; at the end of the buffer (setq next-line-add-newlines t)
es: (when (>= emacs-major-version 21) (blink-cursor-mode 0) ;; Inserta la nueva l@'{@dotless{i}}nea cuando se presiona `C-n' (next-line) ;; al fin del b@'uffer (setq next-line-add-newlines t)

source: ;; Turn on image viewing (auto-image-file-mode t)
es: ;; Cambia la imagen viendo (auto-image-file-mode t)

source: ;; Turn on menu bar (this bar has text) ;; (Use numeric argument to turn on) (menu-bar-mode 1)
es: ;; Activa la barra de menu (esta barra tiene texto) ;; (Usa un argumento num@'erico para activarlo) (menu-bar-mode 1)

source: ;; Turn off tool bar (this bar has icons) ;; (Use numeric argument to turn on) (tool-bar-mode nil)
es: ;; Desactiva la barra de herramientas (esta barra tiene iconos) ;; (Usa argumentos num@'ericos para activarlo) (tool-bar-mode nil)

source: ;; Turn off tooltip mode for tool bar ;; (This mode causes icon explanations to pop up) ;; (Use numeric argument to turn on) (tooltip-mode nil) ;; If tooltips turned on, make tips appear promptly (setq tooltip-delay 0.1) ; default is 0.7 second )
es: ;; Desactiva el modo tooltip para la tool bar ;; (Este modo causa explicaciones de iconos al pop up) ;; (Usa el argumento num@'erico para activarlo) (tooltip-mode nil) ;; Si los tooltips activados, crea consejos aparecen en el prompt (setq tooltip-delay 0.1) ; por defecto es de 0.7 segundos )

source: You can specify colors when you use Emacs with the MIT X Windowing system.
es: Se pueden especificar colores cuando se usa Emacs con el Sistema de Ventanas X del MIT.

source: I dislike the default colors and specify my own.
es: Si disgustan los colores por defecto y especifica unos propios.

source: Here are the expressions in my @file{.emacs} file that set values:
es: Aqu@'{@dotless{i}} est@'an las expresiones en un fichero @file{.emacs} que establecen los valores:

source: ;; Set cursor color (set-cursor-color "white")
es: ;; Asigna el color del cursor (set-cursor-color "white")

source: ;; Set mouse color (set-mouse-color "white")
es: ;; Asigna el color del rat@'on (set-mouse-color "white")

source: ;; Set foreground and background (set-foreground-color "white") (set-background-color "darkblue")
es: ;; Asigna foreground y background (set-foreground-color "white") (set-background-color "darkblue")

source: ;;; Set highlighting colors for isearch and drag (set-face-foreground 'highlight "white") (set-face-background 'highlight "blue")
es: ;;; Asigna colores para isearch y drag (set-face-foreground 'highlight "white") (set-face-background 'highlight "blue")

source: ;; Set calendar highlighting colors (setq calendar-load-hook (lambda () (set-face-foreground 'diary-face "skyblue") (set-face-background 'holiday-face "slate blue") (set-face-foreground 'holiday-face "white")))
es: ;; Asigna colores al calendario (setq calendar-load-hook '(lambda () (set-face-foreground 'diary-face "skyblue") (set-face-background 'holiday-face "slate blue") (set-face-foreground 'holiday-face "white")))

source: The various shades of blue soothe my eye and prevent me from seeing the screen flicker.
es: Las varias sombras de azul disparan mi ojo y me preveen de ver la ventana desplegada.

source: Alternatively, I could have set my specifications in various X initialization files. For example, I could set the foreground, background, cursor, and pointer (i.e., mouse) colors in my @file{~/.Xresources} file like this:
es: Alternativamente, se podr@'{@dotless{i}}an haber configurado mis especificaciones en varios ficheros inicializaci@'on de X. Por ejemplo, se podr@'{@dotless{i}}a asignar el foreground, background, cursor y puntero (por ej., rat@'on) colores en mi fichero @file{~/.Xresources} como esto:

source: In any event, since it is not part of Emacs, I set the root color of my X window in my @file{~/.xinitrc} file, like this@footnote{I also run more modern window managers, such as Enlightenment, Gnome, or KDE; in those cases, I often specify an image rather than a plain color.}:
es: En cualquier evento que no es parte de Emacs, se asigna el color ra@'{@dotless{i}}z de mi ventana X en mi fichero @file{~/.xinitrc}, como este@footnote{tambi@'en se ejecutan gestores de ventanas m@'as modernos, tales como Enlightenment, Gnome, o KDE; en estos casos, con frecuencia se especifica una imagen en vez de un color plano.}

source: Miscellaneous
es: Miscel@'anea

source: Miscellaneous Settings for a @file{.emacs} File
es: Configuraciones miscel@'aneas para un fichero @file{.emacs}

source: Here are a few miscellaneous settings:
es: Aqu@'{@dotless{i}} hay unas pocas configuraciones miscel@'aneas:

source: Set the shape and color of the mouse cursor:
es: Asigna la forma y color del rat@'on del cursor:

source: ; Cursor shapes are defined in ; `/usr/include/X11/cursorfont.h'; ; for example, the `target' cursor is number 128; ; the `top_left_arrow' cursor is number 132.
es: ; Formas de Cursor est@'an definidas en ; `/usr/include/X11/cursorfont.h'; ; por ejemplo, el cursor `objetivo' es n@'umero 128; ; el cursor `top_left_arrow' es el n@'umero 132.

source: (let ((mpointer (x-get-resource "*mpointer" "*emacs*mpointer"))) ;; If you have not set your mouse pointer ;; then set it, otherwise leave as is: (if (eq mpointer nil) (setq mpointer "132")) ; top_left_arrow
es: (let ((mpointer (x-get-resource "*mpointer" "*emacs*mpointer"))) ;; Si no se ha asignado tu puntero de rat@'on ;; entonces asignalo, de otro modo, d@'ejalo as@'{@dotless{i}}: (if (eq mpointer nil) (setq mpointer "132")) ; top_left_arrow

source: Or you can set the values of a variety of features in an alist, like this:
es: O se pueden asignar los valores de una variedad de funcionalidades en una alist, como esta:

source: Convert @kbd{@key{CTRL}-h} into @key{DEL} and @key{DEL} into @kbd{@key{CTRL}-h}.@* (Some older keyboards needed this, although I have not seen the problem recently.)
es: Convierte @kbd{@key{CTRL}-h} dentro @key{DEL} y @key{DEL} dentro de @kbd{@key{CTRL}-h}.@* (Algunos viejos teclados lo necesitan, aunque yo no he visto el problema recientemente.)

source: ;; Translate `C-h' to <DEL>. ; (keyboard-translate ?\C-h ?\C-?)
es: ;; Traducir `C-h' a <DEL>. ; (keyboard-translate ?\C-h ?\C-?)

source: ;; Translate <DEL> to `C-h'. (keyboard-translate ?\C-? ?\C-h)
es: ;; Traducir <DEL> a `C-h'. (keyboard-translate ?\C-? ?\C-h)

source: Turn off a blinking cursor!
es: @exclamdown{}Desactiva un cursor oculto!

source: or start GNU Emacs with the command @code{emacs -nbc}.
es: o empieza GNU Emacs con el comando @code{emacs -nbc}.

source: When using `grep'@*
es: Cuando se usa `grep'@*

source: @samp{-i}@w{ } Ignore case distinctions@* @samp{-n}@w{ } Prefix each line of output with line number@* @samp{-H}@w{ } Print the filename for each match.@* @samp{-e}@w{ } Protect patterns beginning with a hyphen character, @samp{-}
es: @samp{-i}@w{ } Ignore distinciones de letras@* @samp{-n}@w{ } El prefijo de cada l@'{@dotless{i}}nea de la salida con el n@'umero de l@'{@dotless{i}}neas@* @samp{-H}@w{ } Imprime el nombre de fichero para cada cadena encontrada.@* @samp{-e}@w{ } Protege patrones empezando con un caracter de gui@'on, @samp{-}

source: Find an existing buffer, even if it has a different name@*
es: Encuentra un b@'uffer existente, incluso si eso tiene un nombre diferente@*

source: This avoids problems with symbolic links.
es: Esto evita problemas con enlaces simb@'olicos.

source: Set your language environment and default input method
es: Configura tu entorno de lenguaje y el m@'etodo de entrada por defecto

source: (set-language-environment "latin-1") ;; Remember you can enable or disable multilingual text input ;; with the @code{toggle-input-method'} (@kbd{C-\}) command (setq default-input-method "latin-1-prefix")
es: (set-language-environment "latin-1") ;; Recuerda que se puede habilitar o deshabilitar el texto de lenguaje ;; multilingüe con el comando @code{toggle-input-method'} (@kbd{C-\}) (setq default-input-method "latin-1-prefix")

source: If you want to write with Chinese `GB' characters, set this instead:
es: Si se quiere escribir con el caracter Chino `GB', asigna esto:

source: Fixing Unpleasant Key Bindings
es: Arreglando Atajos de Teclados

source: Key bindings, fixing
es: Atajos de Teclado, arreglando

source: Bindings, key, fixing unpleasant
es: Asociaciones, teclas, arreglando

source: Some systems bind keys unpleasantly. Sometimes, for example, the @key{CTRL} key appears in an awkward spot rather than at the far left of the home row.
es: Algunos sistemas asocian teclas de maneras no agradables. Algunas veces, por ejemplo, la tecla @key{CTRL} en un modo perverso en vez de la lejan@'{@dotless{i}}a a la izquierda de la fila.

source: Usually, when people fix these sorts of keybindings, they do not change their @file{~/.emacs} file. Instead, they bind the proper keys on their consoles with the @code{loadkeys} or @code{install-keymap} commands in their boot script and then include @code{xmodmap} commands in their @file{.xinitrc} or @file{.Xsession} file for X Windows.
es: Normalmente, cuando las personas arreglan estos atajos de teclado, no se cambia su fichero @file{~/.emacs}. En vez de eso, se asocian las teclas apropiadas en sus consolas con los comandos @code{loadkeys} o @code{install-keymap} en su script de inicio y entonces incluyen comandos @code{xmodmap} en su fichero @file{.xinitrc} o @file{.Xsession} para X Windows.

source: For a boot script:
es: Para un script de inicio:

source: For a @file{.xinitrc} or @file{.Xsession} file when the @key{Caps Lock} key is at the far left of the home row:
es: Para un fichero @file{.xinitrc} o un fichero @file{.Xsession} cuando la tecla @key{Caps Lock} es que tan lejos de la fila del home:

source: # Bind the key labeled `Caps Lock' to `Control' # (Such a broken user interface suggests that keyboard manufacturers # think that computers are typewriters from 1885.)
es: # Asocia la tecla etiquetada `Caps Lock' a `Control' # (Tal como un interfaz de usuario roto sugiere que el teclado hecho # piensa que los ordenadores son m@'aquinas de escribir desde 1885.)

source: In a @file{.xinitrc} or @file{.Xsession} file, to convert an @key{ALT} key to a @key{META} key:
es: En un @file{.xinitrc} o @file{.Xsession}, para convertir una tecla @key{ALT} a una tecla @key{META}:

source: # Some ill designed keyboards have a key labeled ALT and no Meta xmodmap -e "keysym Alt_L = Meta_L Alt_L"
es: # Algunos teclados mal dise@~nados tienen una tecla etiquetada ALT y no Meta xmodmap -e "keysym Alt_L = Meta_L Alt_L"

source: A Modified Mode Line
es: Una l@'{@dotless{i}}nea modificada

source: Mode line format
es: Formato de Modo L@'{@dotless{i}}nea

source: Finally, a feature I really like: a modified mode line.
es: Finalmente, una funcionalidad que realmente me gusta: un mode line modificado.

source: When I work over a network, I forget which machine I am using. Also, I tend to I lose track of where I am, and which line point is on.
es: Cuando se trabaja a trav@'es de una red, se olvida que m@'aquina se est@'a usando. Tambi@'en, se tiende a perder la traza de donde se est@'a, y a qu@'e l@'{@dotless{i}}nea se apunta.

source: So I reset my mode line to look like this:
es: As@'{@dotless{i}} se resetea mi mode line para que se parezca a esto:

source: I am visiting a file called @file{foo.texi}, on my machine @file{rattlesnake} in my @file{/home/bob} buffer. I am on line 1, in Texinfo mode, and am at the top of the buffer.
es: Estoy visitando un fichero llamado @file{foo.texi}, en mi m@'aquina @file{rattlesnake} en mi b@'uffer @file{/home/bob}. Yo estoy en la l@'{@dotless{i}}nea 1, en modo Texinfo, y estoy arriba del b@'uffer.

source: My @file{.emacs} file has a section that looks like this:
es: Mi fichero @file{.emacs} tiene una secci@'on que se parece a esto:

source: ;; Set a Mode Line that tells me which machine, which directory, ;; and which line I am on, plus the other customary information. (setq-default mode-line-format (quote (#("-" 0 1 (help-echo "mouse-1: select window, mouse-2: delete others ...")) mode-line-mule-info mode-line-modified mode-line-frame-identification " "
es: ;; Asigna un Mode Line que nos cuente que m@'aquina, que directorio, ;; y que l@'{@dotless{i}}nea estoy on, m@'as la informaci@'on de client. (setq-default mode-line-format (quote (#("-" 0 1 (help-echo "mouse-1: select window, mouse-2: delete others ...")) mode-line-mule-info mode-line-modified mode-line-frame-identification " "

source: Here, I redefine the default mode line. Most of the parts are from the original; but I make a few changes. I set the @emph{default} mode line format so as to permit various modes, such as Info, to override it.
es: Aqu@'{@dotless{i}}, se redefine el mode line por defecto. La mayor@'{@dotless{i}}a de las partes son desde el original; pero yo creo unos pocos cambios. Yo asigno el formato de mode line @emph{default} as@'{@dotless{i}} como permitir varios modos, tales como Info, para sobreescribirlo.

source: Many elements in the list are self-explanatory: @code{mode-line-modified} is a variable that tells whether the buffer has been modified, @code{mode-name} tells the name of the mode, and so on. However, the format looks complicated because of two features we have not discussed.
es: Muchos elementos en la lista son auto-explicativos: @code{mode-line-modified} es una variable que cuenta si el b@'uffer ha sido modificado, @code{mode-name} cuenta el nombre del modo, y as@'{@dotless{i}}. Sin embargo, el formato parece complicado porque las dos funcionalidades no han sido discutidas.

source: Properties, in mode line example
es: Propiedades, en el ejemplo del modo l@'{@dotless{i}}nea

source: The new string format has a special syntax:
es: La nueva cadena de formato tiene una sintaxis especial:
