Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: In Info, @code{"The name of this buffer is: *info*."} will appear in the echo area. The function @code{buffer-name} returns the name of the buffer as a string, which the @code{message} function inserts in place of @code{%s}.
es: En Info, @code{"El nombre de este b@'uffer es: *info*."} aparecer@'a en el @'area echo. La funci@'on @code{buffer-name} devuelve el nombre del b@'uffer como una cadena, que la funci@'on @code{message} inserta en lugar de @code{%s}.

source: To print a value as an integer, use @samp{%d} in the same way as @samp{%s}. For example, to print a message in the echo area that states the value of the @code{fill-column}, evaluate the following:
es: Para imprimir un valor como un entero, utiliza @samp{%d} de la misma forma que @samp{%s}. Por ejemplo, para imprimir un mensaje en el @'area echo que indique el valor de @code{fill-column}, eval@'ua lo siguiente:

source: (message "The value of fill-column is %d." fill-column)
es: (message "El valor de fill-column es %d." fill-column)

source: On my system, when I evaluate this list, @code{"The value of fill-column is 72."} appears in my echo area@footnote{Actually, you can use @code{%s} to print a number. It is non-specific. @code{%d} prints only the part of a number left of a decimal point, and not anything that is not a number.}.
es: En mi sistema, cuando eval@'uo esta lista, @code{"El valor de fill-column es 72"} aparece en mi @'area echo@footnote{Actualmente, puede usar @code{%s} para imprimir un n@'umero. Es no espec@'{@dotless{i}}fico. @code{%d} imprime solo la parte de un n@'umero a la izquierda del punto decimal, y no cualquier cosa que no es un n@'umero.}

source: If there is more than one @samp{%s} in the quoted string, the value of the first argument following the quoted string is printed at the location of the first @samp{%s} and the value of the second argument is printed at the location of the second @samp{%s}, and so on.
es: Si hay m@'as de un @samp{%s} en la cadena citada, el valor del primer argumento despu@'es de la cadena citada se imprime en la posici@'on del primer @samp{%s} y el valor del segundo argunmento se imprime en la posici@'on del segundo @samp{%s}, y as@'{@dotless{i}} sucesivamente.

source: For example, if you evaluate the following,
es: Por ejemplo, si se eval@'ua lo siguiente,

source: (message "There are %d %s in the office!" (- fill-column 14) "pink elephants")
es: (message "@exclamdown{}Hay %d %s en la oficina!" (- fill-column 14) "elefantes rosas")

source: a rather whimsical message will appear in your echo area. On my system it says, @code{"There are 58 pink elephants in the office!"}.
es: un mensaje caracter@'{@dotless{i}}stico aparecer@'a en el @'area echo. En mi sistema dice @code{"@exclamdown{}Hay 58 elefantes rosas en la oficina!"}

source: The expression @code{(- fill-column 14)} is evaluated and the resulting number is inserted in place of the @samp{%d}; and the string in double quotes, @code{"pink elephants"}, is treated as a single argument and inserted in place of the @samp{%s}. (That is to say, a string between double quotes evaluates to itself, like a number.)
es: Se evalua la expresi@'on @code{(- fill-column 14)} y el n@'umero resultante se inserta en lugar del @samp{%d}; y la cadena entre comillas dobles, @code{"elefantes rosas"}, se trata como un solo argumento y se inserta en lugar del @samp{%s}. (Esto es decir, una cadena entre comillas dobles se eval@'ua as@'{@dotless{i}} misma, como un n@'umero.)

source: Finally, here is a somewhat complex example that not only illustrates the computation of a number, but also shows how you can use an expression within an expression to generate the text that is substituted for @samp{%s}:
es: Finalmente, aqu@'{@dotless{i}} est@'a un ejemplo algo complejo que no solo ilustra el c@'alculo de un n@'umero, tambi@'en muestra como se puede usar una expresi@'on dentro de una expresi@'on para generar el texto que sustituira el @samp{%s}:

source: (message "He saw %d %s" (- fill-column 32) (concat "red " (substring "The quick brown foxes jumped." 16 21) " leaping."))
es: (message "@'El vi@'o %d %s" (- fill-column 36) (concat (substring "Los r@'apidos zorros marrones saltaron." 12 18) " rojos trotando."))

source: In this example, @code{message} has three arguments: the string, @code{"He saw %d %s"}, the expression, @code{(- fill-column 32)}, and the expression beginning with the function @code{concat}. The value resulting from the evaluation of @code{(- fill-column 32)} is inserted in place of the @samp{%d}; and the value returned by the expression beginning with @code{concat} is inserted in place of the @samp{%s}.
es: En este ejemplo, @code{message} tiene tres argumentos: la cadena, @code{"@'El vi@'o %d %s"}, la expresi@'on, @code{(- fill-column 32)}, y la expresi@'on a partir de la funci@'on @code{concat}. El valor resultante desde la evaluaci@'on de @code{(- fill-column 32)} se inserta en lugar del @samp{%d}; y el valor devuelto por la expresi@'on que inicia con @code{concat} se inserta en lugar del @samp{%s}.

source: When your fill column is 70 and you evaluate the expression, the message @code{"He saw 38 red foxes leaping."} appears in your echo area.
es: Cuando @code{fill-column} es 70 y se eval@'ua la expresi@'on, aparecera el mensaje @code{"@'El vi@'o 41 zorros rojos trotando."} en tu @'area echo.

source: Variable, setting value
es: Variable, asignando valor

source: Setting value of variable
es: Asignando valor de variable

source: @samp{bind} defined
es: @samp{bind} se defini@'o

source: There are several ways by which a variable can be given a value. One of the ways is to use either the function @code{set} or the function @code{setq}. Another way is to use @code{let} (@pxref{let}). (The jargon for this process is to @dfn{bind} a variable to a value.)
es: Hay varias formas de asignar un valor a una variable. Una de ellas es usar la funci@'on @code{set} o la funci@'on @code{setq}. Otra forma es usar @code{let} (@pxref{let}). (La jerga para este proceso es @dfn{bind} (ligar) una variable a un valor.)

source: The following sections not only describe how @code{set} and @code{setq} work but also illustrate how arguments are passed.
es: Las siguientes secciones no solo describen c@'omo operan @code{set} y @code{setq}, tambi@'en ilustran como se pasan los argumentos.

source: Using @code{set}
es: Usando @code{set}

source: To set the value of the symbol @code{flowers} to the list @code{'(rose violet daisy buttercup)}, evaluate the following expression by positioning the cursor after the expression and typing @kbd{C-x C-e}.
es: Para establecer el valor del s@'{@dotless{i}}mbolo @code{flores} a la lista @code{'(rosa violeta margarita bot@'ondeoro)}, eval@'ua la siguiente expresi@'on colocando el cursor despu@'es de la expresi@'on y presiona @kbd{C-x C-e}.

source: (set 'flowers '(rose violet daisy buttercup))
es: (set 'flores '(rosa violeta margarita bot@'ondeoro))

source: The list @code{(rose violet daisy buttercup)} will appear in the echo area. This is what is @emph{returned} by the @code{set} function. As a side effect, the symbol @code{flowers} is bound to the list; that is, the symbol @code{flowers}, which can be viewed as a variable, is given the list as its value. (This process, by the way, illustrates how a side effect to the Lisp interpreter, setting the value, can be the primary effect that we humans are interested in. This is because every Lisp function must return a value if it does not get an error, but it will only have a side effect if it is designed to have one.)
es: La lista @code{(rosa violeta margarita bot@'ondeoro)} aparecer@'a en el @'area echo. Esto es @emph{devuelto} por la funci@'on @code{set}. Como efecto secundario, el s@'{@dotless{i}}mbolo @code{flores} est@'a ligado a la lista; es decir, el s@'{@dotless{i}}mbolo @code{flores}, puede ser visto como una variable, que entrega la lista como su valor. (Este proceso, ilustra un efecto lateral al int@'erprete Lisp: asignando el valor, que puede ser el efecto primario en el que los humanos estamos interesados. Esto se debe a que cada funci@'on Lisp debe devolver un valor si no se obtiene un error, pero solo tendr@'a un efecto secundario si est@'a dise@~nado para tener uno.)

source: After evaluating the @code{set} expression, you can evaluate the symbol @code{flowers} and it will return the value you just set. Here is the symbol. Place your cursor after it and type @kbd{C-x C-e}.
es: Despu@'es de evaluar la expresi@'on @code{set}, se puede evaluar el s@'{@dotless{i}}mbolo @code{flores} y devolver@'a el valor asignado. Aqu@'{@dotless{i}} est@'a el s@'{@dotless{i}}mbolo. Coloca el cursor al final de este y presiona @kbd{C-x C-e}.

source: flowers
es: flores

source: When you evaluate @code{flowers}, the list @code{(rose violet daisy buttercup)} appears in the echo area.
es: Cuando se eval@'ua @code{flores}, la lista @code{(rosa violeta margarita bot@'ondeoro)} aparece en el @'area echo.

source: Incidentally, if you evaluate @code{'flowers}, the variable with a quote in front of it, what you will see in the echo area is the symbol itself, @code{flowers}. Here is the quoted symbol, so you can try this:
es: Por cierto, si se eval@'ua @code{'flores}, la variable con una comilla en frente, lo que ver@'a en el @'area echo es el s@'{@dotless{i}}mbolo en s@'{@dotless{i}} mismo: @code{flores}. Aqu@'{@dotless{i}} est@'a el s@'{@dotless{i}}mbolo citado, para que pueda probar esto:

source: 'flowers
es: 'flores

source: Note also, that when you use @code{set}, you need to quote both arguments to @code{set}, unless you want them evaluated. Since we do not want either argument evaluated, neither the variable @code{flowers} nor the list @code{(rose violet daisy buttercup)}, both are quoted. (When you use @code{set} without quoting its first argument, the first argument is evaluated before anything else is done. If you did this and @code{flowers} did not have a value already, you would get an error message that the @samp{Symbol's value as variable is void}; on the other hand, if @code{flowers} did return a value after it was evaluated, the @code{set} would attempt to set the value that was returned. There are situations where this is the right thing for the function to do; but such situations are rare.)
es: N@'otese tambi@'en, que cuando se usa @code{set}, se necesitan citar ambos argumentos de @code{set}, a menos que los quiera evaluar. Puesto que nosotros no queremos evaluar, ni la variable @code{flores}, ni la lista @code{(rosa violeta margarita bot@'ondeoro)}, ambos se citan. (Cuando se usa @code{set} sin citar su primer argumento, el primer argumento se eval@'ua antes de realizar cualquier otra cosa. Si hizo esto y @code{flores} no ten@'{@dotless{i}}a ya un valor, se tendr@'{@dotless{i}}a un mensaje de error con el @samp{Valor de s@'{@dotless{i}}mbolo como variable vac@'{@dotless{i}}o}; por otro lado, si @code{flores} regreso un valor despu@'es de ser evaluado, @code{set} intentar@'{@dotless{i}}a establecer el valor que fue devuelto. Hay situaciones donde esto el justo lo que la funci@'on a de hacer, pero tales situaciones son poco frecuentes.)

source: Using @code{setq}
es: Usando @code{setq}

source: As a practical matter, you almost always quote the first argument to @code{set}. The combination of @code{set} and a quoted first argument is so common that it has its own name: the special form @code{setq}. This special form is just like @code{set} except that the first argument is quoted automatically, so you don't need to type the quote mark yourself. Also, as an added convenience, @code{setq} permits you to set several different variables to different values, all in one expression.
es: Como una cuesti@'on pr@'actica, casi siempre se cita el primer argumento de @code{set}. La combinaci@'on de @code{set} y un primer argumento citado es tan com@'un que tiene nombre propio: la forma especial @code{setq}. Esta forma especial es igual a @code{set} excepto que el primer argumento se cita autom@'aticamente, por lo que no necesita escribir la marca de cita. Tambi@'en, como una conveniencia a@~nadida, @code{setq} permite asignar varias variables diferentes a diferentes valores, todo en una expresi@'on.

source: To set the value of the variable @code{carnivores} to the list @code{'(lion tiger leopard)} using @code{setq}, the following expression is used:
es: Para establecer el valor de la variable @code{carn@'{@dotless{i}}voros} a la lista @code{'(leon tigre leopardo)} usando @code{setq}, se utiliza la siguiente expresi@'on:

source: (setq carnivores '(lion tiger leopard))
es: (setq carnivoros '(leon tigre leopardo))

source: This is exactly the same as using @code{set} except the first argument is automatically quoted by @code{setq}. (The @samp{q} in @code{setq} means @code{quote}.)
es: Esto es exactamente lo mismo que usar @code{set} excepto que el primer argumento se cita autom@'aticamente por @code{setq}. (La @samp{q} en @code{setq} significa @code{quote}.)

source: With @code{set}, the expression would look like this:
es: Con @code{set}, la expresi@'on que se ver@'{@dotless{i}}a es:

source: (set 'carnivores '(lion tiger leopard))
es: (set 'carnivoros '(leon tigre leopardo))

source: Also, @code{setq} can be used to assign different values to different variables. The first argument is bound to the value of the second argument, the third argument is bound to the value of the fourth argument, and so on. For example, you could use the following to assign a list of trees to the symbol @code{trees} and a list of herbivores to the symbol @code{herbivores}:
es: Adem@'as, @code{setq} se puede utilizar para asignar diferentes valores a diferentes variables. El primer argumento se une a al valor del segundo argumento, el tercer argumento se une a al valor del cuarto argumento, y as@'{@dotless{i}} sucesivamente. Por ejemplo, se podr@'{@dotless{i}}a usar lo siguiente para asignar una lista de @'arboles al s@'{@dotless{i}}mbolo @code{arboles} y una lista de herb@'{@dotless{i}}voros al s@'{@dotless{i}}mbolo @code{herbivoros}:

source: (setq trees '(pine fir oak maple) herbivores '(gazelle antelope zebra))
es: (setq arboles '(pino abeto roble arce) herbivoros '(gacela antilope cebra))

source: (The expression could just as well have been on one line, but it might not have fit on a page; and humans find it easier to read nicely formatted lists.)
es: (La expresi@'on podr@'{@dotless{i}}a tambi@'en haber estado en una sola l@'{@dotless{i}}nea, pero podr@'{@dotless{i}}a no caber en una p@'agina; y a los humanos les resulta m@'as f@'acil leer listas con un formato agradable.)

source: Although I have been using the term `assign', there is another way of thinking about the workings of @code{set} and @code{setq}; and that is to say that @code{set} and @code{setq} make the symbol @emph{point} to the list. This latter way of thinking is very common and in forthcoming chapters we shall come upon at least one symbol that has `pointer' as part of its name. The name is chosen because the symbol has a value, specifically a list, attached to it; or, expressed another way, the symbol is set to ``point'' to the list.
es: Aunque he estado usando el t@'ermino `asignar', hay otra forma de pensar respecto a el funcionamiento de @code{set} y @code{setq}; y consiste en decir que @code{set} y @code{setq} crean un s@'{@dotless{i}}mbolo que @emph{apunta} a la lista. Esta ultima forma de pensar es muy com@'un y en los cap@'{@dotless{i}}tulos siguientes deberiamos encontrar al menos un s@'{@dotless{i}}mbolo con un `puntero' como parte de su nombre. El nombre es elegido porque el s@'{@dotless{i}}mbolo tiene un valor, espec@'{@dotless{i}}ficamente una lista, unida a el; o, expresado de otra manera, el s@'{@dotless{i}}mbolo se ajusta para ``apuntar'' a la lista.

source: Here is an example that shows how to use @code{setq} in a counter. You might use this to count how many times a part of your program repeats itself. First set a variable to zero; then add one to the number each time the program repeats itself. To do this, you need a variable that serves as a counter, and two expressions: an initial @code{setq} expression that sets the counter variable to zero; and a second @code{setq} expression that increments the counter each time it is evaluated.
es: He aqu@'{@dotless{i}} un ejemplo que muestra c@'omo usar @code{setq} en un contador. Se podr@'{@dotless{i}}a usar esto para contar cuantas veces una parte de un programa se repite. En primer lugar asigna una variable a cero; a continuaci@'on suma uno al n@'umero cada vez que el programa se repita. Para ello, se necesita una variable que sirve como un contador, y dos expresiones: una expresi@'on @code{setq} inicial que asigna la variable contador a cero; y una segunda expresi@'on @code{setq} que incrementa el contador cada vez se evalua.

source: (setq counter 0) ; @r{Let's call this the initializer.}
es: (setq contador 0) ; @r{Llamemos a esto el inicializador.}

source: (setq counter (+ counter 1)) ; @r{This is the incrementer.}
es: (setq contador (+ contador 1)) ; @r{Este es el incremento.}

source: counter ; @r{This is the counter.}
es: contador ; @r{Esste es el contador.}

source: (The text following the @samp{;} are comments. @xref{Change a defun, , Change a Function Definition}.)
es: (El texto que sigue al @samp{;} son los comentarios. Ver @xref{Cambiar un defun, , Cambiar una definici@'on de funci@'on}.)

source: If you evaluate the first of these expressions, the initializer, @code{(setq counter 0)}, and then evaluate the third expression, @code{counter}, the number @code{0} will appear in the echo area. If you then evaluate the second expression, the incrementer, @code{(setq counter (+ counter 1))}, the counter will get the value 1. So if you again evaluate @code{counter}, the number @code{1} will appear in the echo area. Each time you evaluate the second expression, the value of the counter will be incremented.
es: Si eval@'uas la primera de estas expresiones, el inicializador, @code{(setq contador 0)}, y luego eval@'uas la tercera expresi@'on, @code{contador}, el n@'umero @code{0} aparecer@'a en el @'area echo. Si a continuaci@'on se eval@'ua la segunda expresi@'on, el incremento, @code{(setq contador (+ contador 1))}, el contador tendr@'a el valor 1. As@'{@dotless{i}} que si eval@'uas de nuevo @code{contador}, el n@'umero @code{1} aparecer@'a en el @'area echo. Cada vez que se eval@'ua la segunda expresi@'on, el valor del contador ser@'a incrementado.

source: When you evaluate the incrementer, @code{(setq counter (+ counter 1))}, the Lisp interpreter first evaluates the innermost list; this is the addition. In order to evaluate this list, it must evaluate the variable @code{counter} and the number @code{1}. When it evaluates the variable @code{counter}, it receives its current value. It passes this value and the number @code{1} to the @code{+} which adds them together. The sum is then returned as the value of the inner list and passed to the @code{setq} which sets the variable @code{counter} to this new value. Thus, the value of the variable, @code{counter}, is changed.
es: Al eval@'uar el incremento, @code{(setq contador (+ contador 1))}, el int@'erprete Lisp primero eval@'ua la lista interna; esta es la adici@'on. Con el fin de evaluar esta lista, se debe evaluar la variable @code{contador} y el n@'umero @code{1}. Cuando eval@'ua la variable @code{contador}, se recibe su valor actual. Se pasa este valor y el n@'umero @code{1} a @code{+} que los a@~nade. La suma es devuelta como el valor de la list interior y pasa a @code{setq} que asigna la variable @code{contador} a este nuevo valor. Por lo tanto, el valor de la variable @code{contador}, cambia.

source: Learning Lisp is like climbing a hill in which the first part is the steepest. You have now climbed the most difficult part; what remains becomes easier as you progress onwards.
es: Aprender Lisp es como subir una colina en la que la primera parte es la m@'as empinada. Ahora has subido la parte m@'as dif@'{@dotless{i}}cil; lo que queda se vuelve m@'as f@'acil a medida que avanzas hacia adelante.

source: In summary,
es: En resumen,

source: Lisp programs are made up of expressions, which are lists or single atoms.
es: Los programas Lisp se componen de expresiones, que son listas o @'atomos individuales.

source: Lists are made up of zero or more atoms or inner lists, separated by whitespace and surrounded by parentheses. A list can be empty.
es: La listas se componen de cero o m@'as @'atomos o listas internas, separadas por espacios en blanco y rodeadas por par@'entesis. Una lista puede estar vac@'{@dotless{i}}a.

source: Atoms are multi-character symbols, like @code{forward-paragraph}, single character symbols like @code{+}, strings of characters between double quotation marks, or numbers.
es: Los @'atomos son s@'{@dotless{i}}mbolos multi-car@'acter, como @code{forward-paragraph}, s@'{@dotless{i}}mbolos de un solo caracterer como @code{+}, cadenas de caracteres entre comillas dobles, o n@'umeros.

source: A number evaluates to itself.
es: Un n@'umero se eval@'ua a s@'{@dotless{i}} mismo.

source: A string between double quotes also evaluates to itself.
es: Una cadena entre comillas dobles tambi@'en se eval@'ua a s@'{@dotless{i}} mismo.

source: When you evaluate a symbol by itself, its value is returned.
es: Cuando se eval@'ua un s@'{@dotless{i}}mbolo a s@'{@dotless{i}} mismo, su valor se devuelve.

source: When you evaluate a list, the Lisp interpreter looks at the first symbol in the list and then at the function definition bound to that symbol. Then the instructions in the function definition are carried out.
es: Cuando se eval@'ua una lista, el int@'erprete Lisp mira el primer s@'{@dotless{i}}mbolo en la lista y luego la definici@'on de funci@'on asociada a este s@'{@dotless{i}}mbolo. A continuaci@'on, las instrucciones en la definici@'on de funci@'on se llevan a cabo.

source: A single quotation mark,
es: Una marca de cita,

source: , tells the Lisp interpreter that it should return the following expression as written, and not evaluate it as it would if the quote were not there.
es: , le indica al int@'erprete Lisp que devuelva la siguiente expresi@'on como esta escrita, y no la eval@'ua como lo haria si la cita no estuviera alli.

source: Arguments are the information passed to a function. The arguments to a function are computed by evaluating the rest of the elements of the list of which the function is the first element.
es: Los argumentos son la informaci@'on que se pasa a una funci@'on. Los argumentos a una funci@'on son computados evaluando el resto de los elementos de la lista de la que la funci@'on es el primer elemento.

source: A function always returns a value when it is evaluated (unless it gets an error); in addition, it may also carry out some action called a ``side effect''. In many cases, a function's primary purpose is to create a side effect.
es: Una funci@'on siempre devuelve un valor cuando se eval@'ua (a menos que obtenga un error); adem@'as, tambi@'en se puede llevar a cabo algun tipo de acci@'on llamado ``efecto secundario''. En muchos casos, el prop@'osito principal de una funci@'on es crear un efecto secundario.

source: Exercises
es: Ejercicios

source: A few simple exercises:
es: Unos ejercicios sencillos:

source: Generate an error message by evaluating an appropriate symbol that is not within parentheses.
es: Generar un mensaje de error evaluando un s@'{@dotless{i}}mbolo apropiado que no est@'a entre par@'entesis.

source: Generate an error message by evaluating an appropriate symbol that is between parentheses.
es: Generar un mensaje de error evaluando un s@'{@dotless{i}}mbolo apropiado que est@'a entre par@'entesis.

source: Create a counter that increments by two rather than one.
es: Crear un contador que se incrementa en dos en lugar de uno.
