Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: As we have seen, @code{message} is an Emacs Lisp function especially designed for sending a one line message to a user. (@xref{message, , The @code{message} function}.) In summary, the @code{message} function prints its first argument in the echo area as is, except for occurrences of @samp{%d} or @samp{%s} (and various other %-sequences which we have not mentioned). When it sees a control sequence, the function looks to the second or subsequent arguments and prints the value of the argument in the location in the string where the control sequence is located.
es: Como se ha visto, @code{message} es una funci@'on Emacs Lisp especialmente dise@~nada para enviar una l@'{@dotless{i}}nea de mensaje a un usuario. (@xref{message, , La funci@'on @code{message}}) En resumen, la funci@'on @code{message} imprime su primer argumento en el @'area echo como es, excepto para ocurrencia de @samp{%d}, o @samp{%s} (y varios otras %-secuencias que no hemos mencionado). Cuando se ve una secuencia de control, la funci@'on mira al segundo argumento o subsiguiente e imprime el valor del argumento en la localizaci@'on en la cadena donde la secuencia de control est@'a localizada.

source: In the interactive @code{multiply-by-seven} function, the control string is @samp{%d}, which requires a number, and the value returned by evaluating @code{(* 7 5)} is the number 35. Consequently, the number 35 is printed in place of the @samp{%d} and the message is @samp{The result is 35}.
es: En la funci@'on interactiva @code{multiply-by-seven}, la cadena de control es @samp{%d}, que requiere un n@'umero, y el valor devuelto evaluando @code{(* 7 5)} es el n@'umero 35. Por consiguiente, el n@'umero 35 es impreso en lugar de @samp{%d} y el mensaje es @samp{El resultado es 35}.

source: (Note that when you call the function @code{multiply-by-seven}, the message is printed without quotes, but when you call @code{message}, the text is printed in double quotes. This is because the value returned by @code{message} is what appears in the echo area when you evaluate an expression whose first element is @code{message}; but when embedded in a function, @code{message} prints the text as a side effect without quotes.)
es: (N@'otese que cuando se llama a la funci@'on @code{multiply-by-seven}, el mensaje est@'a impreso sin comillas, pero cuando se llama a @code{message}, el texto es impreso con dobles comillas. Esto es porque el valor devuelto por @code{message} aparece en el @'area echo cuando se eval@'ua una expresi@'on cuyo primer elemente es @code{message}; pero cuando se embebi@'o en una funci@'on, @code{message} se imprime el texto como un efecto lateral sin comillas.)

source: Different Options for @code{interactive}
es: Opciones diferentes para @code{interactive}

source: Options for @code{interactive}
es: Opciones para @code{interactive}

source: Interactive options
es: Opciones Interactive

source: In the example, @code{multiply-by-seven} used @code{"p"} as the argument to @code{interactive}. This argument told Emacs to interpret your typing either @kbd{C-u} followed by a number or @key{META} followed by a number as a command to pass that number to the function as its argument. Emacs has more than twenty characters predefined for use with @code{interactive}. In almost every case, one of these options will enable you to pass the right information interactively to a function. (@xref{Interactive Codes, , Code Characters for @code{interactive}, elisp, The GNU Emacs Lisp Reference Manual}.)
es: En el ejemplo, @code{multiply-by-seven} usa @code{"p"} como el argumento a @code{interactive}. Este argumento cuenta a Emacs que interprete la escritura si @kbd{C-u} seguido por un n@'umero o @key{META} seguido por un n@'umero como un comando para pasar este n@'umero a la funci@'on como su argumento. Emacs tiene m@'as de veinte caracteres predefinidos para usar con @code{interactive}. En casi cada caso, una de estas opciones te habilitar@'a para pasar la informaci@'on adecuada interactivamente a una funci@'on. (@xref{C@'odigos Interactive, , Car@'acteres C@'odigo para @code{interactive}, elisp, El Manual de Referencia GNU Emacs Lisp}).

source: Consider the function @code{zap-to-char}. Its interactive expression is
es: Considera la funci@'on @code{zap-to-char}. Su expresi@'on interactiva es

source: The first part of the argument to @code{interactive} is @samp{p}, with which you are already familiar. This argument tells Emacs to interpret a `prefix', as a number to be passed to the function. You can specify a prefix either by typing @kbd{C-u} followed by a number or by typing @key{META} followed by a number. The prefix is the number of specified characters. Thus, if your prefix is three and the specified character is @samp{x}, then you will delete all the text up to and including the third next @samp{x}. If you do not set a prefix, then you delete all the text up to and including the specified character, but no more.
es: La primera parte del argumento para @code{interactive} es @samp{p}, con el que ya se est@'a familiarizado. Este argumento cuenta a Emacs intepretar un `prefijo', como un n@'umero que se pase a la funci@'on. Se puede especificar un prefijo si escribiendo @kbd{C-u} seguido por un n@'umero o escribiendo @key{META} seguido por un n@'umero. El prefijo es el n@'umero de caracteres especificado. De este modo, si el prefijo es tres y el caracter espec@'{@dotless{i}}fico es @samp{x}, entonces se borrar@'a todo el texto e incluyendo el tercer @samp{x} siguiente. Si no se fija un prefijo, entonces borra todo el texto e incluye el car@'acter espec@'{@dotless{i}}fico, pero no m@'as.

source: The @samp{c} tells the function the name of the character to which to delete.
es: El @samp{c} cuenta la funci@'on el nombre del car@'acter para que borre.

source: More formally, a function with two or more arguments can have information passed to each argument by adding parts to the string that follows @code{interactive}. When you do this, the information is passed to each argument in the same order it is specified in the @code{interactive} list. In the string, each part is separated from the next part by a @samp{\n}, which is a newline. For example, you can follow @samp{p} with a @samp{\n} and an @samp{cZap to char:@: }. This causes Emacs to pass the value of the prefix argument (if there is one) and the character.
es: M@'as formalmente, una funci@'on con dos o m@'as argumentos puede tener informaci@'on pasado a cada argumento a@~nadiendo partes para la cadena que sigue @code{interactive}. Cuando se hace esto, la informaci@'on est@'a pasada para cada argumento en el mismo orden, esto est@'a especificado en la lista @code{interactive}. En la cadena, cada parte est@'a separada desde la siguiente parte por un @samp{\n}, que es una nueva l@'{@dotless{i}}nea. Por ejemplo, tu puedes seguir @samp{p} con un @samp{\n} y un @samp{cZap to char:@:}. Esto causa que Emacs pase el valor del argumento prefijo (si hay uno) y el car@'acter.

source: In this case, the function definition looks like the following, where @code{arg} and @code{char} are the symbols to which @code{interactive} binds the prefix argument and the specified character:
es: En este caso, la definici@'on de funci@'on mira como lo siguiente, donde @code{arg} y @code{char} son los s@'{@dotless{i}}mbolos para que @code{interactive} empareja el argumento y el caracter especificado:

source: (defun @var{name-of-function} (arg char) "@var{documentation}@dots{}" (interactive "p\ncZap to char: ") @var{body-of-function}@dots{})
es: (defun @var{nombre-de-funcion} (arg char) "@var{documentacion}@dots{}" (interactive "p\ncZap to char: ") @var{cuerpo-de-funcion}@dots{})

source: (The space after the colon in the prompt makes it look better when you are prompted. @xref{copy-to-buffer, , The Definition of @code{copy-to-buffer}}, for an example.)
es: (El espacio despu@'es del punto y coma en pantalla hace que se vea mejor. @xref{copy-to-buffer, , La Definici@'on de @code{copy-to-buffer}}, por ejemplo.)

source: When a function does not take arguments, @code{interactive} does not require any. Such a function contains the simple expression @code{(interactive)}. The @code{mark-whole-buffer} function is like this.
es: Cuando una funci@'on no tiene argumentos, @code{interactive} no requiere ninguno. Tal funci@'on contiene la expresi@'on simple @code{(interactive)}. La funci@'on @code{mark-whole-buffer} es como esto.

source: Alternatively, if the special letter-codes are not right for your application, you can pass your own arguments to @code{interactive} as a list.
es: Alternativamente, si los c@'odigos de letras no son correctos para tu aplicaci@'on, se pueden pasar tus propios argumentos a @code{interactive} como una lista.

source: @xref{append-to-buffer, , The Definition of @code{append-to-buffer}}, for an example. @xref{Using Interactive, , Using @code{Interactive}, elisp, The GNU Emacs Lisp Reference Manual}, for a more complete explanation about this technique.
es: @xref{append-to-buffer, , La Definici@'on de @code{append-to-buffer}}, para un ejemplo. @xref{Usando interactive, , Usando @code{interactive}, elisp, El Manual de GNU Emacs Lisp}, para una explicaci@'on m@'as completa acerca de esta t@'ecnica.

source: Install Code Permanently
es: Instalar c@'odigo permanentemente

source: Install code permanently
es: Instalar c@'odigo permanentemente

source: Permanent code installation
es: C@'odigo Permanente de Instalaci@'on

source: Code installation
es: C@'odigo de instalaci@'on

source: When you install a function definition by evaluating it, it will stay installed until you quit Emacs. The next time you start a new session of Emacs, the function will not be installed unless you evaluate the function definition again.
es: Para instalar una definici@'on de funci@'on, se evalu@'a y as@'{@dotless{i}} estar@'a instalada hasta que se salga de Emacs. La siguiente vez que se empiece una nueva sesi@'on de Emacs, la funci@'on no ser@'a instalado a menos que eval@'ue la definici@'on de nuevo.

source: At some point, you may want to have code installed automatically whenever you start a new session of Emacs. There are several ways of doing this:
es: En alg@'un punto, se puede querer tener c@'odigo instalado autom@'aticamente siempre y cuando se empiece una nueva sesi@'on de Emacs. Hay varios caminos para hacer esto:

source: If you have code that is just for yourself, you can put the code for the function definition in your @file{.emacs} initialization file. When you start Emacs, your @file{.emacs} file is automatically evaluated and all the function definitions within it are installed. @xref{Emacs Initialization, , Your @file{.emacs} File}.
es: Si se tiene c@'odigo que es solo para uno mismo, se puede poner el c@'odigo para la definici@'on de funci@'on en el fichero de inicializaci@'on de @file{.emacs}. Cuando se inicia Emacs, el fichero @file{.emacs} se eval@'ua autom@'atica y todas las definiciones de funci@'on que tenga quedan instaladas. @xref{Inicializaci@'on de Emacs, , Tu Fichero @file{.emacs}}.

source: Alternatively, you can put the function definitions that you want installed in one or more files of their own and use the @code{load} function to cause Emacs to evaluate and thereby install each of the functions in the files. @xref{Loading Files, , Loading Files}.
es: Alternativamente, se pueden poner las definiciones de funci@'on que se quieren instalar en uno o m@'as ficheros y usar la funci@'on @code{load} para causar a Emacs evaluar y cada una de las funciones en los ficheros. @xref{Cargando ficheros, , Cargando ficheros}.

source: Thirdly, if you have code that your whole site will use, it is usual to put it in a file called @file{site-init.el} that is loaded when Emacs is built. This makes the code available to everyone who uses your machine. (See the @file{INSTALL} file that is part of the Emacs distribution.)
es: Tercero, si tu tienes un c@'odigo que tu sitio completo usar@'a, es normal ponerlo en un fichero llamado @file{site-init.el} que es cargado cuando Emacs es construido. Esto hace que el c@'odigo disponible a cualquiera quien usa tu m@'aquina. (Mira el fichero @file{INSTALL} que es parte de la distribuci@'on Emacs.)

source: Finally, if you have code that everyone who uses Emacs may want, you can post it on a computer network or send a copy to the Free Software Foundation. (When you do this, please license the code and its documentation under a license that permits other people to run, copy, study, modify, and redistribute the code and which protects you from having your work taken from you.) If you send a copy of your code to the Free Software Foundation, and properly protect yourself and others, it may be included in the next release of Emacs. In large part, this is how Emacs has grown over the past years, by donations.
es: Finalmente, si tienes c@'odigo que cualquiera que use Emacs puede querer, se puede enviar en una red de ordenadores o enviar una copia a la Free Software Foundation. (Cuando se hace esto, por favor, licencia el c@'odigo y su documentaci@'on bajo una licencia que permita a otras personas ejecutar, copiar, estudiar, modificar, y redistribuir el c@'odigo y que te protege desde quien tome tu trabajo.) Si tu envias una copia de tu c@'odigo a la Free Software Foundation y, te protege apropiadamente a t@'{@dotless{i}} mismo y a otros, eso puede ser incluido en la siguiente entrega de Emacs. Si miramos la historia as@'{@dotless{i}}, es c@'omo Emacs ha crecido a trav@'es de los a@~nos pasados, por donaciones.

source: The @code{let} expression is a special form in Lisp that you will need to use in most function definitions.
es: La expresi@'on @code{let} es una forma especial en Lisp que se necesitar@'a para usar la mayor@'{@dotless{i}}a de las definiciones de funci@'on.

source: @code{let} is used to attach or bind a symbol to a value in such a way that the Lisp interpreter will not confuse the variable with a variable of the same name that is not part of the function.
es: @code{let} se usa para adjuntar o emparejar un s@'{@dotless{i}}mbolo para un valor en tal camino que el int@'erprete no confundir@'a la variable con otra variable del mismo nombre que no es parte de la funci@'on.

source: To understand why the @code{let} special form is necessary, consider the situation in which you own a home that you generally refer to as `the house', as in the sentence, ``The house needs painting.'' If you are visiting a friend and your host refers to `the house', he is likely to be referring to @emph{his} house, not yours, that is, to a different house.
es: Para comprender por qu@'e la forma especial @code{let} es necesaria, considere la situaci@'on en el que tu propio hogar que generalmente se refiere como `la casa', como en la frase, ``La casa necesita pintura.'' Si est@'a visitando a un amigo y tu alojamiento se refiere a `la casa', @'el es amistoso para estar refiri@'endose a @emph{su} casa, no la suya, que es, una casa diferente.

source: If your friend is referring to his house and you think he is referring to your house, you may be in for some confusion. The same thing could happen in Lisp if a variable that is used inside of one function has the same name as a variable that is used inside of another function, and the two are not intended to refer to the same value. The @code{let} special form prevents this kind of confusion.
es: Si el amigo est@'a refiri@'endose a su casa y tu piensas que @'el est@'a refiri@'endose a su casa, tu puedes estar dentro por alguna confusi@'on. La misma cosa podr@'{@dotless{i}}a ocurrir en Lisp si una variable que es usada dentro de una funci@'on tiene el mismo que una variable que es usada dentro de otra funci@'on, y las dos no se pretende referirse al mismo valor. La forma especial @code{let} previene este tipo de confusi@'on.

source: Prevent confusion
es: Prevenir confusi@'on

source: @code{let} Prevents Confusion
es: @code{let} evita confusiones

source: @samp{local variable} defined
es: @samp{variable local} definida

source: @samp{variable, local}, defined
es: @samp{variable, local}, definida

source: The @code{let} special form prevents confusion. @code{let} creates a name for a @dfn{local variable} that overshadows any use of the same name outside the @code{let} expression. This is like understanding that whenever your host refers to `the house', he means his house, not yours. (Symbols used in argument lists work the same way. @xref{defun, , The @code{defun} Special Form}.)
es: La forma especial @code{let} evita confusiones. @code{let} crea un nombre para una @dfn{variable local} que ensombrece cualquier uso del mismo nombre fuera de la expresi@'on @code{let}. Esto es como comprender que siempre y cuando tu host se refiera a `la casa', significa su casa, no la tuya. (S@'{@dotless{i}}mbolos usados en listas de argumentos trabajan en el mismo camino. @xref{defun, , La Forma Especial @code{defun}}.)

source: Local variables created by a @code{let} expression retain their value @emph{only} within the @code{let} expression itself (and within expressions called within the @code{let} expression); the local variables have no effect outside the @code{let} expression.
es: Las variable locales son creadas por una expresi@'on @code{let} que retiene su valor @emph{solo} con la expresi@'on @code{let} por s@'{@dotless{i}} misma (y con expresiones llamadas con la expresi@'on @code{let}); las variables locales no tiene efecto fuera de la expresi@'on @code{let}.

source: Another way to think about @code{let} is that it is like a @code{setq} that is temporary and local. The values set by @code{let} are automatically undone when the @code{let} is finished. The setting only affects expressions that are inside the bounds of the @code{let} expression. In computer science jargon, we would say ``the binding of a symbol is visible only in functions called in the @code{let} form; in Emacs Lisp, scoping is dynamic, not lexical.''
es: Otro camino para pensar acerca de @code{let} es que es como un @code{setq} que es temporal y local. Los valores asignado por @code{let} son autom@'aticamente deshechos cuando el @code{let} est@'a finalizado. La configuraci@'on solo afecta a expresiones que est@'an dentro de los emparejamientos de la expresi@'on @code{let}. En jerga de ciencia de computaci@'on, dir@'{@dotless{i}}amos que ``el emparejamiento de un s@'{@dotless{i}}mbolo es visible solo en funciones llamadas en la forma @code{let}; en Emacs Lisp, el alcance es din@'amico, no l@'exico.''

source: @code{let} can create more than one variable at once. Also, @code{let} gives each variable it creates an initial value, either a value specified by you, or @code{nil}. (In the jargon, this is called `binding the variable to the value'.) After @code{let} has created and bound the variables, it executes the code in the body of the @code{let}, and returns the value of the last expression in the body, as the value of the whole @code{let} expression. (`Execute' is a jargon term that means to evaluate a list; it comes from the use of the word meaning `to give practical effect to' (@cite{Oxford English Dictionary}). Since you evaluate an expression to perform an action, `execute' has evolved as a synonym to `evaluate'.)
es: @code{let} puede crear m@'as de una variable a la vez. Tambi@'en, @code{let} da cada variable eso crea un valor inicial, si un valor especificado por t@'{@dotless{i}}, o @code{nil}. (En la jerga, eso se llama `asociar la variable al valor'.) Despu@'es @code{let} ha creado y asociado las variables, ejecuta el c@'odigo en el cuerpo del @code{let} y devuelve el valor de la @'ultima expresi@'on en el cuerpo, como el valor de la expresi@'on @code{let} completa. (`Ejecuta' es un t@'ermino de jerga que significa evaluar una lista: viene desde el uso de la palabra significando `dar efecto pr@'actico a' (@cite{Diccionario de Ingl@'es de Oxford}). Desde que eval@'uas una expresi@'on para ejecutar una acci@'on, `ejecuta' ha evolucionado como un sin@'onimo para `evaluar'.)

source: Parts of let Expression
es: Partes de la expresi@'on let

source: The Parts of a @code{let} Expression
es: Las partes de una expresi@'on @code{let}

source: @code{let} expression, parts of
es: expresi@'on @code{let}, partes de

source: Parts of @code{let} expression
es: Partes de la expresi@'on @code{let}

source: @samp{varlist} defined
es: @samp{varlist} definida

source: A @code{let} expression is a list of three parts. The first part is the symbol @code{let}. The second part is a list, called a @dfn{varlist}, each element of which is either a symbol by itself or a two-element list, the first element of which is a symbol. The third part of the @code{let} expression is the body of the @code{let}. The body usually consists of one or more lists.
es: Una expresi@'on @code{let} es una lista de tres partes. La primera parte es el s@'{@dotless{i}}mbolo @code{let}. La segunda parte es una lista, llamada una @dfn{varlist}, cada elemento es un s@'{@dotless{i}}mbolo por s@'{@dotless{i}} mismo o una lista de dos elementos, el primer elemento de que es un s@'{@dotless{i}}mbolo. La tercera parte de la expresi@'on @code{let} es el cuerpo del @code{let}. El cuerpo normalmente consiste de una o m@'as listas.

source: A template for a @code{let} expression looks like this:
es: Una plantilla para una expresi@'on @code{let} se parece a esto:

source: The symbols in the varlist are the variables that are given initial values by the @code{let} special form. Symbols by themselves are given the initial value of @code{nil}; and each symbol that is the first element of a two-element list is bound to the value that is returned when the Lisp interpreter evaluates the second element.
es: Los s@'{@dotless{i}}mbolos en la varlist son las variables que son valores iniciales dados por la forma especial @code{let}. Los s@'{@dotless{i}}mbolos por s@'{@dotless{i}} mismos son dados por el valor inicial de @code{nil}; y cada s@'{@dotless{i}}mbolo que es el primer elemento de una lista de dos elementos es emparejado al valor que el devuelto cuando el int@'erprete Lisp eval@'ua el segundo elemento.

source: Thus, a varlist might look like this: @code{(thread (needles 3))}. In this case, in a @code{let} expression, Emacs binds the symbol @code{thread} to an initial value of @code{nil}, and binds the symbol @code{needles} to an initial value of 3.
es: De este modo, una varlist podr@'{@dotless{i}}a verse como esto: @code{(thread (needles 3))}. En este caso, es una expresi@'on @code{let}, Emacs asocia el s@'{@dotless{i}}mbolo @code{thread} a un valor inicial de @code{nil}, y empareja el s@'{@dotless{i}}mbolo @code{needles} a un valor inicial de 3.

source: When you write a @code{let} expression, what you do is put the appropriate expressions in the slots of the @code{let} expression template.
es: Cuando escribes una expresi@'on @code{let}, qu@'e hacer es poner las expresiones apropiadas en las cajas de la plantilla de expresi@'on @code{let}.

source: If the varlist is composed of two-element lists, as is often the case, the template for the @code{let} expression looks like this:
es: Si la lista de variables est@'a compuesta de listas de 2 elementos, como es frecuente el caso, la plantillas para la expresi@'on @code{let} mira como esto:

source: (let ((@var{variable} @var{value}) (@var{variable} @var{value}) @dots{}) @var{body}@dots{})
es: (let ((@var{variable} @var{valor}) (@var{variable} @var{valor}) @dots{}) @var{body}@dots{})

source: Sample let Expression
es: Ejemplo de expresi@'on let

source: Sample @code{let} Expression
es: Expresi@'on simple @code{let}

source: Sample @code{let} expression
es: Expresi@'on Simple @code{let}

source: @code{let} expression sample
es: expresi@'on simple @code{let}
