Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: ;; @bullet{} The third argument to `condition-case' tells the interpreter ;; what to do with an error.
es: ;; @bullet{} El tercer argumento a `condition-case' cuenta el int@'erprete ;; qu@'e hacer con un error.

source: ;; The third argument has a conditions part and a body part. ;; If the conditions are met (in this case, ;; if text or buffer are read-only) ;; then the body is executed.
es: ;; El tercer argumento tiene una parte de condiciones y una ;; parte del cuerpo. ;; Si las condiciones se encuentra (en este caso, ;; si el texto o b@'uffer son de solo lectura) ;; entonces el cuerpo es ejecutado.

source: ;; The first part of the third argument is the following: ((buffer-read-only text-read-only) ;; the if-part ;; @dots{} the then-part (copy-region-as-kill beg end)
es: ;; La primera parte del tercer es el siguiente: ((buffer-read-only text-read-only) ;; parte if ;; @dots{} parte then-part (copy-region-as-kill beg end)

source: ;; Next, also as part of the then-part, set this-command, so ;; it will be set in an error (setq this-command 'kill-region) ;; Finally, in the then-part, send a message if you may copy ;; the text to the kill ring without signaling an error, but ;; don't if you may not.
es: ;; Lo siguiente, tambi@'en como parte de la then-part, asigna this-command, as@'{@dotless{i}} ;; ser@'a asignado en un error (setq this-command 'kill-region) ;; Finalmente, en la then-part, env@'{@dotless{i}}a un mensaje ;; si se puede copiar el texto al anillo de la muerte ;; @emph{kill ring} sin se@~nalar un error, pero no si no se puede.

source: (if kill-read-only-ok (progn (message "Read only text copied to kill ring") nil) (barf-if-buffer-read-only) ;; If the buffer isn't read-only, the text is. (signal 'text-read-only (list (current-buffer)))))
es: (if kill-read-only-ok (progn (message "Lee solo texto copiado para el kill ring") nil) (barf-if-buffer-read-only) ;; If the buffer isn't read-only, the text is. (signal 'text-read-only (list (current-buffer)))))

source: (defun kill-region (beg end) "Kill between point and mark. The text is deleted but saved in the kill ring." (interactive "r")
es: (defun kill-region (beg end) "Corta entre punto y marca. El texto es borrado, pero guardado en el kill ring." (interactive "r")

source: ;; 1. `condition-case' takes three arguments. ;; If the first argument is nil, as it is here, ;; information about the error signal is not ;; stored for use by another function. (condition-case nil
es: ;; 1. `condition-case' tiene tres argumentos. ;; Si el primer argumento es nil, como est@'a aqu@'{@dotless{i}} ;; la informaci@'on acerca de la se@~nal de error no es ;; almacenada para usarse por otra funci@'on. (condition-case nil

source: ;; 2. The second argument to `condition-case' ;; tells the Lisp interpreter what to do when all goes well.
es: ;; 2. El segundo argumento a `condition-case' ;; cuenta al int@'eprete Lisp que hacer cuando todo va bien.

source: ;; The `delete-and-extract-region' function usually does the ;; work. If the beginning and ending of the region are both ;; the same, then the variable `string' will be empty, or nil (let ((string (delete-and-extract-region beg end)))
es: ;; La funci@'on `delete-and-extract-region' normalmente hace ;; el trabajo. Si el principio y final de la regi@'on son lo ;; mismo, entonces la varible `string' estar@'a ;; vac@'{@dotless{i}}a, o nula (let ((string (delete-and-extract-region beg end)))

source: ;; `when' is an `if' clause that cannot take an `else-part'. ;; Emacs normally sets the value of `last-command' to the ;; previous command.
es: ;; `cuando' es una cl@'ausula `if' que no puede tomar `else-part'. ;; Emacs normalmente asigna el valor del `last-command' al ;; comando previo.

source: ;; `kill-append' concatenates the new string and the old. ;; `kill-new' inserts text into a new item in the kill ring. (when string (if (eq last-command 'kill-region) ;; if true, prepend string (kill-append string (< end beg)) (kill-new string))) (setq this-command 'kill-region))
es: ;; `kill-append' concatena la nueva cadena y la vieja. ;; `kill-new' inserta texto dentro de un nuevo ;; @'{@dotless{i}}tem dentro de un nuevo @'{@dotless{i}} en ;; kill ring. (when string (if (eq last-command 'kill-region) ;; si verdadero, concatena la cadena (kill-append string (< end beg)) (kill-new string))) (setq this-command 'kill-region))

source: ;; 3. The third argument to `condition-case' tells the interpreter ;; what to do with an error.
es: ;; 3. El tercer argumento para `condition-case' cuenta el int@'erprete ;; que hacer con un error.

source: ((buffer-read-only text-read-only) ;; this is the if-part ;; then... (copy-region-as-kill beg end)
es: ((buffer-read-only text-read-only) ;; esta el la parte if ;; entonces... (copy-region-as-kill beg end)

source: (if kill-read-only-ok ;; usually this variable is nil (message "Read only text copied to kill ring") ;; or else, signal an error if the buffer is read-only; (barf-if-buffer-read-only) ;; and, in any case, signal that the text is read-only. (signal 'text-read-only (list (current-buffer)))))))
es: (if kill-read-only-ok ;; normalmente esta variable es nula (message "Lee el texto copiado al kill ring") ;; o sino, se@~nala un error si el b@'uffer es de solo lectura; (barf-if-buffer-read-only) ;; y, en cualquier caso, se@~nala el texto de solo lectura. (signal 'text-read-only (list (current-buffer)))))))

source: As we have seen earlier (@pxref{Making Errors, , Generate an Error Message}), when the Emacs Lisp interpreter has trouble evaluating an expression, it provides you with help; in the jargon, this is called ``signaling an error''. Usually, the computer stops the program and shows you a message.
es: Como se ha visto antes (@pxref{Creando errores, , Genera un Mensaje de Error}), cuando el int@'erprete Emacs Lisp tiene problemas evaluando una expresi@'on, se provee de una ayuda; en jerga, se dice ``signaling an error'' @emph{se@~nalando un error}. Normalmente, el ordenador para el programa y te muestra un mensaje.

source: However, some programs undertake complicated actions. They should not simply stop on an error. In the @code{kill-region} function, the most likely error is that you will try to kill text that is read-only and cannot be removed. So the @code{kill-region} function contains code to handle this circumstance. This code, which makes up the body of the @code{kill-region} function, is inside of a @code{condition-case} special form.
es: Sin embargo, algunos programas garantizan acciones complicadas. Eso no parar@'{@dotless{i}}a en un error. En la funci@'on @code{kill-region}, la mayor@'{@dotless{i}}a parece un error que intentar@'a cortar texto que es de solo lectura y no puede ser eliminado. As@'{@dotless{i}} la funci@'on @code{kill-region} contiene c@'odigo para manejar esta circunstancia. Este c@'odigo, hace que el cuerpo de la funci@'on @code{kill-region}, est@'e dentro de una forma especial @code{condition-case}.

source: The template for @code{condition-case} looks like this:
es: La plantilla para @code{condition-case} se parece a esto:

source: The second argument, @var{bodyform}, is straightforward. The @code{condition-case} special form causes the Lisp interpreter to evaluate the code in @var{bodyform}. If no error occurs, the special form returns the code's value and produces the side-effects, if any.
es: El segundo argumento, @var{bodyform} es sencillo. La forma especial @code{condition-case} causa que el int@'erprete Lisp eval@'ue el c@'odigo en @var{bodyform}. Si ning@'un error ocurre, la forma especial devuelve el valor del c@'odigo y produce efectos laterales, si hay.

source: In short, the @var{bodyform} part of a @code{condition-case} expression determines what should happen when everything works correctly.
es: En resumen, la parte @var{bodyform} de una expresi@'on @code{condition-case} determina qu@'e ocurre cuando cualquier cosa funciona correctamente.

source: However, if an error occurs, among its other actions, the function generating the error signal will define one or more error condition names.
es: Sin embargo, si un error ocurre, entre sus otras acciones, la funci@'on genera la se@~nal de error que definir@'a uno o m@'as errores de nombres de condici@'on.

source: An error handler is the third argument to @code{condition case}. An error handler has two parts, a @var{condition-name} and a @var{body}. If the @var{condition-name} part of an error handler matches a condition name generated by an error, then the @var{body} part of the error handler is run.
es: Un manejador de errores es el tercer argumento para @code{condition-case}. Un manejador de errores tiene dos partes, un @var{condition-name} y un @var{body}. Si la parte @var{condition-name} tiene un manejador de errores encuentra un nombre de condici@'on generado por un error, entonces la parte del @var{body} del manejador de errores se ejecuta.

source: As you will expect, the @var{condition-name} part of an error handler may be either a single condition name or a list of condition names.
es: Como se esperar@'{@dotless{i}}a, la parte @var{condition-name} de un manejador de errores puede ser as@'{@dotless{i}}, un nombre de condici@'on simple o una lista de nombres de condici@'on.

source: Also, a complete @code{condition-case} expression may contain more than one error handler. When an error occurs, the first applicable handler is run.
es: Tambi@'en, una expresi@'on completa @code{condition-case} puede contener m@'as de un manejador de errores. Cuando un error ocurre, el primer manejador aplicable se ejecuta.

source: Lastly, the first argument to the @code{condition-case} expression, the @var{var} argument, is sometimes bound to a variable that contains information about the error. However, if that argument is nil, as is the case in @code{kill-region}, that information is discarded.
es: Finalmente, el primer argumento a la expresi@'on @code{condition-case}, es el argumento @var{var}, que es algunas veces asignado a una variable que contiene informaci@'on acerca del error. Sin embargo, si este argumento es nulo, como es el caso en @code{kill-region}, esta informaci@'on se descarta.

source: In brief, in the @code{kill-region} function, the code @code{condition-case} works like this:
es: En breve, en la funci@'on @code{kill-region}, el c@'odigo @code{condition-case} funciona as@'{@dotless{i}}:

source: @var{If no errors}, @var{run only this code} @var{but}, @var{if errors}, @var{run this other code}.
es: @var{Si no hay errores}, @var{ejecuta solo este c@'odigo} @var{pero}, @var{si hay errores}, @var{ejecuta este otro c@'odigo}.

source: The part of the @code{condition-case} expression that is evaluated in the expectation that all goes well has a @code{when}. The code uses @code{when} to determine whether the @code{string} variable points to text that exists.
es: La parte de la expresi@'on @code{condition-case} que se eval@'ua en la expectativa de que todo va bien si tiene un @code{when}. El c@'odigo usa @code{when} para determinar si la variable @code{string} (@emph{cadena}) apunta al texto que existe.

source: A @code{when} expression is simply a programmers' convenience. It is an @code{if} without the possibility of an else clause. In your mind, you can replace @code{when} with @code{if} and understand what goes on. That is what the Lisp interpreter does.
es: Una expresi@'on @code{when} es simplemente una conveniencia de programadores. Eso es un @code{if} sin la posibilidad de una cl@'ausula else. En tu mente, se puede reemplazar @code{when} con @code{if} y comprender de que va. Esto es lo que el int@'erprete Lisp hace.

source: Technically speaking, @code{when} is a Lisp macro. A Lisp @dfn{macro} enables you to define new control constructs and other language features. It tells the interpreter how to compute another Lisp expression which will in turn compute the value. In this case, the `other expression' is an @code{if} expression.
es: T@'ecnicamente hablando, @code{when} es una macro Lisp. Una @dfn{macro} Lisp permite definir una nueva construcci@'on de control y otras funcionalidades del lenguaje. Eso cuenta al int@'erprete c@'omo computar otra expresi@'on Lisp que dejar@'a de computar el valor. En este caso, la `otra expresi@'on' es una expresi@'on @code{if}.

source: The @code{kill-region} function definition also has an @code{unless} macro; it is the converse of @code{when}. The @code{unless} macro is an @code{if} without a then clause
es: La definici@'on de funci@'on tambi@'en tiene una macro @code{unless}; que acompa@~na a @code{when}. La macro @code{unless} es un @code{if} sin una cl@'ausula then.

source: For more about Lisp macros, see @ref{Macros, , Macros, elisp, The GNU Emacs Lisp Reference Manual}. The C programming language also provides macros. These are different, but also useful.
es: Para m@'as acerca de macros Lisp, ver @ref{Macros, , Macros, elisp, El Manual de Referencia de Emacs Lisp}. El lenguaje de programaci@'on C tambi@'en provee macros. Estos son diferentes, pero tambi@'en @'utiles.

source: Regarding the @code{when} macro, in the @code{condition-case} expression, when the string has content, then another conditional expression is executed. This is an @code{if} with both a then-part and an else-part.
es: Guardando la macro @code{when}, en la expresi@'on @code{condition-case}, cuando la cadena tiene contenido, entonces otra expresi@'on condicional se ejecuta. Esto es un @code{if} tanto con una then-part y como con una else-part.

source: The then-part is evaluated if the previous command was another call to @code{kill-region}; if not, the else-part is evaluated.
es: La parte then (then-part) se eval@'ua si el comando previo fu@'e otra llamada para @code{kill-region}; si no, se eval@'ua la parte else (else-part)

source: @code{yank-handler} is an optional argument to @code{kill-region} that tells the @code{kill-append} and @code{kill-new} functions how deal with properties added to the text, such as `bold' or `italics'.
es: @code{yank-handler} es un argumento opcional para @code{kill-region} que cuenta c@'omo las funciones @code{kill-append} y @code{kill-new} se tratan con propiedades a@~nadidas al texto, tal como `negrilla' o `it@'alica'.

source: @code{last-command} is a variable that comes with Emacs that we have not seen before. Normally, whenever a function is executed, Emacs sets the value of @code{last-command} to the previous command.
es: @code{last-command} es una variable que viene con Emacs y que no se ha visto antes. Normalmente, siempre y cuando una funci@'on se ejecute, Emacs asigna el valor de @code{last-command} al comando previo.

source: In this segment of the definition, the @code{if} expression checks whether the previous command was @code{kill-region}. If it was,
es: En este segmento de la definici@'on, la expresi@'on @code{if} chequea si el comando previo era @code{kill-region}. Si era eso,

source: concatenates a copy of the newly clipped text to the just previously clipped text in the kill ring.
es: Se concatena una copia del nuevo texto cortado al texto cortado previamente en el kill ring @emph{anillo de la muerte}.

source: The @code{copy-region-as-kill} function copies a region of text from a buffer and (via either @code{kill-append} or @code{kill-new}) saves it in the @code{kill-ring}.
es: La funci@'on @code{copy-region-as-kill} copia una regi@'on de texto desde un b@'uffer y (via @code{kill-append} o @code{kill-new}) lo guarda en el @code{kill-ring}.

source: If you call @code{copy-region-as-kill} immediately after a @code{kill-region} command, Emacs appends the newly copied text to the previously copied text. This means that if you yank back the text, you get it all, from both this and the previous operation. On the other hand, if some other command precedes the @code{copy-region-as-kill}, the function copies the text into a separate entry in the kill ring.
es: Si se llama a @code{copy-region-as-kill} inmediatamente despu@'es de un comando @code{kill-region}, Emacs inserta el texto nuevamente copiado al texto copiado previamente. Esto significa que si se pega el texto, se obtiene todo, tanto esto, como la operaci@'on previa. Por otro lado, si alg@'un otro comando precede la @code{copy-region-as-kill}, la funci@'on copia el texto dentro de una entrada separada el kill ring @emph{anillo de la muerte}.

source: The complete @code{copy-region-as-kill} function definition
es: La definici@'on de la funci@'on completa @code{copy-region-as-kill}.

source: Here is the complete text of the version 22 @code{copy-region-as-kill} function:
es: Aqu@'{@dotless{i}} est@'a el texto completo de la versi@'on 22 de la funci@'on @code{copy-region-as-kill}:

source: (defun copy-region-as-kill (beg end) "Save the region as if killed, but don't kill it. In Transient Mark mode, deactivate the mark. If `interprogram-cut-function' is non-nil, also save the text for a window system cut and paste." (interactive "r")
es: (defun copy-region-as-kill (beg end) "Guarda la regi@'on como si estuviera cortada, pero no la cortes. En el modo Marca de Tr@'ansito @emph{Transient Mark}, se desactiva la marca. Si `interprogram-cut-function' es no nulo, tambi@'en se guarda el texto para una sistema de ventanas de cortar y pegar." (interactive "r")

source: As usual, this function can be divided into its component parts:
es: De normal, esta funci@'on puede ser dividida dentro sus componentes:

source: The arguments are @code{beg} and @code{end} and the function is interactive with @code{"r"}, so the two arguments must refer to the beginning and end of the region. If you have been reading though this document from the beginning, understanding these parts of a function is almost becoming routine.
es: Los argumentos son @code{beg} y @code{end} y la funci@'on es interactiva con @code{"r"}, as@'{@dotless{i}} los dos argumentos deben referirse al principio y al final de la regi@'on. Si ha estado leyendo a trav@'es de este documento desde el principio, comprendiendo estas partes de una funci@'on casi llegar@'{@dotless{i}}a a ser rutina.

source: The documentation is somewhat confusing unless you remember that the word `kill' has a meaning different from usual. The `Transient Mark' and @code{interprogram-cut-function} comments explain certain side-effects.
es: La documentaci@'on es algo confusa a menos que se recuerde que la palabra `kill' @emph{matar, cortar} tiene un significado diferente de la usual. La `Marca Transitoria' y @code{interprogram-cut-function} comenta explicar ciertos efectos laterales.

source: After you once set a mark, a buffer always contains a region. If you wish, you can use Transient Mark mode to highlight the region temporarily. (No one wants to highlight the region all the time, so Transient Mark mode highlights it only at appropriate times. Many people turn off Transient Mark mode, so the region is never highlighted.)
es: Despu@'es de que se ha asignado una marca, un b@'uffer siempre contiene una regi@'on. Si se desea se puede usar el modo Marca Transitoria para iluminar la regi@'on temporalmente. (Nadie quiere iluminar la regi@'on todo el rato, as@'{@dotless{i}} el modo Marca Transitoria subrraya solo en el momento apropiado. Muchas personas desactivan el modo Marca Transitoria, as@'{@dotless{i}} la regi@'on nunca se ilumina.)

source: Also, a windowing system allows you to copy, cut, and paste among different programs. In the X windowing system, for example, the @code{interprogram-cut-function} function is @code{x-select-text}, which works with the windowing system's equivalent of the Emacs kill ring.
es: Tambi@'en, un sistema de ventanas permite copiar, cortar y pegar entre programas diferentes. En el sistema de X windows, por ejemplo, la funci@'on @code{interprogram-cut-function} es @code{x-select-text}, que funciona con el sistema de ventanas equivalente del kill ring de Emacs.

source: The body of the @code{copy-region-as-kill} function starts with an @code{if} clause. What this clause does is distinguish between two different situations: whether or not this command is executed immediately after a previous @code{kill-region} command. In the first case, the new region is appended to the previously copied text. Otherwise, it is inserted into the beginning of the kill ring as a separate piece of text from the previous piece.
es: El cuerpo de la funci@'on @code{copy-region-as-kill} empieza con una cl@'ausula @code{if}. Lo que esta cl@'ausula hace es distinguir entre dos situaciones diferentes: si este comando se ejecuta o no inmediatamente despu@'es de un comando previo @code{kill-region}. En el primer caso, la nueva regi@'on se concatena al texto copiado previamente. De otro modo, eso se inserta al principio del anillo de la muerte @emph{kill ring} como una pieza separada de texto desde la pieza previa.

source: The last two lines of the function prevent the region from lighting up if Transient Mark mode is turned on.
es: Las dos l@'{@dotless{i}}neas de la funci@'on previene la regi@'on desde la iluminaci@'on si el modo Transient Mark @emph{Marca Transitoria} est@'a activado.

source: The body of @code{copy-region-as-kill} merits discussion in detail.
es: El cuerpo de @code{copy-region-as-kill} merece discusi@'on en detalle.

source: The @code{copy-region-as-kill} function works in much the same way as the @code{kill-region} function. Both are written so that two or more kills in a row combine their text into a single entry. If you yank back the text from the kill ring, you get it all in one piece. Moreover, kills that kill forward from the current position of the cursor are added to the end of the previously copied text and commands that copy text backwards add it to the beginning of the previously copied text. This way, the words in the text stay in the proper order.
es: La funci@'on @code{copy-region-as-kil} funciona de un modo parecido a la funci@'on @code{kill-region}. Ambas est@'an escritas de un modo que dos o m@'as textos cortados en una fila combinan su texto en una entrada simple. Si se pega el texto desde el anillo de la muerte @emph{kill ring}, se tiene todo en una pieza. M@'as all@'a, los cortes de textos que se cortan hacia adelante desde la posici@'on actual del cursor se a@~naden al fin del texto copiado previamente y comanda este texto copiado vaya hacia atr@'as al principio del texto copiado previamente. De este modo, las palabras en el texto est@'an en el orden apropiado.

source: Like @code{kill-region}, the @code{copy-region-as-kill} function makes use of the @code{last-command} variable that keeps track of the previous Emacs command.
es: Como @code{kill-region}, la funci@'on @code{copy-region-as-kill} hace uso de la variable @code{last-command} que deja traza del comando de Emacs previo.

source: @code{last-command} and @code{this-command}
es: @code{last-command} y @code{this-command}

source: Normally, whenever a function is executed, Emacs sets the value of @code{this-command} to the function being executed (which in this case would be @code{copy-region-as-kill}). At the same time, Emacs sets the value of @code{last-command} to the previous value of @code{this-command}.
es: Normalmente, siempre y cuando una funci@'on se ejecuta, Emacs asigna el valor de @code{this-command} a la funci@'on que se ejecuta (que en este caso ser@'{@dotless{i}}a @code{copy-region-as-kill}). Al mismo tiempo, Emacs asigna el valor de @code{last-command} al valor previo de @code{this-command}.
