Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: If the tags table you want has been created, you can use the @code{M-x visit-tags-table} command to specify it. Otherwise, you will need to create the tag table yourself and then use @code{M-x visit-tags-table}.
es: Si la tabla de etiquetas que se quiere ha sido creada, se puede usar el comando @code{M-x visit-tags-table} para especificarlo. De otro modo, se necesitar@'a la tabla de etiquetas por t@'{@dotless{i}} mismo y entonces usar @code{M-x visit-tags-table}.

source: Building Tags in the Emacs sources
es: Construyendo Etiquetas en las fuentes Emacs

source: Tags in the Emacs sources
es: Etiquetas en las fuentes Emacs

source: make tags
es: crear etiquetas

source: The GNU Emacs sources come with a @file{Makefile} that contains a sophisticated @code{etags} command that creates, collects, and merges tags tables from all over the Emacs sources and puts the information into one @file{TAGS} file in the @file{src/} directory. (The @file{src/} directory is below the top level of your Emacs directory.)
es: Las fuentes GNU Emacs vienen con un @file{Makefile} que contiene un comando sofisticado @code{etags} que crea, recoge, y asocia tablas de etiquetas de todas las fuentes de Emacs y pone la informaci@'on dentro de un fichero @file{TAGS} en el directorio @file{src/}. (El directorio @file{src/} est@'a debajo del alto nivel de tu directorio Emacs.)

source: To build this @file{TAGS} file, go to the top level of your Emacs source directory and run the compile command @code{make tags}:
es: Para construir este fichero @file{TAGS}, se puede ir al alto nivel de directorio de fuentes Emacs y ejecutar el comando de compilar @code{make tags}:

source: (The @code{make tags} command works well with the GNU Emacs sources, as well as with some other source packages.)
es: (El comando @code{make tags} trabaja bien con las fuentes de GNU Emacs, tan bien como con otros paquetes fuentes.)

source: For more information, see @ref{Tags, , Tag Tables, emacs, The GNU Emacs Manual}.
es: Para m@'as informaci@'on, mira @ref{Etiquetas, , Tablas de Etiquetas, emacs, El Manual GNU Emacs}.

source: Regexp Review
es: Revisar regexp

source: Repeatedly evaluate the body of the expression so long as the first element of the body tests true. Then return @code{nil}. (The expression is evaluated only for its side effects.)
es: Repetidamente eval@'ua el cuerpo de la expresi@'on tan larga como el primer elemento del cuerpo chequea cierto. Entonces devuelve @code{nil}. (La expresi@'on es evaluado solo por sus efectos laterales.)

source: (The @code{insert} function inserts its arguments at point; the @code{format} function returns a string formatted from its arguments the way @code{message} formats its arguments; @code{\n} produces a new line.)
es: (La funci@'on @code{insert} inserta sus argumentos en el punto; la funci@'on @code{format} devuelve una cadena formateada desde sus argumentos el camino @code{message} formatea sus argumentos; @code{\n} produce una nueva l@'{@dotless{i}}nea.)

source: Search for a pattern, and if the pattern is found, move point to rest just after it.
es: Busca un patr@'on, y si el patr@'on se encuentra, mueve el punto al resto solo despu@'es de eso.

source: Takes four arguments, like @code{search-forward}:
es: Toma cuatro argumentos, como @code{search-forward}:

source: A regular expression that specifies the pattern to search for. (Remember to put quotation marks around this argument!)
es: Una expresi@'on regular que especifica el patr@'on para buscarlo. (@exclamdown{}Recuerda por marcas de comillas alrededor de este argumento!)

source: Bind some variables locally to particular values, and then evaluate the remaining arguments, returning the value of the last one. While binding the local variables, use the local values of variables bound earlier, if any.
es: Asocia algunas variables localmente a valores particulares, y entonces eval@'ua los argumentos que permanencen, devolviendo el valor del @'ultimo. Mientras se asocian las variables locales, se usan los valores locales de variables asociadas pronto, si acaso.

source: Return the position of the start of the text found by the last regular expression search.
es: Devuelve la posici@'on del principio del texto encontrado por la @'ultima b@'usqueda de la expresi@'on regular.

source: Return @code{t} for true if the text after point matches the argument, which should be a regular expression.
es: Devuelve @code{t} para verdadero si el texto despu@'es del punto se asocia al argumento, que deber@'{@dotless{i}}a ser una expresi@'on.

source: Return @code{t} for true if point is at the end of the accessible part of a buffer. The end of the accessible part is the end of the buffer if the buffer is not narrowed; it is the end of the narrowed part if the buffer is narrowed.
es: Devuelve @code{t} para cierto si el punto est@'a en el fin de la parte accesible de un b@'uffer. El fin de la parte accesible es el fin del b@'uffer no est@'a encogido; eso es el fin de la parte encogida si el b@'uffer est@'a encogido.

source: Exercises with @code{re-search-forward}
es: Ejercicios con @code{re-search-forward}

source: Write a function to search for a regular expression that matches two or more blank lines in sequence.
es: Escribe una funci@'on para buscar para una expresi@'on que detecte dos o m@'as l@'{@dotless{i}}neas blancas en secuencia.

source: Write a function to search for duplicated words, such as `the the'. @xref{Regexps, , Syntax of Regular Expressions, emacs, The GNU Emacs Manual}, for information on how to write a regexp (a regular expression) to match a string that is composed of two identical halves. You can devise several regexps; some are better than others. The function I use is described in an appendix, along with several regexps. @xref{the-the, , @code{the-the} Duplicated Words Function}.
es: Escribe una funci@'on para buscar palabras duplicadas, tales como `el el'. @xref{Regexps, , Sintaxis para Expresiones Regulares, emacs, El Manual de GNU Emacs}, para informaci@'on de c@'omo escribir un regexp (una expresi@'on regular) para asociar una cadena que se compone de dos mitades id@'enticas. Se puede disponer de varios regexps; algunos son mejores que otros. La funci@'on que se usa es descrito en un ap@'endice, a lo largo de varios regexps. @xref{the-the, , Funci@'on de Palabras Duplicadas @code{the-the}}.

source: Repetition for word counting
es: Repetici@'on para contar palabras

source: Regular expressions for word counting
es: Expresiones regulares para contar palabras

source: Repetition and regular expression searches are powerful tools that you often use when you write code in Emacs Lisp. This chapter illustrates the use of regular expression searches through the construction of word count commands using @code{while} loops and recursion.
es: La repetici@'on y b@'usqueda de expresiones regulares son herramientas poderosas que con frecuencia se usan cuando se escribe c@'odigo en Emacs Lisp. Este cap@'{@dotless{i}}tulo ilustra el uso de b@'usqueda de expresiones regulares a trav@'es de la construcci@'on de comandos de contaje de palabras usando bucles @code{while} y recursi@'on.

source: Why Count Words
es: Por qu@'e Contar Palabras

source: Counting words
es: Contando palabras

source: The standard Emacs distribution contains functions for counting the number of lines and words within a region.
es: La distribuci@'on de Emacs est@'andar contiene una funci@'on para contar el n@'umero de l@'{@dotless{i}}neas en una regi@'on.

source: Certain types of writing ask you to count words. Thus, if you write an essay, you may be limited to 800 words; if you write a novel, you may discipline yourself to write 1000 words a day. It seems odd, but for a long time, Emacs lacked a word count command. Perhaps people used Emacs mostly for code or types of documentation that did not require word counts; or perhaps they restricted themselves to the operating system word count command, @code{wc}. Alternatively, people may have followed the publishers' convention and computed a word count by dividing the number of characters in a document by five.
es: Hay cierto tipo de pregunta escrita para contar palabras. De este modo, si se escribe un ensayo, puede limitarse a 800 palabras; si se escribe una novela, te puedes disciplinar a ti mismo a escribir 1000 palabras al d@'{@dotless{i}}a. Parece raro, pero durante mucho tiempo, a Emacs le falt@'o un comando para contar palabras. Quiz@'as la gente usaba Emacs mayoritariamente para codificar o documentar cosas que no requieren contar palabras, o quiz@'as se restring@'{@dotless{i}}an al sistema operativo el comando de contar palabras, @code{wc}. De manera alternativa, la gente puede seguir la convenci@'on de las editoriales y computaban un contaje de palabras dividiendo el n@'umero de caracteres en un documento por cinco.

source: There are many ways to implement a command to count words. Here are some examples, which you may wish to compare with the standard Emacs command, @code{count-words-region}.
es: Hay mucho caminos para implementar un comando para contar palabras. Aqu@'{@dotless{i}} hay algunos ejemplos, que pueden desear compararse con el comando de Emacs est@'andar, @code{count-words-region}.

source: A word count command could count words in a line, paragraph, region, or buffer. What should the command cover? You could design the command to count the number of words in a complete buffer. However, the Emacs tradition encourages flexibility---you may want to count words in just a section, rather than all of a buffer. So it makes more sense to design the command to count the number of words in a region. Once you have a command to count words in a region, you can, if you wish, count words in a whole buffer by marking it with @w{@kbd{C-x h}} (@code{mark-whole-buffer}).
es: Un comando de contar palabras podr@'{@dotless{i}}a contar palabras en una l@'{@dotless{i}}nea, p@'arrafo, regi@'on, o b@'uffer. @questiondown{}Qu@'e comando funcionar@'{@dotless{i}}a? Se podr@'{@dotless{i}}a dise@~nar el comando para contar el n@'umero de palabras en un b@'uffer completo. Sin embargo, la tradici@'on Emacs anima a la flexibilidad --- se puede querer contar palabras solo en una secci@'on, en vez de en todo un b@'uffer. As@'{@dotless{i}}, tiene m@'as sentido dise@~nar el comando para contar el n@'umero de palabras en una regi@'on. Una vez tienes un comando @code{count-words-region}, se puede, si desea, contar palabras en un b@'uffer completo marc@'andolo con @w{@kbd{C-x h}} (@code{mark-whole-buffer}).

source: Clearly, counting words is a repetitive act: starting from the beginning of the region, you count the first word, then the second word, then the third word, and so on, until you reach the end of the region. This means that word counting is ideally suited to recursion or to a @code{while} loop.
es: Claramente, contar palabras es un acto repetitivo: empezando desde el principio de la regi@'on, se cuenta la primera palabra, entonces la segunda palabra, entonces la tercera palabra, y as@'{@dotless{i}}, hasta que logres el fin de la regi@'on. Esto significa que contar palabras se ajusta idealmente a recursi@'on o a un bucle @code{while}.

source: Designing @code{@value{COUNT-WORDS}}
es: Dise@~nando @code{@value{COUNT-WORDS}}

source: First, we will implement the word count command with a @code{while} loop, then with recursion. The command will, of course, be interactive.
es: Primero, implementaremos el comando de contar palabras con un bucle @code{while}, entonces con la recursi@'on. El comando, de acuerdo, ser@'a interactivo.

source: The template for an interactive function definition is, as always:
es: La plantilla para una definici@'on de funci@'on interactiva es, como siempre:

source: What we need to do is fill in the slots.
es: Lo que necesitamos hacer es rellenar los slots.

source: The name of the function should be self-explanatory and similar to the existing @code{count-lines-region} name. This makes the name easier to remember. @code{count-words-region} is the obvious choice. Since that name is now used for the standard Emacs command to count words, we will name our implementation @code{@value{COUNT-WORDS}}.
es: El nombre de la funci@'on ser@'{@dotless{i}}a auto-explicativo y similar al nombre del @code{count-lines-region} existente. Esto hace que el nombre sea f@'acil de recordar. @code{count-words-region} es una buena elecci@'on. Puesto que el nombre se usa ahora para el comando de Emacs est@'andar para contar palabras, nosotros nombraremos nuestra implementaci@'on como @code{@value{COUNT-WORDS}}.

source: The function counts words within a region. This means that the argument list must contain symbols that are bound to the two positions, the beginning and end of the region. These two positions can be called @samp{beginning} and @samp{end} respectively. The first line of the documentation should be a single sentence, since that is all that is printed as documentation by a command such as @code{apropos}. The interactive expression will be of the form @samp{(interactive "r")}, since that will cause Emacs to pass the beginning and end of the region to the function's argument list. All this is routine.
es: La funci@'on cuenta palabras con una regi@'on. Esto significa que el argumento lista debe contener s@'{@dotless{i}}mbolos que son asociados a las dos posiciones, el principio y fin de la regi@'on. Estas dos posiciones puede ser llamadas @samp{beginning} y @samp{end} respectivamente. La primera l@'{@dotless{i}}nea de la documentaci@'on ser@'{@dotless{i}}a una frase simple, desde que esto es todo lo que est@'a impreso como documentaci@'on por un comando tal como @code{apropos}. La expresi@'on interactiva ser@'a de la forma @samp{(interactive "r")}, puesto que causar@'a que Emacs pase al principio y fin de la regi@'on a la lista de argumentos de funci@'on. Todo esto es rutina.

source: The body of the function needs to be written to do three tasks: first, to set up conditions under which the @code{while} loop can count words, second, to run the @code{while} loop, and third, to send a message to the user.
es: El cuerpo de la funci@'on necesita ser escrita para hacer tres tareas: primero, configurar condiciones bajo las que el bucle @code{while} pueda contar palabras, segundo, ejecutar el bucle @code{while}, y tercero, enviar un mensaje al usuario.

source: When a user calls @code{@value{COUNT-WORDS}}, point may be at the beginning or the end of the region. However, the counting process must start at the beginning of the region. This means we will want to put point there if it is not already there. Executing @code{(goto-char beginning)} ensures this. Of course, we will want to return point to its expected position when the function finishes its work. For this reason, the body must be enclosed in a @code{save-excursion} expression.
es: Cuando un usuario llama a @code{@value{COUNT-WORDS}}, apunta a que puede estar al principio o fin de la regi@'on. Sin embargo, el proceso de conteo debe empezar al principio de la regi@'on. Esto significa que querremos poner el punto que hay si eso no est@'a all@'{@dotless{i}}. Ejecutando @code{(goto-char beginning)} asegura esto. De acuerdo, querremos devolver el punto a su posici@'on esperada cuando la funci@'on finalice su trabajo. Por esta raz@'on, el cuerpo debe ser encerrado en una expresi@'on @code{save-excursion}.

source: The central part of the body of the function consists of a @code{while} loop in which one expression jumps point forward word by word, and another expression counts those jumps. The true-or-false-test of the @code{while} loop should test true so long as point should jump forward, and false when point is at the end of the region.
es: La parte central del cuerpo de la funci@'on consiste en un bucle @code{while} en el que una expresi@'on salta el punto hacia delante palabra por palabra, y otra expresi@'on cuenta estos saltos. Si el test-verdadero-o-falso del bucle @code{while} es verdadero, el punto saltar@'{@dotless{i}}a hacia adelante, y si es falso el punto estar@'{@dotless{i}}a al fin de la regi@'on.

source: We could use @code{(forward-word 1)} as the expression for moving point forward word by word, but it is easier to see what Emacs identifies as a `word' if we use a regular expression search.
es: Nosotros podr@'{@dotless{i}}amos usar @code{(forward-word 1)} como la expresi@'on para mover el punto hacia adelante palabra por palabra, pero eso es f@'acil de ver que Emacs identifica como una `palabra' si se usa una b@'usqueda de expresi@'on regular.

source: A regular expression search that finds the pattern for which it is searching leaves point after the last character matched. This means that a succession of successful word searches will move point forward word by word.
es: Una expresi@'on regular busca lo que encuentra el patr@'on que se est@'a buscando deja el punto despu@'es del @'ultimo car@'acter emparejado. Esto significa que una sucesi@'on de palabras exitosas busquen que mover@'a el punto adelante palabra por palabra.

source: As a practical matter, we want the regular expression search to jump over whitespace and punctuation between words as well as over the words themselves. A regexp that refuses to jump over interword whitespace would never jump more than one word! This means that the regexp should include the whitespace and punctuation that follows a word, if any, as well as the word itself. (A word may end a buffer and not have any following whitespace or punctuation, so that part of the regexp must be optional.)
es: Como materia pr@'actica, se quiere que la expresi@'on regular se busque para saltar a trav@'es de un espacio en blanco y punt@'ue entre palabras tan bien a trav@'es de las palabras en s@'{@dotless{i}}. Una expresi@'on regexp que rechaza para saltar a trav@'es de espacios en blanco entre palabras @exclamdown{}nunca saltar@'{@dotless{i}}a m@'as de una palabra!. Esto significa que el regexp incluir@'{@dotless{i}}a el espacio en blanco y la puntuaci@'on sigue a una palabra cualquiera, como la palabra en s@'{@dotless{i}}. (Una palabra puede finalizar un b@'uffer y no tiene cualquier espacio en blanco o puntuaci@'on, as@'{@dotless{i}} esta parte del regexp debe ser opcional.)

source: Thus, what we want for the regexp is a pattern defining one or more word constituent characters followed, optionally, by one or more characters that are not word constituents. The regular expression for this is:
es: De este modo, queremos para el regexp es un patr@'on definiendo una o m@'as palabras de caracteres que constituyen caracteres seguidos, opcionalmente, por uno o m@'as caracteres que no son palabras constituyentes. La expresi@'on regular para esto es:

source: The buffer's syntax table determines which characters are and are not word constituents. For more information about syntax, @pxref{Syntax Tables, , Syntax Tables, elisp, The GNU Emacs Lisp Reference Manual}.
es: La tabla de sintaxis del b@'uffer determina qu@'e caracteres son y no son palabras constituyentes. Para m@'as informaci@'on acerca de sintaxis, @pxref{Tablas de Sintaxis, , Tablas de Sintaxis, elisp, El Manual de Referencia de GNU Emacs Lisp}.

source: The search expression looks like this:
es: La expresi@'on se parece a esto:

source: (Note that paired backslashes precede the @samp{w} and @samp{W}. A single backslash has special meaning to the Emacs Lisp interpreter. It indicates that the following character is interpreted differently than usual. For example, the two characters, @samp{\n}, stand for @samp{newline}, rather than for a backslash followed by @samp{n}. Two backslashes in a row stand for an ordinary, `unspecial' backslash, so Emacs Lisp interpreter ends of seeing a single backslash followed by a letter. So it discovers the letter is special.)
es: (Note que las barras invertidas que preceden el @samp{w} y @samp{W}. Una barra invertida tiene significado especial al int@'erprete Emacs Lisp. Eso indica que el caracter siguiente es interpretado de manera diferente que la normal. Por ejemplo, los dos caracteres, @samp{\n}, son una @samp{nueva l@'{@dotless{i}}nea}, en vez de una barra invertida seguida por @samp{\n}. Dos barras invertidas en una fila para una `barra invertida no especial', as@'{@dotless{i}} Emacs Lisp interpreta el fin de mirar una barra invertida simple seguida por una letra. As@'{@dotless{i}} descubre la letra que es especial.)

source: We need a counter to count how many words there are; this variable must first be set to 0 and then incremented each time Emacs goes around the @code{while} loop. The incrementing expression is simply:
es: Se necesita un contador para contar cu@'antas palabras hay; esta variables debe primero ser asignado a 0 y entonces incrementados cada vez que Emacs va alrededor del bucle @code{while}. La expresi@'on de incremento es simple:

source: Finally, we want to tell the user how many words there are in the region. The @code{message} function is intended for presenting this kind of information to the user. The message has to be phrased so that it reads properly regardless of how many words there are in the region: we don't want to say that ``there are 1 words in the region''. The conflict between singular and plural is ungrammatical. We can solve this problem by using a conditional expression that evaluates different messages depending on the number of words in the region. There are three possibilities: no words in the region, one word in the region, and more than one word. This means that the @code{cond} special form is appropriate.
es: Finalmente, se quiere contar al usuario cu@'antas palabras hay en la regi@'on. La funci@'on @code{message} presenta este tipo de informaci@'on al usuario. El mensaje tiene que ser fraseado de manera que se lea apropiadamente sin cuidado de cuantas palabras hay en la regi@'on: no se quiere decir que ``hay una palabra en la regi@'on''. El conflicto entre singular y plural no es gramatical. Se puede resolver este problema usando una expresi@'on condicional que eval@'ua diferentes mensajes dependiendo en el n@'umero de palabras en la regi@'on. Hay tres posibilidades: no palabras en la regi@'on, una palabra en la regi@'on, y m@'as de una palabra. Esto significa que la forma especial @code{cond} es apropiada.

source: All this leads to the following function definition:
es: Todo esto lidera a la siguiente definici@'on de funci@'on:

source: ;;; @r{First version; has bugs!} (defun @value{COUNT-WORDS} (beginning end) "Print number of words in the region. Words are defined as at least one word-constituent character followed by at least one character that is not a word-constituent. The buffer's syntax table determines which characters these are." (interactive "r") (message "Counting words in region ... ")
es: ;;; @r{@exclamdown{}La Primera versi@'on; tiene errores!} (defun count-words-region (beginning end) "Imprime el n@'umero de palabras en la regi@'on. Las palabras est@'an definidas al menos una palabra constituida de caracteres seguido por al menos un caracter que no constituye palabra. La tabla de sintaxis del b@'uffer determina qu@'e caracteres hay." (interactive "r") (message "Contando palaras en la regi@'on ... ")

source: ;;; @r{1. Set up appropriate conditions.} (save-excursion (goto-char beginning) (let ((count 0))
es: ;;; @r{1. Configurar condiciones apropiadas.} (save-excursion (goto-char beginning) (let ((count 0))

source: ;;; @r{2. Run the} while @r{loop.} (while (< (point) end) (re-search-forward "\\w+\\W*") (setq count (1+ count)))
es: ;;; @r{2. Ejecutar el} @r{bucle} while. (while (< (point) end) (re-search-forward "\\w+\\W*") (setq count (1+ count)))
