Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: The following expression creates and gives initial values to the two variables @code{zebra} and @code{tiger}. The body of the @code{let} expression is a list which calls the @code{message} function.
es: La expresi@'on siguiente crea y da valores dados iniciales para las dos variables @code{zebra} y @code{tiger}. El cuerpo de la expresi@'on @code{let} es una lista que llama a la funci@'on @code{message}.

source: (let ((zebra 'stripes) (tiger 'fierce)) (message "One kind of animal has %s and another is %s." zebra tiger))
es: (let ((zebra 'rayas) (tiger 'fiero)) (message "Un tipo de animal tiene %s y otro es %s." zebra tiger))

source: Here, the varlist is @code{((zebra 'stripes) (tiger 'fierce))}.
es: Aqu@'{@dotless{i}}, la varlist es @code{((zebra 'rayas) (tiger 'fiero))}.

source: The two variables are @code{zebra} and @code{tiger}. Each variable is the first element of a two-element list and each value is the second element of its two-element list. In the varlist, Emacs binds the variable @code{zebra} to the value @code{stripes}@footnote{According to Jared Diamond in @cite{Guns, Germs, and Steel}, ``@dots{} zebras become impossibly dangerous as they grow older'' but the claim here is that they do not become fierce like a tiger. (1997, W. W. Norton and Co., ISBN 0-393-03894-2, page 171)}, and binds the variable @code{tiger} to the value @code{fierce}. In this example, both values are symbols preceded by a quote. The values could just as well have been another list or a string. The body of the @code{let} follows after the list holding the variables. In this example, the body is a list that uses the @code{message} function to print a string in the echo area.
es: Las dos variables son @code{cebra} y @code{tigre}. Cada variable es el primer elemento de una lista de dos elementos y cada valor es el segundo elemento de su lista de dos elementos. En la varlist, Emacs asocia la variable @code{cebra} al valor @code{rayas}@footnote{De acuerdo a Jared Diamond en @cite{Guns, Germs, y Steel}, ``@dots{} las cebras llegan a ser muy peligrosas a medida que crecen'' pero el clamor aqu@'{@dotless{i}} son que ellos no llegan a ser fieros como un tigre. (1997, W. W. Norton and Co., ISBN 0-393-03894-2, page 171)}, y asocia la variable @code{tigre} al valor @code{fiero}. En este ejemplo, ambos valores son s@'{@dotless{i}}mbolos precedidos por una comilla. Los valores podr@'{@dotless{i}}an ser precedidos por una comilla. Los valores podr@'{@dotless{i}}an tambi@'en haber sido otra lista o cadena. El cuerpo de @code{let} sigue despu@'es de la lista manejando las variables. En este ejemplo, el cuerpo es una lista que usa la funci@'on @code{message} para imprimir una cadena en el @'area echo.

source: You may evaluate the example in the usual fashion, by placing the cursor after the last parenthesis and typing @kbd{C-x C-e}. When you do this, the following will appear in the echo area:
es: Se puede evaluar el ejemplo en el modo usual, emplazando el cursor despu@'es de los @'ultimos par@'entesis y escribiendo @kbd{C-x C-e}. Cuando se hace esto lo siguiente aparecer@'a en el @'area echo:

source: "One kind of animal has stripes and another is fierce."
es: "Un tipo de animal tiene rayas y otro es fiero"

source: As we have seen before, the @code{message} function prints its first argument, except for @samp{%s}. In this example, the value of the variable @code{zebra} is printed at the location of the first @samp{%s} and the value of the variable @code{tiger} is printed at the location of the second @samp{%s}.
es: Como se ha visto antes, la funci@'on @code{message} imprime su primer argumento, excepto por @samp{%s}. En este ejemplo, el valor de la variable @code{zebra} es impreso en la posici@'on del primer @samp{%s} y el valor de la variable @code{tigre} es impreso en la posici@'on del segundo @samp{%s}.

source: Uninitialized Variables in a @code{let} Statement
es: Variables no inicializadas en un sentencia @code{let}

source: Uninitialized @code{let} variables
es: Variables @code{let} no inicializadas

source: @code{let} variables uninitialized
es: Variables @code{let} no inicializadas

source: If you do not bind the variables in a @code{let} statement to specific initial values, they will automatically be bound to an initial value of @code{nil}, as in the following expression:
es: Si no asocia las variables en una frase @code{let} para valores espec@'{@dotless{i}}ficos iniciales, ellos autom@'aticamente emparejan a un valor inicial de @code{nil}, como en la siguiente expresi@'on:

source: (let ((birch 3) pine fir (oak 'some)) (message "Here are %d variables with %s, %s, and %s value." birch pine fir oak))
es: (let ((abedul 3) pino abeto (roble 'algo)) (message "Aqu@'{@dotless{i}} est@'an %d variables con %s, %s, y el valor %s." abedul pino abeto roble))

source: Here, the varlist is @code{((birch 3) pine fir (oak 'some))}.
es: Aqu@'{@dotless{i}}, la varlist es @code{((abeto 3) pino roble (encina 'otro))}.

source: If you evaluate this expression in the usual way, the following will appear in your echo area:
es: Si se eval@'ua esta expresi@'on en el modo usual, aparecer@'a lo siguiente en el @'area echo:

source: "Here are 3 variables with nil, nil, and some value."
es: "Aqu@'{@dotless{i}} est@'an 3 variables con nil, nil, y alg@'un valor".

source: In this example, Emacs binds the symbol @code{birch} to the number 3, binds the symbols @code{pine} and @code{fir} to @code{nil}, and binds the symbol @code{oak} to the value @code{some}.
es: En este ejemplo, Emacs empareja el s@'{@dotless{i}}mbolo @code{abedul} al n@'umero 3, empareja los s@'{@dotless{i}}mbolos @code{pino} y @code{abeto} a @code{nil}, y empareja el s@'{@dotless{i}}mbolo @code{encina} al valor @code{otro}.

source: Note that in the first part of the @code{let}, the variables @code{pine} and @code{fir} stand alone as atoms that are not surrounded by parentheses; this is because they are being bound to @code{nil}, the empty list. But @code{oak} is bound to @code{some} and so is a part of the list @code{(oak 'some)}. Similarly, @code{birch} is bound to the number 3 and so is in a list with that number. (Since a number evaluates to itself, the number does not need to be quoted. Also, the number is printed in the message using a @samp{%d} rather than a @samp{%s}.) The four variables as a group are put into a list to delimit them from the body of the @code{let}.
es: Note que en la primera parte del @code{let}, las variables @code{pine} y @code{fir} se aloja solo como @'atomos que no est@'an rodeados por par@'entesis; esto es porque est@'an siendo emparejados a @code{nil}, la lista vac@'{@dotless{i}}a. Pero @code{oak} es emparejado a @code{otro} y as@'{@dotless{i}} es una parte de la lista @code{(oak 'otro)}. De manera similar, @code{birch} se empareja al n@'umero 3 y as@'{@dotless{i}} es una lista con este n@'umero. (Desde que un n@'umero se eval@'ua por s@'{@dotless{i}} mismo, el n@'umero no necesita ser citado. Tambi@'en, el n@'umero es impreso en el mensaje usando @samp{%d} en vez de un @samp{%s}.) Las cuatro variables como un grupo son puestas dentro de una lista para delimitarlos desde el cuerpo del @code{let}.

source: Conditional with @code{if}
es: Condicional con @code{if}

source: A third special form, in addition to @code{defun} and @code{let}, is the conditional @code{if}. This form is used to instruct the computer to make decisions. You can write function definitions without using @code{if}, but it is used often enough, and is important enough, to be included here. It is used, for example, in the code for the function @code{beginning-of-buffer}.
es: Una tercera forma especial, adem@'as de @code{defun} y @code{let}, es el condicional @code{if}. Esta forma es usada para instruir el ordenador para crear decisiones. Se puede escribir definiciones de funci@'on usando @code{if}, pero eso es usado con suficiente frecuencia, y es suficientemente importante para ser incluido aqu@'{@dotless{i}}. Eso es usado, por ejemplo, en el c@'odigo para la funci@'on @code{beginning-of-buffer}.

source: The basic idea behind an @code{if}, is that ``@emph{if} a test is true, @emph{then} an expression is evaluated.'' If the test is not true, the expression is not evaluated. For example, you might make a decision such as, ``if it is warm and sunny, then go to the beach!''
es: La idea b@'asica de un @code{if}, es que ``@emph{if} un test es verdad @emph{then} una expresi@'on es evaluado.'' Si el test no es verdad, la expresi@'on no est@'a evaluada. Por ejemplo, podr@'{@dotless{i}}a crear una decisi@'on tal y como, ``@exclamdown{}si es c@'alido y soleado, entonces a la playa!''

source: if in more detail
es: if en m@'as detalle

source: @code{if} in more detail
es: @code{if} en m@'as detalle

source: @samp{if-part} defined
es: @samp{parte-si} definida

source: @samp{then-part} defined
es: @samp{parte-entonces} definida

source: An @code{if} expression written in Lisp does not use the word `then'; the test and the action are the second and third elements of the list whose first element is @code{if}. Nonetheless, the test part of an @code{if} expression is often called the @dfn{if-part} and the second argument is often called the @dfn{then-part}.
es: Una expresi@'on @code{if} expresi@'on escrita en Lisp no usa la palabra `then'; el test y la acci@'on son el segundo y tercer elementos de la lista cuyo primer elemento es @code{if} (@emph{si}). Ninguno menos, la parte de test de una expresi@'on @code{if} (@emph{si}) es con frecuencia llamada la @dfn{if-part} (@emph{parte-si}) y el segundo argumento es con frecuencia llamada la @dfn{then-part} (@emph{parte-entonces}).

source: Also, when an @code{if} expression is written, the true-or-false-test is usually written on the same line as the symbol @code{if}, but the action to carry out if the test is true, the ``then-part'', is written on the second and subsequent lines. This makes the @code{if} expression easier to read.
es: Tambi@'en, cuando una expresi@'on @code{if} es escrita, el test-verdadero-o-falso es normalmente escrito en la misma l@'{@dotless{i}}nea como el s@'{@dotless{i}}mbolo @code{if}, pero la acci@'on para traer si el test es verdadero, el ``then-part'' @emph{parte-entonces}, es escrita en la segunda y subsiguientes l@'{@dotless{i}}neas. Esto hace que la expresi@'on @code{if} @emph{si} sea f@'acil de leer.

source: (if @var{true-or-false-test} @var{action-to-carry-out-if-test-is-true})
es: (if @var{test-verdadero-o-falso} @var{accion-a-realizar-si-el-test-es-cierto})

source: The true-or-false-test will be an expression that is evaluated by the Lisp interpreter.
es: El test-verdadero-o-falso ser@'a una expresi@'on que es evaluado por el int@'erprete Lisp.

source: Here is an example that you can evaluate in the usual manner. The test is whether the number 5 is greater than the number 4. Since it is, the message @samp{5 is greater than 4!} will be printed.
es: Aqu@'{@dotless{i}} hay un ejemplo que se puede evaluar en la manera normal. El test es si el n@'umero 5 es mayor que el n@'umero 4. Desde eso, el mensaje @samp{@exclamdown{}5 es m@'as grande que 4!} ser@'a impreso.

source: (if (> 5 4) ; @r{if-part} (message "5 is greater than 4!")) ; @r{then-part}
es: (if (> 5 4) ; @r{parte-si} (message "@exclamdown{}5 es mayor que 4!")) ; @r{parte-entonces}

source: (The function @code{>} tests whether its first argument is greater than its second argument and returns true if it is.)
es: (La funci@'on @code{>} chequea si su primer argumento es mayor que su segundo argumento y devuelve cierto si lo es.)

source: > (greater than)
es: > (mayor que)

source: Of course, in actual use, the test in an @code{if} expression will not be fixed for all time as it is by the expression @code{(> 5 4)}. Instead, at least one of the variables used in the test will be bound to a value that is not known ahead of time. (If the value were known ahead of time, we would not need to run the test!)
es: De acuerdo, al uso actual, el test en una expresi@'on @code{if} no ser@'a corregido todo el tiempo, ya que eso es por la expresi@'on @code{(> 5 4)}. En vez, al menos una de las variables usadas en el test ser@'a asociada a un valor que no es conocido en frente del tiempo. (Si el valor fuera conocido en el tiempo, @exclamdown{}no necesitar@'{@dotless{i}}amos ejecutar el test!)

source: For example, the value may be bound to an argument of a function definition. In the following function definition, the character of the animal is a value that is passed to the function. If the value bound to @code{characteristic} is @code{fierce}, then the message, @samp{It's a tiger!} will be printed; otherwise, @code{nil} will be returned.
es: Por ejemplo, el valor puede ser asociado a un argumento de una definici@'on de funci@'on. En la siguiente definici@'on de funci@'on, el car@'acter del animal es un valor que es pasado a la funci@'on. Si el valor asociado a @code{caracter@'{@dotless{i}}stico} es @code{fiero}, entonces el mensaje, @samp{@exclamdown{}Es un tigre!} ser@'a impreso; de otro modo, @code{nil} ser@'a devuelto.

source: (defun type-of-animal (characteristic) "Print message in echo area depending on CHARACTERISTIC. If the CHARACTERISTIC is the symbol `fierce', then warn of a tiger." (if (equal characteristic 'fierce) (message "It's a tiger!")))
es: (defun tipo-de-animal (caracteristica) "Imprime el mensaje en el @'area echo dependiendo de CARACTERISTICA. Si la CARACTERISTICA es el s@'{@dotless{i}}mbolo `fiera', entonces avisa de un tigre." (if (equal caracteristica 'fiera) (message "@exclamdown{}Es un tigre!")))

source: If you are reading this inside of GNU Emacs, you can evaluate the function definition in the usual way to install it in Emacs, and then you can evaluate the following two expressions to see the results:
es: Si est@'a leyendo esto dentro de GNU Emacs, se puede evaluar la definici@'on funci@'on en el modo usual para instalarlo en Emacs, y entonces se puede evaluar las siguientes dos expresiones para ver los resultados:

source: (type-of-animal 'fierce)
es: (tipo-de-animal 'fiera)

source: (type-of-animal 'zebra)
es: (tipo-de-animal 'cebra)

source: When you evaluate @code{(type-of-animal 'fierce)}, you will see the following message printed in the echo area: @code{"It's a tiger!"}; and when you evaluate @code{(type-of-animal 'zebra)} you will see @code{nil} printed in the echo area.
es: Cuando se eval@'ua @code{(tipo-de-animal 'fiero)}, se ver@'a el siguiente mensaje impreso en el @'area echo: @code{"@exclamdown{}Es un tigre!"}; y cuando se eval@'ua @code{(tipo-de-animal 'cebra)} ver@'as @code{nil} impreso en el @'area echo.

source: The @code{type-of-animal} Function in Detail
es: La funci@'on @code{tipo-de-animal} en detalle

source: Let's look at the @code{type-of-animal} function in detail.
es: Mira la funci@'on @code{tipo-de-animal} en detalle.

source: The function definition for @code{type-of-animal} was written by filling the slots of two templates, one for a function definition as a whole, and a second for an @code{if} expression.
es: La definici@'on de funci@'on para @code{tipo-de-animal} fu@'e escrito para rellenar los slots de dos plantillas, uno para una definici@'on de funci@'on como un todo, y un segundo para una expresi@'on @code{if} (@emph{si}).

source: The template for every function that is not interactive is:
es: La plantilla para cada funci@'on que no es interactiva es:

source: (defun @var{name-of-function} (@var{argument-list}) "@var{documentation}@dots{}" @var{body}@dots{})
es: (defun @var{nombre-de-funcion} (@var{lista-de-argumentos}) "@var{documentacion}@dots{}" @var{cuerpo}@dots{})

source: The parts of the function that match this template look like this:
es: Las partes de la funci@'on asociada a esta plantilla es:

source: (defun type-of-animal (characteristic) "Print message in echo area depending on CHARACTERISTIC. If the CHARACTERISTIC is the symbol `fierce', then warn of a tiger." @var{body: the} @code{if} @var{expression})
es: (defun tipo-de-animal (caracteristica) "Imprime el mensaje en el @'area echo dependiendo de CARACTERISTICA. Si la CARACTERISTICA es el s@'{@dotless{i}}mbolo `fiera', entonces avisa de que es un tigre." @var{body: the} @code{if} @var{expression})

source: The name of function is @code{type-of-animal}; it is passed the value of one argument. The argument list is followed by a multi-line documentation string. The documentation string is included in the example because it is a good habit to write documentation string for every function definition. The body of the function definition consists of the @code{if} expression.
es: El nombre de funci@'on es @code{tipo-de-animal}; se pasa al valor de un argumento. La lista de argumentos es seguida por una cadena de documentaci@'on multi-l@'{@dotless{i}}nea. La cadena de documentaci@'on es incluida en el ejemplo porque es un buen h@'abito para escribir documentaci@'on para cada definici@'on de funci@'on. El cuerpo de la definici@'on de funci@'on consiste de la expresi@'on @code{if}.

source: The template for an @code{if} expression looks like this:
es: La plantilla para una expresi@'on @code{if} se ve as@'{@dotless{i}}:

source: (if @var{true-or-false-test} @var{action-to-carry-out-if-the-test-returns-true})
es: (if @var{test-verdadero-o-falso} @var{accion-a-realizar-si-el-test-es-cierto})

source: In the @code{type-of-animal} function, the code for the @code{if} looks like this:
es: En la funci@'on @code{tipo-de-animal}, el c@'odigo para el @code{if} (@emph{si}) se ve as@'{@dotless{i}}:

source: (if (equal characteristic 'fierce) (message "It's a tiger!")))
es: (if (equal caracteristica 'fiero) (message "@exclamdown{}Es un tigre!")))

source: Here, the true-or-false-test is the expression:
es: Aqu@'{@dotless{i}}, est@'a la expresi@'on test-verdadero-o-falso

source: (equal characteristic 'fierce)
es: (equal caracteristica 'fiero)

source: In Lisp, @code{equal} is a function that determines whether its first argument is equal to its second argument. The second argument is the quoted symbol @code{'fierce} and the first argument is the value of the symbol @code{characteristic}---in other words, the argument passed to this function.
es: En Lisp, @code{equal} es una funci@'on que determina si su primer argumento es igual para su segundo argumento. El segundo argumento es el s@'{@dotless{i}}mbolo citado @code{'fiero} y el primer argumento es el valor del s@'{@dotless{i}}mbolo @code{caracter@'{@dotless{i}}stico} --- en otras palabras, el argumento pasado a esta funci@'on.

source: In the first exercise of @code{type-of-animal}, the argument @code{fierce} is passed to @code{type-of-animal}. Since @code{fierce} is equal to @code{fierce}, the expression, @code{(equal characteristic 'fierce)}, returns a value of true. When this happens, the @code{if} evaluates the second argument or then-part of the @code{if}: @code{(message "It's tiger!")}.
es: En el primer ejercicio de @code{tipo-de-animal}, el argumento @code{fiera} es pasado a @code{tipo-de-animal}. Desde que @code{fiera} es igual a @code{fiera}, la expresi@'on, @code{(equal caracteristica 'fiera)}, devuelve un valor de verdad. Cuando esto ocurre, el @code{if} (@emph{si}) eval@'ua el segundo argumento o parte-entonces del @code{if} (@emph{si}): @code{(message "@exclamdown{}Es un tigre!")}.

source: On the other hand, in the second exercise of @code{type-of-animal}, the argument @code{zebra} is passed to @code{type-of-animal}. @code{zebra} is not equal to @code{fierce}, so the then-part is not evaluated and @code{nil} is returned by the @code{if} expression.
es: Por otro lado, en el segundo ejercicio de @code{tipo-de-animal}, el argumento @code{cebra} es pasado a @code{tipo-de-animal}. @code{cebra} no es igual a @code{fiera}, as@'{@dotless{i}} la parte-entonces no est@'a evaluada y se devuelve @code{nil} por la expresi@'on @code{if} (@emph{si}).

source: If--then--else Expressions
es: Expresiones Si--entonces--resto

source: An @code{if} expression may have an optional third argument, called the @dfn{else-part}, for the case when the true-or-false-test returns false. When this happens, the second argument or then-part of the overall @code{if} expression is @emph{not} evaluated, but the third or else-part @emph{is} evaluated. You might think of this as the cloudy day alternative for the decision ``if it is warm and sunny, then go to the beach, else read a book!''.
es: Una expresi@'on @code{if} @emph{si} puede tener un tercer argumento opcional, llamado la @dfn{parte-resto}, para el caso en el que test-verdadero-o-falso devuelve falso. Cuando esto ocurre, el segundo argumento o la parte-entonces sobre todo la expresi@'on @code{if} (@emph{si}), @emph{no} se eval@'ua, pero el tercero o la parte-resto @emph{se} eval@'ua. Se podr@'{@dotless{i}}a pensar en esto como la alternativa del d@'{@dotless{i}}a nublado para la decisi@'on ``si eso es c@'alido y soleado, ve a la playa, sino @exclamdown{}lee un libro!''

source: The word ``else'' is not written in the Lisp code; the else-part of an @code{if} expression comes after the then-part. In the written Lisp, the else-part is usually written to start on a line of its own and is indented less than the then-part:
es: La palabra ``else'' @emph{resto} no est@'a escrita en el c@'odigo Lisp; la parte else @emph{resto} de una expresi@'on @code{if} @emph{si} viene despu@'es de la parte then @emph{entonces}. En el Lisp escrito, la parte else @emph{resto} normalmente se escribe para empezar en la l@'{@dotless{i}}nea siguiente y est@'a menos indentada que la parte then @emph{entonces}:

source: (if @var{true-or-false-test} @var{action-to-carry-out-if-the-test-returns-true} @var{action-to-carry-out-if-the-test-returns-false})
es: (if @var{test-verdadero-o-falso} @var{accion-a-realizar-si-el-test-es-cierto} @var{accion-a-realizar-si-el-test-es-falso})

source: For example, the following @code{if} expression prints the message @samp{4 is not greater than 5!} when you evaluate it in the usual way:
es: Por ejemplo, la siguiente expresi@'on @code{if} imprime el mensaje @samp{@exclamdown{}4 no es mayor que 5!} cuando se eval@'ua eso en el camino usual:

source: (if (> 4 5) ; @r{if-part} (message "4 falsely greater than 5!") ; @r{then-part} (message "4 is not greater than 5!")) ; @r{else-part}
es: (if (> 4 5) ; @r{parte-si} (message "@exclamdown{}4 no es m@'as grande que 5!") ; @r{parte-entonces} (message "@exclamdown{}4 no es m@'as grande que 5!")) ; @r{parte-resto}

source: Note that the different levels of indentation make it easy to distinguish the then-part from the else-part. (GNU Emacs has several commands that automatically indent @code{if} expressions correctly. @xref{Typing Lists, , GNU Emacs Helps You Type Lists}.)
es: N@'otese que los diferentes niveles de indentaci@'on hacen f@'acil distinguir la parte then desde la parte resto. (GNU Emacs tiene varios comandos que autom@'aticamente indenta expresiones correctamente @code{if} @emph{si}. @xref{Escribiendo listas, , GNU Emacs te ayuda a escribir listas}.)

source: We can extend the @code{type-of-animal} function to include an else-part by simply incorporating an additional part to the @code{if} expression.
es: Podemos extender la funci@'on @code{tipo-de-animal} para incluir una parte else para simplemente incorporar una parte adicional para la expresi@'on @code{if} @emph{si}.
