Repository: gitGNU/gnu_elisp-es
Catalog: emacs-lisp-intro-*.po
Languages: es

source: However, if we mark the @code{multiply-by-seven} definition with @kbd{C-M-h} (@code{mark-defun}), and then call @code{@value{COUNT-WORDS}} on it, we will find that @code{@value{COUNT-WORDS}} claims the definition has eleven words, not ten! Something is wrong!
es: Sin embargo, si se marca la definici@'on @code{multiply-by-seven} con @kbd{C-M-h} (@code{mark-defun}), y entonces se llama a @code{@value{COUNT-WORDS}} dentro, se encontrar@'a que @code{@value{COUNT-WORDS}} @exclamdown{}reclama la definici@'on tiene once palabras, no diez! @exclamdown{}Alguna cosa est@'a mal!

source: The problem is twofold: @code{@value{COUNT-WORDS}} does not count the @samp{*} as a word, and it counts the single symbol, @code{multiply-by-seven}, as containing three words. The hyphens are treated as if they were interword spaces rather than intraword connectors: @samp{multiply-by-seven} is counted as if it were written @samp{multiply by seven}.
es: El problema es doble: @code{@value{COUNT-WORDS}} no cuenta el @samp{*} como una palabra, y eso cuenta el s@'{@dotless{i}}mbolo simple, @code{multiply-by-seven}, conteniendo tres palabras. Las conexiones son tratadas como si fueran espacios entre palabras en vez de conectores entre palabras @samp{multiply-by-seven} se cuenta como si fuese escrito @samp{multiply-by-seven}.

source: The cause of this confusion is the regular expression search within the @code{@value{COUNT-WORDS}} definition that moves point forward word by word. In the canonical version of @code{@value{COUNT-WORDS}}, the regexp is:
es: La causa de esta confusi@'on es la expresi@'on regular que busca la definici@'on @code{@value{COUNT-WORDS}} que mueve el punto hacia delante palabra por palabra. En la versi@'on can@'onica de @code{@value{COUNT-WORDS}}, el regexp es:

source: This regular expression is a pattern defining one or more word constituent characters possibly followed by one or more characters that are not word constituents. What is meant by `word constituent characters' brings us to the issue of syntax, which is worth a section of its own.
es: Esta expresi@'on regular es un patr@'on definiendo una o m@'as palabras constituyendo caracteres posiblemente seguidos por uno o m@'as caracteres que no son palabras constituyentes. Esto significa que los `caracteres que constituyen palabras' nos traen la cuesti@'on de la sintaxis, que es el valor de una secci@'on en s@'{@dotless{i}}.

source: What Constitutes a Word or Symbol?
es: @questiondown{}Qu@'e constituye una palabra o s@'{@dotless{i}}mbolo?

source: Syntax categories and tables
es: Categor@'{@dotless{i}}as de sintaxis y tablas

source: Emacs treats different characters as belonging to different @dfn{syntax categories}. For example, the regular expression, @samp{\\w+}, is a pattern specifying one or more @emph{word constituent} characters. Word constituent characters are members of one syntax category. Other syntax categories include the class of punctuation characters, such as the period and the comma, and the class of whitespace characters, such as the blank space and the tab character. (For more information, @pxref{Syntax Tables, , Syntax Tables, elisp, The GNU Emacs Lisp Reference Manual}.)
es: Emacs trata diferentes caracteres perteneciendo a diferentes @dfn{categor@'{@dotless{i}}as de sintaxis}. Por ejemplo, la expresi@'on regular, @samp{\\w+}, es un patr@'on especificando uno o m@'as caracteres de @emph{palabras constituyentes}. Los caracteres de palabras constituyentes son miembros de una categor@'{@dotless{i}}a de sintaxis. Otras categor@'{@dotless{i}}a de sintaxis incluye la clase de caracteres de puntuaci@'on, tales como el espacio en blanco o el caracter de tabulaci@'on. (Para m@'as informaci@'on, ver @ref{Sintaxis, Sintaxis, La Tabla de Sintaxis, emacs, El Manual GNU Emacs}, y @ref{Tablas de Sintaxis, , Tablas de Sintaxis, elisp, El Manual de Referencia GNU Emacs Lisp}.)

source: Syntax tables specify which characters belong to which categories. Usually, a hyphen is not specified as a `word constituent character'. Instead, it is specified as being in the `class of characters that are part of symbol names but not words.' This means that the @code{@value{COUNT-WORDS}} function treats it in the same way it treats an interword white space, which is why @code{@value{COUNT-WORDS}} counts @samp{multiply-by-seven} as three words.
es: Las tablas de sintaxis especifican qu@'e caracteres pertenecen a qu@'e categor@'{@dotless{i}}as. Normalmente un gui@'on no est@'a especificado como un `caracter constituido por una palabra'. En vez de eso, se especific@'o como estando en la `clase de caracteres que son parte de los nombres de s@'{@dotless{i}}mbolos, pero no las palabras.' Esto significa que la funci@'on @code{@value{COUNT-WORDS}} se trata del mismo modo que trata un espacio en blanco entre palabras, que es el por qu@'e @code{@value{COUNT-WORDS}} cuenta @samp{multiply-by-seven} como tres palabras.

source: There are two ways to cause Emacs to count @samp{multiply-by-seven} as one symbol: modify the syntax table or modify the regular expression.
es: Hay dos caminos para causar que Emacs cuente @samp{multiply-by-seven} como un s@'{@dotless{i}}mbolo: modificar la tabla de sintaxis o modificar la expresi@'on regular.

source: We could redefine a hyphen as a word constituent character by modifying the syntax table that Emacs keeps for each mode. This action would serve our purpose, except that a hyphen is merely the most common character within symbols that is not typically a word constituent character; there are others, too.
es: Se podr@'{@dotless{i}}a redefinir un gui@'on (@emph{hyphen}) como un caracter que constituye una palabra modificando la tabla de sintaxis que Emacs guarda por cada modo. Esta acci@'on servir@'{@dotless{i}}a nuestro prop@'osito, excepto que una conexi@'on es meramente el caracter m@'as com@'un con s@'{@dotless{i}}mbolos que no son t@'{@dotless{i}}picamente un caracter de palabra constituyente; hay otros, tambi@'en.

source: Alternatively, we can redefine the regexp used in the @code{@value{COUNT-WORDS}} definition so as to include symbols. This procedure has the merit of clarity, but the task is a little tricky.
es: Alternativamente, se puede redefinir la expresi@'on regular @emph{regexp} usada en la definici@'on @code{count-words} as@'{@dotless{i}} como incluir s@'{@dotless{i}}mbolos. Este procedimiento tiene el m@'erito de la claridad, pero la tarea es un peque@~no truco.

source: The first part is simple enough: the pattern must match ``at least one character that is a word or symbol constituent''. Thus:
es: La primera parte es suficientemente simple: el patr@'on debe asignarse ``al menos un car@'acter que es una palabra o s@'{@dotless{i}}mbolo constituyente''. De este modo:

source: The @samp{\\(} is the first part of the grouping construct that includes the @samp{\\w} and the @samp{\\s_} as alternatives, separated by the @samp{\\|}. The @samp{\\w} matches any word-constituent character and the @samp{\\s_} matches any character that is part of a symbol name but not a word-constituent character. The @samp{+} following the group indicates that the word or symbol constituent characters must be matched at least once.
es: El @samp{\\(} es la primera parte del constructo que agrupa esto que incluye el @samp{\\w} y el @samp{\\s_} como alternativas, separadas por los @samp{\\|}. El @samp{\\w} asocia cualquier caracter de palabra constituyente y el @samp{\\s_} asocia cualquier caracter que es parte de un nombre de s@'{@dotless{i}}mbolo pero no una palabra de caracteres constituyente. El @samp{+} sigue al grupo que indica que la palabra o s@'{@dotless{i}}mbolo constituyan caracteres que deben ser asociados al menos por uno.

source: However, the second part of the regexp is more difficult to design. What we want is to follow the first part with ``optionally one or more characters that are not constituents of a word or symbol''. At first, I thought I could define this with the following:
es: Sin embargo, la segunda parte de regexp es m@'as dif@'{@dotless{i}}cil de dise@~nar. Lo que queremos es seguir la primera parte con ``opcionalmente uno o m@'as caracteres que no constituyen una palabra o s@'{@dotless{i}}mbolo''. Primero, se pensaba que se podr@'{@dotless{i}}a definir esto con lo siguiente:

source: The upper case @samp{W} and @samp{S} match characters that are @emph{not} word or symbol constituents. Unfortunately, this expression matches any character that is either not a word constituent or not a symbol constituent. This matches any character!
es: Las may@'usculas @samp{W} y @samp{S} asocian caracteres que @emph{no} son constituyente de palabra o s@'{@dotless{i}}mbolo. Desafortunadamente, esta expresi@'on asocia cualquier caracter que sea o no una palabra constituyente no un s@'{@dotless{i}}mbolo constituyente. @exclamdown{}Esto asocia cualquier caracter!

source: I then noticed that every word or symbol in my test region was followed by white space (blank space, tab, or newline). So I tried placing a pattern to match one or more blank spaces after the pattern for one or more word or symbol constituents. This failed, too. Words and symbols are often separated by whitespace, but in actual code parentheses may follow symbols and punctuation may follow words. So finally, I designed a pattern in which the word or symbol constituents are followed optionally by characters that are not white space and then followed optionally by white space.
es: Entonces se notific@'o que cada palabra o s@'{@dotless{i}}mbolo en mi regi@'on test fu@'e seguida por alg@'un espacio (espacio en blanco, tabulador, o nueva l@'{@dotless{i}}nea). As@'{@dotless{i}} yo intent@'e emplazar un patr@'on para asociar uno o m@'as espacios en blanco despu@'es del patr@'on para una o m@'as palabras o s@'{@dotless{i}}mbolos constituyentes. Esto fall@'o, tambi@'en. Palabras y s@'{@dotless{i}}mbolos son con frecuencia separados por espacios en blanco, pero en el c@'odigo actual los par@'entesis pueden seguir s@'{@dotless{i}}mbolos y puntuaci@'on puede seguir las palabras. As@'{@dotless{i}} finalmente, se dise@~no un patr@'on en el que la palabra o s@'{@dotless{i}}mbolo constituyente es seguido opcionalmente por caracteres que no son espacios en blanco y entonces son seguidos opcionalmente por espacios en blanco.

source: Here is the full regular expression:
es: Aqu@'{@dotless{i}} est@'a la expresi@'on regular completa:

source: The @code{count-words-in-defun} Function
es: La funci@'on @code{count-words-in-defun}

source: We have seen that there are several ways to write a @code{count-words-region} function. To write a @code{count-words-in-defun}, we need merely adapt one of these versions.
es: Se ha visto que hay varios caminos para escribir una funci@'on @code{count-word-region}. Para escribir un @code{count-words-in-defun}, se necesita solamente adaptar una de estas versiones.

source: The version that uses a @code{while} loop is easy to understand, so I am going to adapt that. Because @code{count-words-in-defun} will be part of a more complex program, it need not be interactive and it need not display a message but just return the count. These considerations simplify the definition a little.
es: La versi@'on que usa un bucle @code{while} es f@'acil de comprender, as@'{@dotless{i}} estoy yendo a adaptar esto. Porque @code{count-words-in-defun} ser@'a parte de un programa m@'as complejo, eso no necesita ser interactivo y no necesita mostrar un mensaje pero solo devuelve el contaje. Estas consideraciones simplifican la definici@'on un poco.

source: On the other hand, @code{count-words-in-defun} will be used within a buffer that contains function definitions. Consequently, it is reasonable to ask that the function determine whether it is called when point is within a function definition, and if it is, to return the count for that definition. This adds complexity to the definition, but saves us from needing to pass arguments to the function.
es: Por otro lado, @code{count-words-in-defun} ser@'a usado con un buffer que contiene definiciones de funci@'on. Consiguientemente, es razonable preguntar que la funci@'on determina si se llam@'o cuando el punto est@'a con una definici@'on de funci@'on, y eso es, para devolver el contaje para esta definici@'on. Esto a@~nade complejidad a la definici@'on, pero nos guarda desde la necesidad de pasar argumentos a la funci@'on.

source: These considerations lead us to prepare the following template:
es: Estas consideraciones nos llevan a preparar la siguiente plantilla:

source: As usual, our job is to fill in the slots.
es: As@'{@dotless{i}}, el trabajo es rellenar los slots.

source: First, the set up.
es: Primero, la configuraci@'on.

source: We are presuming that this function will be called within a buffer containing function definitions. Point will either be within a function definition or not. For @code{count-words-in-defun} to work, point must move to the beginning of the definition, a counter must start at zero, and the counting loop must stop when point reaches the end of the definition.
es: Estamos presuponiendo que esta funci@'on ser@'a llamada con un b@'uffer conteniendo definiciones de funci@'on. Apunta si ser@'a con una definici@'on de funci@'on o no. Para que @code{count-words-in-defun} funcione, el punto debe moverse al principio de la definici@'on, un contador debe empezar a cero, y el bucle contando debe parar cuando el punto logre el fin de la definici@'on.

source: The @code{beginning-of-defun} function searches backwards for an opening delimiter such as a @samp{(} at the beginning of a line, and moves point to that position, or else to the limit of the search. In practice, this means that @code{beginning-of-defun} moves point to the beginning of an enclosing or preceding function definition, or else to the beginning of the buffer. We can use @code{beginning-of-defun} to place point where we wish to start.
es: La funci@'on @code{beginning-of-defun} busca atr@'as para un delimitador de apertura tal como @samp{(} al principio de una l@'{@dotless{i}}nea, y mueve el punto a esta posici@'on, o sino al l@'{@dotless{i}}mite de la b@'usqueda. En la pr@'actica, esto significa que @code{beginning-of-defun} mueve el punto al principio de un cierre o definici@'on de funci@'on precedente, o sino al principio del buffer.

source: The @code{while} loop requires a counter to keep track of the words or symbols being counted. A @code{let} expression can be used to create a local variable for this purpose, and bind it to an initial value of zero.
es: El bucle @code{while} requiere un contador para guardar la traza de las palabras o s@'{@dotless{i}}mbolos siendo contados. Una expresi@'on @code{let} puede ser usado para crear una variable local para este prop@'osito, y lo asocia a un valor inicial de cero.

source: The @code{end-of-defun} function works like @code{beginning-of-defun} except that it moves point to the end of the definition. @code{end-of-defun} can be used as part of an expression that determines the position of the end of the definition.
es: La funci@'on @code{end-of-defun} funciona como @code{beginning-of-defun} excepto que mueve el punto al fin de la definici@'on. @code{end-of-defun} puede ser usado como parte de una expresi@'on que determina la posici@'on del fin de la definici@'on.

source: The set up for @code{count-words-in-defun} takes shape rapidly: first we move point to the beginning of the definition, then we create a local variable to hold the count, and finally, we record the position of the end of the definition so the @code{while} loop will know when to stop looping.
es: La configuraci@'on para @code{count-words-in-defun} toma forma r@'apidamente: primero movemos el punto al principio de la definici@'on, entonces se crea una variable local para manejar el conteo, y finalmente, se graba la posici@'on del fin de la definici@'on as@'{@dotless{i}} el bucle @code{while} conocer@'a cuando parar el bucle.

source: The code is simple. The only slight complication is likely to concern @code{end}: it is bound to the position of the end of the definition by a @code{save-excursion} expression that returns the value of point after @code{end-of-defun} temporarily moves it to the end of the definition.
es: El c@'odigo es simple. La @'unica ligera complicaci@'on es probablemente ir al @code{end}: eso est@'a asociado a la posici@'on del fin de la definici@'on por una expresi@'on @code{save-excursion} que devuelve el valor del punto despu@'es de @code{end-of-defun} temporalmente se mueve al fin de la definici@'on.

source: The second part of the @code{count-words-in-defun}, after the set up, is the @code{while} loop.
es: La segunda parte del @code{count-words-in-defun}, despu@'es de la configuraci@'on, es el bucle @code{while}.

source: The loop must contain an expression that jumps point forward word by word and symbol by symbol, and another expression that counts the jumps. The true-or-false-test for the @code{while} loop should test true so long as point should jump forward, and false when point is at the end of the definition. We have already redefined the regular expression for this, so the loop is straightforward:
es: El bucle debe contener una expresi@'on que mueva el punto hacia adelante palabra por palabra y s@'{@dotless{i}}mbolo por s@'{@dotless{i}}mbolo, y otra expresi@'on que cuente los saltos. El test-verdadero-o-falso para el bucle @code{while} chequear@'{@dotless{i}}a verdadero tan largo como el punto deber@'{@dotless{i}}a saltar hacia adelante, y falso si apunta al fin de la definici@'on. Ya se ha redefinido la expresi@'on regular para esto, as@'{@dotless{i}} el bucle es sencillo:

source: The third part of the function definition returns the count of words and symbols. This part is the last expression within the body of the @code{let} expression, and can be, very simply, the local variable @code{count}, which when evaluated returns the count.
es: La tercera parte de la definici@'on devuelve el contaje de palabras y s@'{@dotless{i}}mbolos. Esta parte es la @'ultima expresi@'on con el cuerpo de la expresi@'on @code{let}, y puede ser, muy la variable local @code{count}, que cuando se eval@'ua devuelve el contaje.

source: Put together, the @code{count-words-in-defun} definition looks like this:
es: Puesto junto, la definici@'on @code{count-words-in-defun} se ve as@'{@dotless{i}}:

source: (defun count-words-in-defun () "Return the number of words and symbols in a defun." (beginning-of-defun) (let ((count 0) (end (save-excursion (end-of-defun) (point))))
es: (defun count-words-in-defun () "Devuelve el n@'umero de palabras y s@'{@dotless{i}}mbolos en una defun." (beginning-of-defun) (let ((count 0) (end (save-excursion (end-of-defun) (point))))

source: How to test this? The function is not interactive, but it is easy to put a wrapper around the function to make it interactive; we can use almost the same code as for the recursive version of @code{@value{COUNT-WORDS}}:
es: @questiondown{}C@'omo se chequea esto? La funci@'on no es interactiva, pero es f@'acil poner un envoltorio alrededor de la funci@'on para hacerla interactiva; se puede usar casi el mismo c@'odigo como la versi@'on recursiva de @code{@value{COUNT-WORDS}}:

source: ;;; @r{Interactive version.} (defun count-words-defun () "Number of words and symbols in a function definition." (interactive) (message "Counting words and symbols in function definition ... ")
es: ;;; @r{Versi@'on Interactiva.} (defun count-words-defun () "N@'umero de palabras y s@'{@dotless{i}}mbolos en una definici@'on de funci@'on." (interactive) (message "Contando palabras y s@'{@dotless{i}}mbolos en la definici@'on de funci@'on ... ")

source: (let ((count (count-words-in-defun))) (cond ((zerop count) (message "The definition does NOT have any words or symbols."))
es: (let ((count (count-words-in-defun))) (cond ((zerop count) (message "La definici@'on NO tiene palabras o s@'{@dotless{i}}mbolos."))

source: ((= 1 count) (message "The definition has 1 word or symbol.")) (t (message "The definition has %d words or symbols." count)))))
es: ((= 1 count) (message "La definici@'on tiene 1 palabra o s@'{@dotless{i}}mbolo.")) (t (message "La definici@'on tiene %d palabras o s@'{@dotless{i}}mbolos." count)))))

source: Let's re-use @kbd{C-c =} as a convenient keybinding:
es: Permite reutilizar @kbd{C-c =} como un atajo conveniente:

source: Now we can try out @code{count-words-defun}: install both @code{count-words-in-defun} and @code{count-words-defun}, and set the keybinding, and then place the cursor within the following definition:
es: Ahora se puede intentar @code{count-words-defun}: instala ambas funciones @code{count-words-in-defun} y @code{count-words-defun}, y asigna el atajo, y entonces emplaza el cursor con la siguiente definici@'on:

source: (defun multiply-by-seven (number) "Multiply NUMBER by seven." (* 7 number)) @result{} 10
es: (defun multiply-by-seven (number) "Multiplicar NUMBER por siete." (* 7 number)) @result{} 10

source: Success! The definition has 10 words and symbols.
es: @exclamdown{}@'Exito! La definici@'on tiene 10 palabras y s@'{@dotless{i}}mbolos.

source: The next problem is to count the numbers of words and symbols in several definitions within a single file.
es: El siguiente problema es contar los n@'umeros de palabras y s@'{@dotless{i}}mbolos en varias definiciones con un fichero simple.

source: Count Several @code{defuns} Within a File
es: Contar varias @code{defuns} en un fichero

source: A file such as @file{simple.el} may have a hundred or more function definitions within it. Our long term goal is to collect statistics on many files, but as a first step, our immediate goal is to collect statistics on one file.
es: Un fichero tal como @file{simple.el} puede tener un centenar o m@'as definiciones de funci@'on dentro. Nuestro objetivo es recoger estad@'{@dotless{i}}sticas en muchos ficheros, pero en un primer paso, nuestro objetivo inmediato es recoger estad@'{@dotless{i}}sticas en un fichero.

source: The information will be a series of numbers, each number being the length of a function definition. We can store the numbers in a list.
es: La informaci@'on ser@'a una serie de n@'umeros, cada n@'umero siendo el tama@~no de una definici@'on de funci@'on. Se pueden almacenar los n@'umeros en una lista.

source: We know that we will want to incorporate the information regarding one file with information about many other files; this means that the function for counting definition lengths within one file need only return the list of lengths. It need not and should not display any messages.
es: Se sabe que se querr@'a incorporar la informaci@'on considerando un fichero con informaci@'on acerca de muchos otros ficheros; esto significa que la funci@'on para contar el tama@~no de contaje con un fichero solo necesita devolver la lista de tama@~nos. Eso no necesita y no mostrar@'{@dotless{i}}a mensajes.

source: The word count commands contain one expression to jump point forward word by word and another expression to count the jumps. The function to return the lengths of definitions can be designed to work the same way, with one expression to jump point forward definition by definition and another expression to construct the lengths' list.
es: Los comando de contar palabras contienen una expresi@'on para saltar el punto hacia adelante palabra por palabra y otra expresi@'on para contar los saltos. La funci@'on devuelve los tama@~nos de definiciones que pueden ser dise@~nadas para trabajar del mismo modo, con una expresi@'on para saltar el punto hacia la definici@'on por definici@'on y otra expresi@'on para construir el tama@~no de la lista.
